{
  "topic_title": "Workplace Harassment Investigation",
  "category": "Security And Risk Management - Investigation Types",
  "flashcards": [
    {
      "question_text": "According to the U.S. Equal Employment Opportunity Commission (EEOC), what is a primary characteristic of a legally covered harassment claim?",
      "correct_answer": "The conduct must be based on a legally protected characteristic.",
      "distractors": [
        {
          "text": "The conduct must be severe and pervasive enough to alter employment conditions.",
          "misconception": "Targets [severity/pervasiveness confusion]: Confuses a necessary condition for a hostile work environment with the foundational requirement of a protected basis."
        },
        {
          "text": "The conduct must be explicitly sexual in nature.",
          "misconception": "Targets [scope of harassment]: Incorrectly limits harassment to only sexual conduct, ignoring other protected bases."
        },
        {
          "text": "The conduct must be reported directly to the EEOC within 45 days.",
          "misconception": "Targets [procedural misunderstanding]: Confuses the initial reporting requirement with the definition of harassment itself."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Harassment is only covered by federal EEO laws if it is based on a protected characteristic, such as race, sex, religion, or disability, because this establishes the discriminatory intent required for legal action.",
        "distractor_analysis": "Distractors address common misunderstandings about harassment claims, such as focusing solely on severity, limiting it to sexual conduct, or misstating procedural requirements.",
        "analogy": "Think of the protected characteristic as the 'why' behind the harassment; without that 'why,' it's just workplace conflict, not illegal discrimination."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": []
    },
    {
      "question_text": "What is the primary goal of a workplace investigation into harassment allegations, as outlined by best practices?",
      "correct_answer": "To gather and review information impartially to determine if harassment occurred and recommend appropriate remedial actions.",
      "distractors": [
        {
          "text": "To immediately discipline the accused party to deter future incidents.",
          "misconception": "Targets [procedural error]: Jumps to disciplinary action before a thorough, impartial determination is made."
        },
        {
          "text": "To protect the company from legal liability by minimizing the complaint's impact.",
          "misconception": "Targets [investigator bias]: Focuses on legal defense rather than objective fact-finding and fairness."
        },
        {
          "text": "To facilitate an informal resolution between the parties, regardless of severity.",
          "misconception": "Targets [scope of informal resolution]: Assumes informal resolution is always appropriate, ignoring serious allegations or power imbalances."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Investigations aim to establish facts impartially because a thorough understanding is necessary to determine if harassment occurred and what corrective actions are needed to restore the workplace and prevent recurrence.",
        "distractor_analysis": "Distractors represent common misinterpretations of investigation goals, such as prioritizing discipline over process, focusing on legal defense, or inappropriately pushing for informal resolution.",
        "analogy": "A workplace investigation is like a detective's work: gather all clues, analyze them objectively, and then determine what happened and what needs to be done to fix the situation."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": []
    },
    {
      "question_text": "When conducting a workplace harassment investigation, what is the significance of 'transparency' as a guiding principle?",
      "correct_answer": "It ensures both parties are aware of the information being considered and have an opportunity to respond, maintaining trust in the process.",
      "distractors": [
        {
          "text": "It means all investigation notes and evidence are immediately made public.",
          "misconception": "Targets [confidentiality misunderstanding]: Confuses transparency with public disclosure, ignoring privacy needs."
        },
        {
          "text": "It requires the investigator to share their preliminary conclusions with both parties.",
          "misconception": "Targets [procedural error]: Prematurely sharing conclusions compromises impartiality and the investigation's integrity."
        },
        {
          "text": "It mandates that only the employer receives all information to ensure consistent application of policy.",
          "misconception": "Targets [fairness violation]: Excludes parties from information relevant to their case, undermining procedural fairness."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Transparency in investigations ensures fairness by allowing both parties to see and respond to relevant information, because this open process builds trust and upholds procedural integrity.",
        "distractor_analysis": "Distractors misinterpret transparency as public disclosure, premature conclusion sharing, or one-sided information flow, all of which undermine a fair investigation.",
        "analogy": "Transparency in an investigation is like showing your cards in a game; it ensures everyone knows the rules and the information being used, leading to a fairer outcome."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": []
    },
    {
      "question_text": "According to the Canadian Human Rights Commission, what is a key characteristic of 'microaggressions' in the context of workplace harassment?",
      "correct_answer": "They are brief, indirect, and often unintentional slights that communicate discriminatory attitudes.",
      "distractors": [
        {
          "text": "They are always intentional and severe acts of aggression.",
          "misconception": "Targets [severity misinterpretation]: Equates microaggressions with overt, severe harassment, missing their subtle nature."
        },
        {
          "text": "They are only verbal and never involve actions or environmental cues.",
          "misconception": "Targets [form of microaggression]: Incorrectly limits microaggressions to verbal communication only."
        },
        {
          "text": "They are minor annoyances that have no cumulative harmful impact.",
          "misconception": "Targets [impact misunderstanding]: Underestimates the cumulative harm caused by frequent microaggressions."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Microaggressions are subtle, often unintentional slights that communicate discriminatory attitudes because their cumulative effect can create a hostile and unwelcoming environment, impacting individuals from equity-deserving groups.",
        "distractor_analysis": "Distractors misrepresent microaggressions by focusing on intent, limiting their form, or downplaying their significant cumulative impact.",
        "analogy": "Microaggressions are like tiny paper cuts; individually they might seem minor, but over time, they can cause significant pain and damage."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": []
    },
    {
      "question_text": "In workplace harassment investigations, when is an employer considered negligent regarding harassment by non-supervisory employees or non-employees?",
      "correct_answer": "When the employer unreasonably failed to prevent the harassment or failed to take reasonable corrective action after having notice.",
      "distractors": [
        {
          "text": "When the employer has a written anti-harassment policy in place.",
          "misconception": "Targets [policy vs. practice]: Assumes policy existence alone negates negligence, ignoring implementation and enforcement."
        },
        {
          "text": "When the harassment is reported by a coworker rather than the victim.",
          "misconception": "Targets [reporting channel misunderstanding]: Incorrectly assumes only direct victim complaints trigger employer responsibility."
        },
        {
          "text": "When the harassment occurs outside of regular working hours or the physical workplace.",
          "misconception": "Targets [scope of workplace]: Fails to recognize that harassment outside the physical workplace can still impact it and create employer liability."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Employer negligence in harassment cases arises from a failure to act reasonably, either by not preventing foreseeable harassment or by not correcting it once aware, because the employer has a duty to maintain a safe work environment.",
        "distractor_analysis": "Distractors misrepresent employer responsibility by overemphasizing policy, misinterpreting reporting channels, or narrowly defining the 'workplace'.",
        "analogy": "An employer is negligent like a homeowner who knows a loose step exists but does nothing about it; they are responsible if someone gets hurt because of that inaction."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": []
    },
    {
      "question_text": "What is the 'Faragher-Ellerth' affirmative defense in the context of supervisor harassment leading to a hostile work environment?",
      "correct_answer": "It allows an employer to limit liability if they exercised reasonable care to prevent/correct harassment AND the employee unreasonably failed to utilize preventive/corrective opportunities.",
      "distractors": [
        {
          "text": "It automatically absolves the employer if the supervisor was not a direct alter ego.",
          "misconception": "Targets [defense applicability]: Incorrectly assumes the defense applies broadly to all supervisors, ignoring the 'tangible employment action' caveat."
        },
        {
          "text": "It requires the employer to prove the employee welcomed the harassment.",
          "misconception": "Targets [burden of proof error]: Misattributes the burden of proving unwelcomeness to the employee, rather than the employer proving defense elements."
        },
        {
          "text": "It is only applicable if the harassment did not result in any psychological harm to the employee.",
          "misconception": "Targets [harm requirement misunderstanding]: Incorrectly links the defense to the absence of psychological harm, rather than the employee's failure to report."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The Faragher-Ellerth defense allows employers to limit liability for supervisor harassment (without tangible employment actions) because it balances employer responsibility with employee responsibility to report and avoid harm, thus encouraging proactive measures.",
        "distractor_analysis": "Distractors misrepresent the defense by broadening its applicability, misplacing the burden of proof, or incorrectly linking it to the severity of harm rather than the employee's actions.",
        "analogy": "The Faragher-Ellerth defense is like a 'shared responsibility' clause; the employer must prove they did their part (prevention/correction) and that the employee didn't do theirs (reporting/avoiding harm)."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": []
    },
    {
      "question_text": "When is an employer automatically liable for harassment by a supervisor, without the possibility of an affirmative defense?",
      "correct_answer": "When the supervisor's harassment includes a tangible employment action against the victim.",
      "distractors": [
        {
          "text": "When the supervisor is a member of a protected class.",
          "misconception": "Targets [protected class irrelevance]: Incorrectly assumes protected class status of the harasser negates employer liability."
        },
        {
          "text": "When the harassment is reported to HR within 30 days.",
          "misconception": "Targets [procedural misunderstanding]: Confuses reporting timelines with the condition that triggers automatic liability (tangible employment action)."
        },
        {
          "text": "When the employer has a comprehensive anti-harassment policy.",
          "misconception": "Targets [policy vs. action]: Assumes policy alone prevents automatic liability, ignoring the impact of tangible employment actions."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Employers are automatically liable when a supervisor's harassment includes a tangible employment action because such actions require official employer authority, signifying the employer's direct involvement and removing the possibility of an affirmative defense.",
        "distractor_analysis": "Distractors incorrectly link automatic liability to the harasser's protected status, reporting timelines, or the mere existence of a policy, rather than the critical factor of a tangible employment action.",
        "analogy": "Automatic employer liability for supervisor harassment with a tangible employment action is like a company being directly responsible when its CEO fires someone unfairly; the CEO's action is the company's action."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": []
    },
    {
      "question_text": "What is the primary purpose of developing 'Terms of Reference' for a workplace investigation?",
      "correct_answer": "To define the scope and mandate of the investigation, ensuring it remains focused and adheres to procedural fairness.",
      "distractors": [
        {
          "text": "To pre-determine the outcome of the investigation based on initial allegations.",
          "misconception": "Targets [bias in process]: Suggests the TOR dictates the outcome, undermining impartiality and thoroughness."
        },
        {
          "text": "To guarantee confidentiality for all parties involved throughout the process.",
          "misconception": "Targets [scope of TOR]: Confuses the TOR's role in defining scope with the separate confidentiality agreement's purpose."
        },
        {
          "text": "To assign blame and determine disciplinary actions before evidence is gathered.",
          "misconception": "Targets [premature judgment]: Misrepresents the TOR as a tool for pre-judging guilt rather than defining the investigation's boundaries."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Clear Terms of Reference are crucial because they establish the investigation's boundaries and mandate, ensuring impartiality and thoroughness by defining precisely what issues will be examined and preventing the investigation from exceeding its scope.",
        "distractor_analysis": "Distractors misrepresent the TOR's function by suggesting it predetermines outcomes, guarantees confidentiality, or assigns blame, rather than defining the investigation's parameters.",
        "analogy": "Terms of Reference for an investigation are like the rules of a game; they set the boundaries and objectives, ensuring everyone plays by the same guidelines."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": []
    },
    {
      "question_text": "In a workplace harassment investigation, why is 'timeliness' considered a critical guiding principle?",
      "correct_answer": "Prompt investigations minimize prolonged workplace tension, preserve evidence, and ensure memories remain clear, upholding procedural fairness.",
      "distractors": [
        {
          "text": "To ensure the employer meets the minimum legal deadlines for concluding investigations.",
          "misconception": "Targets [minimum vs. optimal]: Focuses on meeting legal minimums rather than the broader benefits of promptness for fairness and evidence integrity."
        },
        {
          "text": "To allow the employer sufficient time to prepare a legal defense.",
          "misconception": "Targets [investigation purpose]: Misrepresents the investigation's goal as legal defense preparation rather than objective fact-finding."
        },
        {
          "text": "To give the responding party ample time to gather counter-evidence.",
          "misconception": "Targets [fairness imbalance]: Prioritizes one party's preparation time over the overall need for a timely and efficient investigation."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Timeliness is crucial because prompt investigations uphold procedural fairness by preserving evidence and memories, and reducing workplace anxiety, thereby ensuring a more accurate and effective resolution.",
        "distractor_analysis": "Distractors misinterpret timeliness by focusing solely on legal minimums, framing it as a defense tactic, or prioritizing one party's preparation over the investigation's overall integrity.",
        "analogy": "Timeliness in an investigation is like preserving evidence at a crime scene; the sooner you act, the less likely it is to be contaminated or lost, leading to a more accurate reconstruction of events."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": []
    },
    {
      "question_text": "What is the role of an 'applicable partner' in the context of workplace harassment investigations under Canadian federal law?",
      "correct_answer": "To jointly determine which recommendations from the investigation report should be implemented by the employer.",
      "distractors": [
        {
          "text": "To conduct the investigation independently and report findings directly to the Minister of Labour.",
          "misconception": "Targets [role confusion]: Assigns the investigator's role to the applicable partner and misstates reporting lines."
        },
        {
          "text": "To provide legal representation to the principal party during the investigation.",
          "misconception": "Targets [representation misunderstanding]: Confuses the partner's role with that of a legal advocate."
        },
        {
          "text": "To solely decide on the disciplinary actions to be taken against the responding party.",
          "misconception": "Targets [decision-making authority]: Incorrectly assigns sole disciplinary authority to the partner, rather than joint decision-making on recommendations."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The applicable partner collaborates with the employer to decide on implementing investigation recommendations because this joint approach ensures that corrective actions are appropriate and effectively address the findings, promoting a healthier workplace.",
        "distractor_analysis": "Distractors misrepresent the applicable partner's role by assigning investigative duties, legal representation, or sole disciplinary authority, rather than their collaborative function in implementing recommendations.",
        "analogy": "The 'applicable partner' acts like a co-pilot with the employer; they review the flight plan (investigation report) and jointly decide on the best course of action (implementing recommendations)."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": []
    },
    {
      "question_text": "When is an employer NOT required to investigate an allegation of workplace misconduct?",
      "correct_answer": "When the allegation is 'bald,' meaning it lacks sufficient detail to meet the definition of workplace violence or harassment under relevant laws.",
      "distractors": [
        {
          "text": "When the allegation is made verbally instead of in writing.",
          "misconception": "Targets [formality requirement]: Incorrectly assumes only written complaints trigger investigation, ignoring verbal allegations."
        },
        {
          "text": "When the alleged harasser is a coworker and not a supervisor.",
          "misconception": "Targets [harasser status irrelevance]: Fails to recognize that harassment by coworkers also requires investigation."
        },
        {
          "text": "When the alleged conduct occurred more than one year prior to the allegation.",
          "misconception": "Targets [timeliness misunderstanding]: Confuses the investigation completion deadline with the trigger for initiating an investigation."
        }
      ],
      "detailed_explanation": {
        "core_logic": "An employer is not required to investigate 'bald' allegations because investigations must be based on sufficient detail to determine if the alleged conduct, if proven, could constitute workplace violence or harassment under legal definitions, ensuring resources are focused on actionable claims.",
        "distractor_analysis": "Distractors misrepresent investigation triggers by incorrectly dismissing verbal complaints, ignoring coworker harassment, or confusing investigation initiation with completion deadlines.",
        "analogy": "An employer doesn't need to investigate a 'bald' allegation like a detective doesn't start a case with just a hunch; they need enough specific clues (details) to justify a full investigation."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": []
    },
    {
      "question_text": "What is the primary risk associated with using Non-Disclosure Agreements (NDAs) to settle workplace harassment complaints?",
      "correct_answer": "NDAs can conceal patterns of harassment, prevent future victims from seeking help, and limit the organization's ability to address systemic issues.",
      "distractors": [
        {
          "text": "NDAs are too expensive for employers to implement effectively.",
          "misconception": "Targets [cost vs. risk]: Focuses on financial cost rather than the significant risk of concealing harmful behavior."
        },
        {
          "text": "NDAs legally obligate the victim to participate in future harassment.",
          "misconception": "Targets [legal misinterpretation]: Falsely claims NDAs compel future participation in harassment."
        },
        {
          "text": "NDAs prevent employers from taking any disciplinary action against the accused.",
          "misconception": "Targets [scope of NDA]: Misunderstands that NDAs typically concern settlement terms, not the employer's disciplinary options."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NDAs pose a significant risk because they can silence victims and hide ongoing harassment, thereby preventing employers from identifying and rectifying systemic problems, because their secrecy undermines transparency and accountability.",
        "distractor_analysis": "Distractors misrepresent NDAs by focusing on cost, misstating their legal effect on victims, or incorrectly limiting their scope regarding disciplinary actions.",
        "analogy": "Using NDAs to settle harassment claims is like putting a gag order on a whistleblower; it might resolve one issue quietly but allows the underlying problem to fester and harm others."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": []
    },
    {
      "question_text": "Which of the following is NOT considered a 'tangible employment action' that would preclude an employer from using the Faragher-Ellerth defense?",
      "correct_answer": "A verbal warning issued by a supervisor for poor performance.",
      "distractors": [
        {
          "text": "Demotion to a significantly less desirable position.",
          "misconception": "Targets [tangible action definition]: This IS a tangible employment action because it represents a significant change in employment status."
        },
        {
          "text": "Termination of employment.",
          "misconception": "Targets [tangible action definition]: This IS a tangible employment action because it is a significant change in employment status."
        },
        {
          "text": "Denial of a promotion based on rejecting sexual advances.",
          "misconception": "Targets [tangible action definition]: This IS a tangible employment action because it is a significant change in employment status linked to harassment."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A verbal warning is not a tangible employment action because it does not constitute a 'significant change in employment status' requiring an 'official act' of the employer, unlike demotion, termination, or denial of promotion, which directly alter an employee's position or benefits.",
        "distractor_analysis": "Distractors correctly identify actions that ARE tangible employment actions (demotion, termination, denial of promotion), highlighting that a verbal warning lacks the official, status-altering impact required.",
        "analogy": "A tangible employment action is like a formal legal document changing ownership; a verbal warning is like a casual conversation – it lacks the official weight to trigger automatic employer liability."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": []
    },
    {
      "question_text": "What is the primary implication of a 'pattern or practice' of harassment being established against an employer?",
      "correct_answer": "It indicates that harassment was the employer's 'standard operating procedure,' affecting the overall work environment, not just individual experiences.",
      "distractors": [
        {
          "text": "It means only the most severe individual harassment cases will be considered.",
          "misconception": "Targets [scope of pattern or practice]: Incorrectly narrows focus to individual severe cases, ignoring the systemic nature."
        },
        {
          "text": "It implies that the employer actively encouraged all employees to harass each other.",
          "misconception": "Targets [intent vs. tolerance]: Confuses tolerance or systemic failure with active encouragement of harassment."
        },
        {
          "text": "It automatically makes the employer liable for all past and future harassment incidents.",
          "misconception": "Targets [liability scope]: Overstates liability; while establishing a pattern is significant, individual relief is still determined case-by-case."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Establishing a 'pattern or practice' of harassment signifies systemic employer failure because it demonstrates that harassment was the regular procedure, impacting the entire work environment, not just isolated incidents.",
        "distractor_analysis": "Distractors misrepresent 'pattern or practice' by narrowing its scope, misattributing intent, or overstating automatic liability, failing to capture its systemic implication.",
        "analogy": "A 'pattern or practice' of harassment is like a company's flawed manufacturing process; it's not just one bad product, but a systemic issue affecting the entire output."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": []
    },
    {
      "question_text": "In the context of workplace investigations, why is it crucial for an investigator to have 'impartiality'?",
      "correct_answer": "Impartiality ensures the investigator makes conclusions based on unbiased evidence, maintaining trust and fairness for all parties involved.",
      "distractors": [
        {
          "text": "Impartiality means the investigator must always side with the complainant to ensure justice.",
          "misconception": "Targets [bias towards complainant]: Incorrectly assumes impartiality requires favoring the accuser, undermining objectivity."
        },
        {
          "text": "Impartiality requires the investigator to have prior knowledge of the situation to speed up the process.",
          "misconception": "Targets [bias from prior knowledge]: Confuses impartiality with pre-existing knowledge, which can introduce bias."
        },
        {
          "text": "Impartiality means the investigator should only interview witnesses proposed by the employer.",
          "misconception": "Targets [limited information gathering]: Restricts the investigation by limiting witness selection to employer-approved individuals."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Impartiality is crucial because an unbiased investigator ensures that conclusions are based solely on evidence, thereby upholding procedural fairness and maintaining trust in the investigation process for all parties.",
        "distractor_analysis": "Distractors misrepresent impartiality by suggesting it means favoring one party, requiring prior knowledge, or limiting information sources, all of which compromise objectivity.",
        "analogy": "An impartial investigator is like a judge in a courtroom; they must listen to all evidence without pre-judgment to ensure a fair verdict."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": []
    },
    {
      "question_text": "What is the primary purpose of an employer's anti-harassment policy and complaint procedure, according to EEOC guidance?",
      "correct_answer": "To reasonably prevent harassment and provide a clear process for employees to report and address concerns.",
      "distractors": [
        {
          "text": "To guarantee complete confidentiality for all parties involved in a complaint.",
          "misconception": "Targets [confidentiality limits]: Overstates confidentiality; investigations require sharing information with necessary parties."
        },
        {
          "text": "To ensure that all harassment complaints are resolved through informal mediation.",
          "misconception": "Targets [resolution method]: Assumes informal mediation is always the required or appropriate resolution, ignoring formal investigation needs."
        },
        {
          "text": "To serve as a legal defense by simply existing, regardless of implementation.",
          "misconception": "Targets [policy effectiveness]: Believes policy existence alone negates liability, ignoring the need for effective implementation and enforcement."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Effective anti-harassment policies and procedures are essential because they establish clear expectations, provide reporting channels, and outline corrective actions, thereby working to prevent harassment and ensure prompt resolution when issues arise.",
        "distractor_analysis": "Distractors misrepresent the purpose of policies by overstating confidentiality, mandating informal resolution, or suggesting mere existence suffices for legal defense, ignoring practical implementation.",
        "analogy": "An anti-harassment policy and procedure are like a fire alarm system; they need to be functional and regularly tested (implemented) to be effective, not just installed on the wall."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": []
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 16,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Workplace Harassment Investigation Security And Risk Management best practices",
    "latency_ms": 35539.895000000004
  },
  "timestamp": "2026-01-01T10:47:07.352180"
}