{
  "topic_title": "Information security roles and responsibilities (A.5.2)",
  "category": "Security And Risk Management - Security Control Frameworks",
  "flashcards": [
    {
      "question_text": "According to ISO/IEC 27001:2022 Annex A.5.2, what is the primary requirement for information security roles and responsibilities?",
      "correct_answer": "They must be clearly defined and allocated based on the organization's needs.",
      "distractors": [
        {
          "text": "They should be assigned to the Chief Information Security Officer (CISO) only.",
          "misconception": "Targets [over-simplification]: Assumes a single point of responsibility, ignoring distributed accountability."
        },
        {
          "text": "They must be documented in a formal HR policy document.",
          "misconception": "Targets [procedural error]: While documentation is key, it doesn't have to be solely within HR policy."
        },
        {
          "text": "They are automatically fulfilled by IT department personnel.",
          "misconception": "Targets [domain confusion]: Incorrectly assumes IT department inherently holds all security responsibilities."
        }
      ],
      "detailed_explanation": {
        "core_logic": "ISO/IEC 27001:2022 Annex A.5.2 mandates that information security roles and responsibilities are defined and allocated according to organizational needs because clear accountability is fundamental to effective risk management and control implementation.",
        "distractor_analysis": "The distractors represent common misunderstandings: limiting responsibility to one role, misplacing documentation requirements, and incorrectly assuming IT's sole ownership of security duties.",
        "analogy": "Defining information security roles is like assigning specific jobs on a construction site; each worker needs to know their task and who is in charge of what to build a secure structure."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "ISO27001_FUNDAMENTALS"
      ]
    },
    {
      "question_text": "Which of the following best describes the purpose of defining information security roles and responsibilities as per ISO 27001:2022 Annex A.5.2?",
      "correct_answer": "To establish a clear structure for implementing, operating, and managing information security, ensuring accountability.",
      "distractors": [
        {
          "text": "To create a detailed job description for the Chief Information Security Officer (CISO).",
          "misconception": "Targets [scope limitation]: Focuses too narrowly on a single role, ignoring broader organizational responsibilities."
        },
        {
          "text": "To ensure all employees are aware of basic cybersecurity threats.",
          "misconception": "Targets [misplaced objective]: While awareness is important (A.6.3), it's not the primary purpose of defining roles."
        },
        {
          "text": "To dictate the specific technical security tools the organization must use.",
          "misconception": "Targets [technical focus]: Roles define responsibilities, not specific technology choices."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Defining roles and responsibilities establishes a framework for information security management because it ensures that specific individuals or teams are accountable for security tasks, thereby supporting the overall ISMS effectiveness.",
        "distractor_analysis": "Distractors incorrectly narrow the scope to a single role, confuse the purpose with general awareness training, or misinterpret roles as dictating specific technology.",
        "analogy": "It's like assigning roles in a play; each actor knows their part, their lines, and their cues, ensuring the performance runs smoothly and everyone knows who is responsible for what."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "ISO/IEC 27002:2022, in section 5.2, emphasizes that information security roles and responsibilities should be defined and allocated according to what?",
      "correct_answer": "The organization's needs.",
      "distractors": [
        {
          "text": "Industry best practices only.",
          "misconception": "Targets [over-reliance on external standards]: While best practices are important, organizational context is primary."
        },
        {
          "text": "The availability of skilled personnel.",
          "misconception": "Targets [resource dependency]: Needs should drive role definition, then skills are acquired or assigned."
        },
        {
          "text": "The IT department's existing structure.",
          "misconception": "Targets [organizational bias]: Security responsibilities extend beyond IT and should align with overall business needs."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The organization's specific needs are the primary driver for defining information security roles because a tailored approach ensures that security efforts are aligned with business objectives and risk appetite, rather than a one-size-fits-all solution.",
        "distractor_analysis": "The distractors suggest external standards, resource availability, or a single department's structure as the primary driver, which are secondary considerations to the organization's unique requirements.",
        "analogy": "It's like designing a custom suit; the tailor measures your specific body (organizational needs) to create a perfect fit, rather than just using a standard size chart (industry best practices)."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "According to ISO/IEC 27002:2022 guidance on A.5.2, what is a key aspect of managing information security responsibilities?",
      "correct_answer": "Ensuring individuals with assigned responsibilities remain accountable, even when delegating tasks.",
      "distractors": [
        {
          "text": "Transferring all accountability to the delegated individuals.",
          "misconception": "Targets [accountability error]: Delegation does not absolve the original responsible party of ultimate accountability."
        },
        {
          "text": "Documenting responsibilities solely in employee contracts.",
          "misconception": "Targets [documentation scope]: While contracts are relevant, responsibilities need broader communication and definition."
        },
        {
          "text": "Assuming that IT personnel automatically understand all security tasks.",
          "misconception": "Targets [assumption error]: Specific roles and tasks must be explicitly defined and communicated, not assumed."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Individuals with assigned information security responsibilities must remain accountable even when delegating tasks because accountability ensures that someone is ultimately answerable for the successful completion and effectiveness of security measures, fostering a culture of ownership.",
        "distractor_analysis": "The distractors misrepresent accountability by suggesting complete transfer, limiting documentation to contracts, or relying on assumptions about IT's inherent security knowledge.",
        "analogy": "A project manager can delegate tasks to team members, but they remain accountable to the client for the project's success; similarly, security responsibilities require ultimate ownership."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "ISO27001_ROLES_RESPONSIBILITIES",
        "ACCOUNTABILITY_PRINCIPLES"
      ]
    },
    {
      "question_text": "Which of the following is NOT explicitly mentioned as a responsibility that should be defined and managed according to ISO/IEC 27002:2022 guidance for A.5.2?",
      "correct_answer": "Developing new cybersecurity technologies.",
      "distractors": [
        {
          "text": "Protection of information and other associated assets.",
          "misconception": "Targets [scope confusion]: This is a core responsibility mentioned in the guidance."
        },
        {
          "text": "Carrying out specific information security processes.",
          "misconception": "Targets [scope confusion]: This is explicitly listed as a responsibility to be defined."
        },
        {
          "text": "Information security risk management activities.",
          "misconception": "Targets [scope confusion]: This is a key area requiring defined responsibilities."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Defining responsibilities for protection of assets, execution of processes, and risk management is crucial because it ensures that all critical security functions are covered and assigned, aligning with the standard's goal of comprehensive ISMS management.",
        "distractor_analysis": "The correct answer is a development activity, not a management responsibility for existing security functions as outlined in the standard's guidance.",
        "analogy": "In a kitchen, responsibilities include managing ingredients (assets), preparing dishes (processes), and handling customer feedback (risk management), but not inventing new cooking appliances."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "What is the role of 'risk owners' in the context of information security responsibilities as per ISO 27002:2022 guidance?",
      "correct_answer": "They are responsible for the acceptance of residual risks.",
      "distractors": [
        {
          "text": "They are solely responsible for eliminating all identified risks.",
          "misconception": "Targets [risk elimination fallacy]: Risk owners accept residual risk, not eliminate all risks, which is often impossible."
        },
        {
          "text": "They are responsible for implementing all security controls.",
          "misconception": "Targets [responsibility diffusion]: While they oversee risk treatment, implementation can be delegated."
        },
        {
          "text": "They are responsible for defining the organization's risk appetite.",
          "misconception": "Targets [authority level]: Risk appetite is typically set by top management, not individual risk owners."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Risk owners are assigned responsibility for accepting residual risks because this formalizes accountability for risks that remain after treatment, ensuring that the organization understands and accepts the remaining exposure.",
        "distractor_analysis": "Distractors misrepresent the role by suggesting complete risk elimination, direct implementation of all controls, or setting the organization's risk appetite, which are distinct responsibilities.",
        "analogy": "A risk owner is like a homeowner who accepts the residual risk of a small chance of a tree falling on their house after they've taken reasonable precautions like trimming branches."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "RISK_MANAGEMENT_FUNDAMENTALS",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "How should authorization levels be handled in relation to information security roles and responsibilities, according to ISO/IEC 27002:2022 guidance?",
      "correct_answer": "They should be clearly defined and documented.",
      "distractors": [
        {
          "text": "They should be granted based on seniority.",
          "misconception": "Targets [arbitrary assignment]: Authorization should be based on need-to-know and least privilege, not just seniority."
        },
        {
          "text": "They should be kept confidential and not shared.",
          "misconception": "Targets [transparency issue]: While access rights are controlled, the definition of authorization levels should be understood within the organization."
        },
        {
          "text": "They should be automatically assigned by the system.",
          "misconception": "Targets [automation over policy]: While systems enforce, the levels themselves must be defined by policy and roles."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Authorization levels must be clearly defined and documented because this ensures consistency, fairness, and auditability in access control, aligning with the principle of least privilege and organizational policy.",
        "distractor_analysis": "The distractors suggest arbitrary assignment based on seniority, inappropriate secrecy, or over-reliance on automation without proper definition, all of which undermine effective access control.",
        "analogy": "Defining authorization levels is like setting security clearance for different areas in a secure facility; each level must be clearly documented and understood for who can access what."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "ACCESS_CONTROL_PRINCIPLES",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "Consider a scenario where an organization has defined information security roles. If a specific security task is delegated by a manager to a team member, who remains accountable for the task's successful completion?",
      "correct_answer": "The manager who delegated the task.",
      "distractors": [
        {
          "text": "The team member who performed the task.",
          "misconception": "Targets [accountability vs. responsibility]: The team member is responsible for execution, but the manager retains accountability."
        },
        {
          "text": "The Chief Information Security Officer (CISO).",
          "misconception": "Targets [over-centralization]: While the CISO has overall responsibility, specific task accountability often lies lower."
        },
        {
          "text": "The IT department as a whole.",
          "misconception": "Targets [collective responsibility diffusion]: Accountability should be clearly assigned, not diffused across a department."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The manager who delegated the task remains accountable because delegation assigns responsibility for execution, but accountability for the outcome rests with the person in the defined role who made the delegation decision, ensuring oversight.",
        "distractor_analysis": "These distractors confuse execution responsibility with ultimate accountability, incorrectly assign responsibility to a higher-level role, or diffuse it across a department.",
        "analogy": "A chef can delegate the task of chopping vegetables to a sous-chef, but the head chef remains accountable to the diners for the quality of the final dish."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": [
        "DELEGATION_PRINCIPLES",
        "ACCOUNTABILITY_PRINCIPLES",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "What is the significance of defining 'security areas' for individuals responsible for information security, as suggested by ISO/IEC 27002:2022 guidance?",
      "correct_answer": "It ensures clarity and communication of specific domains of responsibility.",
      "distractors": [
        {
          "text": "It limits their responsibilities to only those defined areas.",
          "misconception": "Targets [rigid interpretation]: While defining areas is key, it doesn't preclude broader security awareness or duties."
        },
        {
          "text": "It is primarily for audit purposes to check compliance.",
          "misconception": "Targets [sole purpose]: Auditing is a benefit, but the primary purpose is operational clarity and effectiveness."
        },
        {
          "text": "It automatically assigns them as 'risk owners'.",
          "misconception": "Targets [role conflation]: Defining security areas is distinct from assigning specific risk ownership."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Defining and communicating specific security areas for individuals is crucial because it provides clarity on their scope of work, prevents overlap or gaps in security coverage, and ensures that all critical aspects are managed effectively.",
        "distractor_analysis": "The distractors misinterpret the purpose by suggesting rigid limitations, solely focusing on auditing, or conflating general security areas with specific risk ownership roles.",
        "analogy": "In a library, defining 'security areas' might mean assigning someone to monitor the entrance, another to oversee the rare books section, and another for general floor supervision, ensuring all zones are covered."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "ISO27001_ROLES_RESPONSIBILITIES",
        "SECURITY_AREAS"
      ]
    },
    {
      "question_text": "According to ISO/IEC 27001:2022 Annex A.5.2, what is the relationship between an organization's needs and the definition of information security roles?",
      "correct_answer": "Information security roles must be defined and allocated specifically to meet the organization's unique needs.",
      "distractors": [
        {
          "text": "Information security roles are standardized across all organizations.",
          "misconception": "Targets [standardization fallacy]: Roles must be tailored to the specific context, size, and risks of each organization."
        },
        {
          "text": "The IT department's structure dictates the information security roles.",
          "misconception": "Targets [departmental bias]: Security roles should align with overall business needs, not just IT's internal structure."
        },
        {
          "text": "Information security roles are primarily determined by external auditors.",
          "misconception": "Targets [external control]: While auditors assess, the organization itself must define and own its roles based on its needs."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Information security roles must align with organizational needs because a tailored approach ensures that security efforts are relevant, effective, and proportionate to the specific risks and objectives of the business, rather than adopting a generic, potentially unsuitable, structure.",
        "distractor_analysis": "The distractors propose a one-size-fits-all approach, an IT-centric view, or external dictation, all of which contradict the standard's emphasis on organizational context.",
        "analogy": "Designing a security team for a bank requires different roles and responsibilities than for a small online retailer, because their needs, risks, and assets are vastly different."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "ISO27001_ROLES_RESPONSIBILITIES",
        "ORGANIZATIONAL_CONTEXT"
      ]
    },
    {
      "question_text": "What is the implication of 'competence' for individuals assigned specific information security roles, as per ISO/IEC 27002:2022 guidance?",
      "correct_answer": "They should possess the necessary knowledge and skills for their role and be supported to stay current.",
      "distractors": [
        {
          "text": "They must have a formal cybersecurity certification.",
          "misconception": "Targets [certification over competence]: While certifications can help, practical competence (education, training, experience) is key."
        },
        {
          "text": "They are expected to learn all security skills on the job without formal training.",
          "misconception": "Targets [lack of support]: The guidance emphasizes support and continuous learning, not just on-the-job osmosis."
        },
        {
          "text": "Their competence is only relevant during initial assignment.",
          "misconception": "Targets [static view of competence]: Security landscape evolves, so continuous learning and updating skills are vital."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Individuals in security roles need to be competent and stay current because the threat landscape and technologies constantly evolve, requiring up-to-date knowledge and skills to effectively manage risks and protect assets.",
        "distractor_analysis": "The distractors incorrectly mandate specific certifications, neglect the need for ongoing training and support, or assume competence is static.",
        "analogy": "A surgeon must not only be competent but also continuously update their skills with new medical techniques; similarly, security professionals need ongoing development."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "COMPETENCE_MANAGEMENT",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "Which of the following best describes the 'Information Security Roles and Responsibilities' control (A.5.2) in the context of ISO 27001:2022?",
      "correct_answer": "It ensures that all personnel understand their specific duties related to protecting information assets.",
      "distractors": [
        {
          "text": "It mandates the use of specific security software solutions.",
          "misconception": "Targets [tool focus]: The control is about roles and responsibilities, not specific technology choices."
        },
        {
          "text": "It requires a full-time Information Security Manager in every organization.",
          "misconception": "Targets [rigid structure]: The standard allows for flexibility based on organizational size and resources."
        },
        {
          "text": "It focuses solely on the responsibilities of the IT department.",
          "misconception": "Targets [limited scope]: Information security is an organizational responsibility, not solely IT's."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The A.5.2 control ensures clarity on who is responsible for what regarding information security because well-defined roles and responsibilities are foundational to effective risk management and the successful implementation of an ISMS.",
        "distractor_analysis": "Distractors incorrectly focus on specific tools, impose rigid structural requirements, or limit the scope to a single department, missing the broader organizational intent.",
        "analogy": "It's like assigning roles in a sports team; each player knows their position and responsibilities on the field, contributing to the team's overall success."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "ISO27001_FUNDAMENTALS",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "In the context of ISO 27001:2022 Annex A.5.2, what does 'defined and allocated according to the organization's needs' imply for information security roles?",
      "correct_answer": "Roles should be tailored to the organization's specific risks, size, and operational context.",
      "distractors": [
        {
          "text": "Roles should be identical to those defined in ISO 27002.",
          "misconception": "Targets [misinterpretation of reference]: ISO 27002 provides guidance, not a rigid template for roles."
        },
        {
          "text": "Roles should be assigned based on employee convenience.",
          "misconception": "Targets [inappropriate assignment criteria]: Roles must be based on business needs and security requirements, not convenience."
        },
        {
          "text": "Roles should be standardized across all departments.",
          "misconception": "Targets [lack of context]: Different departments may have different security needs and thus require tailored roles."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Tailoring roles to specific organizational needs is essential because it ensures that security responsibilities are relevant, effective, and proportionate to the actual risks and operational realities faced by the organization, maximizing the value of the ISMS.",
        "distractor_analysis": "The distractors suggest a rigid, standardized approach or assignment based on convenience, which fails to address the unique security landscape of each organization.",
        "analogy": "A security detail for a VIP requires different roles and responsibilities than for a public event, tailored to the specific threat environment and scale of the operation."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "ISO27001_ROLES_RESPONSIBILITIES",
        "ORGANIZATIONAL_CONTEXT"
      ]
    },
    {
      "question_text": "Which of the following is a key consideration when defining information security roles and responsibilities under ISO/IEC 27002:2022 A.5.2?",
      "correct_answer": "Ensuring clear communication of these roles and responsibilities throughout the organization.",
      "distractors": [
        {
          "text": "Making the roles and responsibilities a trade secret.",
          "misconception": "Targets [lack of transparency]: Effective security requires clear communication, not secrecy, about roles."
        },
        {
          "text": "Assigning roles only to senior management.",
          "misconception": "Targets [limited assignment]: Responsibilities span various levels and functions within an organization."
        },
        {
          "text": "Documenting roles solely in an appendix of the ISMS policy.",
          "misconception": "Targets [inadequate documentation]: While an appendix is possible, roles need broader communication and accessibility."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Clear communication of roles and responsibilities is vital because it ensures that everyone understands their part in maintaining information security, preventing confusion, and fostering a culture of shared responsibility.",
        "distractor_analysis": "The distractors suggest secrecy, overly restrictive assignment, or insufficient documentation, all of which hinder the effective implementation and understanding of security roles.",
        "analogy": "In a fire drill, clear communication about who leads evacuation, who checks rooms, and who calls emergency services is critical for safety; similarly, security roles need clear communication."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "COMMUNICATION_PRINCIPLES",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "What is the primary goal of defining 'information security roles and responsibilities' as per ISO 27001:2022 Annex A.5.2?",
      "correct_answer": "To establish a defined, approved, and understood structure for managing information security.",
      "distractors": [
        {
          "text": "To create a rigid hierarchy that dictates all decision-making.",
          "misconception": "Targets [rigidity vs. structure]: The goal is structure and clarity, not necessarily a rigid, inflexible hierarchy."
        },
        {
          "text": "To ensure compliance with legal and regulatory requirements only.",
          "misconception": "Targets [limited objective]: While compliance is a factor, the primary goal is effective ISMS management."
        },
        {
          "text": "To assign blame when security incidents occur.",
          "misconception": "Targets [blame culture]: The focus is on proactive management and accountability, not solely on post-incident blame."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Establishing a clear structure for managing information security is the primary goal because it provides the foundation for accountability, effective implementation of controls, and overall ISMS effectiveness, ensuring that security is integrated into the organization's operations.",
        "distractor_analysis": "The distractors misrepresent the goal by suggesting rigidity, limiting it to compliance, or focusing on blame rather than proactive management and clear structure.",
        "analogy": "It's like setting up the organizational chart for a company; it defines who reports to whom and who is responsible for different departments, ensuring smooth operations."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "ISO27001_FUNDAMENTALS",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "How does ISO/IEC 27002:2022 guidance on A.5.2 suggest handling responsibilities for personnel using the organization's information assets?",
      "correct_answer": "These responsibilities should be clearly defined and managed.",
      "distractors": [
        {
          "text": "They should be assumed, as all users inherently understand security.",
          "misconception": "Targets [assumption error]: User responsibilities must be explicitly defined and communicated."
        },
        {
          "text": "They should only be documented in the Acceptable Use Policy (AUP).",
          "misconception": "Targets [documentation scope]: While AUP is relevant, responsibilities may need broader definition and communication."
        },
        {
          "text": "They are solely the responsibility of the IT security team.",
          "misconception": "Targets [scope limitation]: All users have responsibilities regarding information asset usage."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Defining and managing user responsibilities for information assets is crucial because users are often the first line of defense (or the weakest link), and clear guidelines ensure they handle assets securely and appropriately, minimizing risks.",
        "distractor_analysis": "The distractors rely on assumptions, limit documentation too narrowly, or incorrectly assign responsibility solely to the IT security team, ignoring the role of all users.",
        "analogy": "Just as library patrons have responsibilities regarding book care and return, users of an organization's information assets have defined duties to protect them."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "USER_RESPONSIBILITIES",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    },
    {
      "question_text": "In the context of ISO/IEC 27002:2022 A.5.2, what is the role of 'risk owners'?",
      "correct_answer": "To accept residual risks after treatment options have been applied.",
      "distractors": [
        {
          "text": "To eliminate all identified risks completely.",
          "misconception": "Targets [risk elimination fallacy]: It's often impossible to eliminate all risks; the focus is on managing residual risk."
        },
        {
          "text": "To implement all security controls within the organization.",
          "misconception": "Targets [implementation vs. ownership]: Risk owners oversee risk treatment, but implementation is often delegated."
        },
        {
          "text": "To define the organization's overall risk appetite.",
          "misconception": "Targets [authority level]: Risk appetite is typically set by top management, not individual risk owners."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Risk owners are assigned the responsibility of accepting residual risks because this formalizes accountability for risks that remain after mitigation efforts, ensuring that the organization consciously acknowledges and manages its exposure.",
        "distractor_analysis": "The distractors misrepresent the role by suggesting complete risk elimination, direct implementation of all controls, or setting the organization's risk appetite, which are distinct responsibilities.",
        "analogy": "A homeowner accepting the residual risk of a minor flood after installing a sump pump is analogous to a risk owner accepting risks that remain after mitigation."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "RISK_MANAGEMENT_PRINCIPLES",
        "ISO27001_ROLES_RESPONSIBILITIES"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 17,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Information security roles and responsibilities (A.5.2) Security And Risk Management best practices",
    "latency_ms": 26465.03
  },
  "timestamp": "2026-01-01T12:17:16.941312"
}