{
  "topic_title": "Intelligence Requirements (IRs) Definition",
  "category": "Cybersecurity - Threat Intelligence And Hunting",
  "flashcards": [
    {
      "question_text": "What is the primary purpose of an Intelligence Requirement (IR) in threat intelligence?",
      "correct_answer": "To guide a security or threat intelligence team's research and analysis efforts by reflecting organizational priorities.",
      "distractors": [
        {
          "text": "To document all observed cyber threats and indicators of compromise.",
          "misconception": "Targets [scope confusion]: Confuses IRs with a comprehensive threat database."
        },
        {
          "text": "To dictate specific technical tools and technologies for data collection.",
          "misconception": "Targets [method vs. objective confusion]: Focuses on 'how' rather than 'what' needs to be known."
        },
        {
          "text": "To provide a final report to executive leadership on security posture.",
          "misconception": "Targets [lifecycle stage confusion]: IRs are an early stage, not the final output."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Intelligence Requirements (IRs) are essential because they define what information is needed to support decision-making, guiding collection and analysis efforts. They function by articulating specific questions or topics that address an organization's threat-related priorities.",
        "distractor_analysis": "The first distractor broadens the scope beyond guidance to documentation. The second confuses the 'what' (requirement) with the 'how' (collection tools). The third places IRs at the end of the intelligence cycle, not the beginning.",
        "analogy": "Think of Intelligence Requirements as the 'shopping list' for a detective; they specify what clues are needed to solve the case, rather than just listing all evidence found or dictating the detective's tools."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "THREAT_INTEL_BASICS"
      ]
    },
    {
      "question_text": "According to ThreatConnect best practices, what is a key characteristic of an effective Intelligence Requirement (IR)?",
      "correct_answer": "It is question-based and directly connected to enabling better decision-making.",
      "distractors": [
        {
          "text": "It must be achievable using only open-source intelligence (OSINT).",
          "misconception": "Targets [collection constraint]: Imposes an unnecessary and restrictive collection method."
        },
        {
          "text": "It should be broad enough to cover all potential cyber threats.",
          "misconception": "Targets [scope overreach]: Effective IRs are specific, not overly broad."
        },
        {
          "text": "It is primarily used for technical vulnerability scanning.",
          "misconception": "Targets [domain confusion]: Misunderstands the strategic and operational scope of IRs."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Effective IRs are question-based and decision-oriented because they must directly inform actionable choices for stakeholders. They function by clearly articulating an information gap that, when filled, leads to improved security posture or risk management.",
        "distractor_analysis": "The first distractor incorrectly limits the scope of collection methods. The second suggests a broad, unmanageable scope, contrary to best practices. The third narrows the focus to a specific technical activity, missing the broader intelligence purpose.",
        "analogy": "An effective IR is like a precise medical diagnosis question ('What is causing this specific symptom?') rather than a general health inquiry ('Tell me about all diseases'). It guides the investigation towards a solution."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "THREAT_INTEL_IR_BASICS",
        "THREATCONNECT_BEST_PRACTICES"
      ]
    },
    {
      "question_text": "Which tier in the intelligence requirements hierarchy is focused on strategic, high-impact information needs and is typically approved by senior leadership?",
      "correct_answer": "Priority Intelligence Requirements (PIRs)",
      "distractors": [
        {
          "text": "Specific Intelligence Requirements (SIRs)",
          "misconception": "Targets [hierarchy confusion]: SIRs are a lower tier, derived from PIRs."
        },
        {
          "text": "Intelligence Collection Requirements (ICRs)",
          "misconception": "Targets [hierarchy confusion]: ICRs are the most granular, tactical level."
        },
        {
          "text": "Requests for Information (RFIs)",
          "misconception": "Targets [subtype confusion]: RFIs are typically one-off requests, not strategic drivers."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Priority Intelligence Requirements (PIRs) are the highest tier because they directly address major organizational decisions and strategic concerns, requiring senior leadership approval. They function by setting the overarching direction for intelligence efforts, guiding the development of lower-tier requirements.",
        "distractor_analysis": "SIRs and ICRs are lower, more granular tiers. RFIs are typically ad-hoc requests, not the foundational strategic drivers that PIRs represent.",
        "analogy": "PIRs are like the 'mission statement' for an intelligence team, defining the ultimate goals. SIRs are like 'project objectives' to achieve the mission, and ICRs are the 'specific tasks' to complete those objectives."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "remember",
      "prerequisites": [
        "THREAT_INTEL_IR_HIERARCHY"
      ]
    },
    {
      "question_text": "A security analyst is tasked with identifying specific indicators of compromise (IOCs) related to a recent phishing campaign targeting their organization. Which type of intelligence requirement BEST fits this task?",
      "correct_answer": "Specific Intelligence Requirement (SIR)",
      "distractors": [
        {
          "text": "Priority Intelligence Requirement (PIR)",
          "misconception": "Targets [hierarchy confusion]: PIRs are broader, strategic questions."
        },
        {
          "text": "Research Requirement (RR)",
          "misconception": "Targets [subtype confusion]: RRs are for areas of general interest, not specific campaign details."
        },
        {
          "text": "Request for Information (RFI)",
          "misconception": "Targets [subtype confusion]: RFIs are typically one-off, less structured requests."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A Specific Intelligence Requirement (SIR) is appropriate because it supports a broader PIR by focusing on particular aspects of threat activity, such as specific IOCs from a campaign. SIRs function by breaking down high-level questions into manageable, fact-based inquiries.",
        "distractor_analysis": "PIRs are too broad. RRs are for general areas of interest, not specific campaign details. RFIs are usually one-off requests, whereas SIRs are part of a structured intelligence process.",
        "analogy": "If a PIR is 'What are the main threats to our company?', an SIR would be 'What specific malware is being used in the current phishing campaign against us?'"
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": [
        "THREAT_INTEL_IR_HIERARCHY",
        "THREAT_INTEL_IOCS"
      ]
    },
    {
      "question_text": "What is the main difference between an Intelligence Requirement (IR) and a Collection Requirement (CR) in the intelligence cycle?",
      "correct_answer": "An IR defines 'what' information is needed, while a CR defines 'how' that information will be gathered.",
      "distractors": [
        {
          "text": "An IR is strategic, while a CR is tactical.",
          "misconception": "Targets [level confusion]: Both can exist at different levels, but the core difference is purpose."
        },
        {
          "text": "An IR focuses on threats, while a CR focuses on vulnerabilities.",
          "misconception": "Targets [focus confusion]: IRs can cover both threats and vulnerabilities; CRs are about gathering data."
        },
        {
          "text": "An IR is for internal use, while a CR is for external sharing.",
          "misconception": "Targets [audience confusion]: Both can be used internally or externally depending on the intelligence product."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The fundamental difference is that IRs articulate the information need (the 'what'), whereas CRs translate that need into actionable collection tasks (the 'how'). This distinction is crucial because it ensures that collection efforts are directly driven by intelligence objectives, not by available tools.",
        "distractor_analysis": "While IRs and CRs operate at different levels, their primary distinction is purpose (need vs. method). The focus can vary, and audience is not the defining factor.",
        "analogy": "An IR is like deciding you need to know the ingredients for a specific recipe (the 'what'). A CR is like writing down the steps to go to the grocery store and buy those ingredients (the 'how')."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "THREAT_INTEL_IR_BASICS",
        "THREAT_INTEL_COLLECTION_PLANNING"
      ]
    },
    {
      "question_text": "When developing Intelligence Requirements (IRs), what is the significance of stakeholder engagement?",
      "correct_answer": "It ensures that the IRs align with actual organizational needs and support critical decision-making.",
      "distractors": [
        {
          "text": "It is primarily a formality to justify the intelligence team's existence.",
          "misconception": "Targets [purpose misunderstanding]: Undervalues the collaborative nature and value-add of stakeholder input."
        },
        {
          "text": "It guarantees that all collected intelligence will be technically perfect.",
          "misconception": "Targets [unrealistic expectation]: Stakeholder input guides focus, not the technical quality of raw data."
        },
        {
          "text": "It is only necessary for executive-level requirements, not operational ones.",
          "misconception": "Targets [scope limitation]: All levels of stakeholders provide valuable input for relevant IRs."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Stakeholder engagement is critical because it ensures IRs are relevant and actionable, directly supporting the decisions stakeholders must make. This process functions by fostering communication and collaboration, aligning the intelligence team's efforts with the organization's priorities and risks.",
        "distractor_analysis": "Stakeholder engagement is a core function, not a mere formality. It influences the direction and relevance of intelligence, not its technical perfection. Input is needed from all relevant stakeholder levels, not just executives.",
        "analogy": "Engaging stakeholders in developing IRs is like a chef consulting with diners about their preferences before planning the menu; it ensures the final meal (intelligence) will be well-received and meet their needs."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "THREAT_INTEL_IR_BASICS",
        "STAKEHOLDER_MANAGEMENT"
      ]
    },
    {
      "question_text": "Which of the following is an example of a Priority Intelligence Requirement (PIR)?",
      "correct_answer": "What nation-state threat actors are targeting our industry, and what are their primary objectives?",
      "distractors": [
        {
          "text": "What specific IP addresses were used in the recent ransomware attack?",
          "misconception": "Targets [level confusion]: This is a Specific Intelligence Requirement (SIR) or Intelligence Collection Requirement (ICR)."
        },
        {
          "text": "Monitor all new malware families discovered globally.",
          "misconception": "Targets [scope overreach]: Too broad and not tied to specific organizational objectives."
        },
        {
          "text": "Compile a list of all vulnerabilities in our web applications.",
          "misconception": "Targets [focus confusion]: This is more of a vulnerability management task than a strategic threat intelligence requirement."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The example PIR is effective because it addresses a high-level, strategic question about threat actors and their objectives, directly impacting organizational risk assessment and defense strategy. It functions by setting a broad, critical information need that guides further intelligence activities.",
        "distractor_analysis": "The first example is too specific (an SIR/ICR). The second is overly broad and lacks organizational context. The third focuses on vulnerabilities, which is related but not the core strategic threat actor focus of a PIR.",
        "analogy": "A PIR is like asking 'Who are our main competitors and what are their long-term strategies?' It's a high-level question about significant actors and their goals."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "THREAT_INTEL_IR_HIERARCHY",
        "THREAT_ACTOR_ANALYSIS"
      ]
    },
    {
      "question_text": "In the context of ThreatConnect, what is the purpose of the 'Keyword Tracking' step when creating an Intelligence Requirement (IR)?",
      "correct_answer": "To define a logic-based query that identifies and retrieves information relevant to the IR.",
      "distractors": [
        {
          "text": "To assign the IR to specific analysts within the threat intelligence team.",
          "misconception": "Targets [process confusion]: Assignment happens after IR creation and configuration."
        },
        {
          "text": "To generate a final intelligence report based on the IR's findings.",
          "misconception": "Targets [lifecycle stage confusion]: Keyword tracking is for data retrieval, not report generation."
        },
        {
          "text": "To assess the technical feasibility of collecting data for the IR.",
          "misconception": "Targets [purpose misunderstanding]: While feasibility is considered, this step focuses on query definition."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The Keyword Tracking step is crucial because it allows users to build a precise query that functions by filtering vast amounts of data to find relevant information for the IR. This ensures that the intelligence team focuses on data that directly addresses the defined requirement.",
        "distractor_analysis": "Analyst assignment is a later step. Report generation is a subsequent phase. Feasibility is a consideration, but this step's primary function is query construction for data retrieval.",
        "analogy": "Keyword tracking in ThreatConnect is like setting up search filters on a database; you define the terms and logic to find exactly the information you need for your research."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "THREATCONNECT_PLATFORM",
        "THREAT_INTEL_IR_BASICS"
      ]
    },
    {
      "question_text": "Which of the following is a characteristic of a well-formulated Intelligence Requirement (IR) based on best practices?",
      "correct_answer": "It is specific and measurable, allowing for clear determination of when it has been adequately answered.",
      "distractors": [
        {
          "text": "It is always time-bound to a specific date or event.",
          "misconception": "Targets [over-specification]: While often time-bound, it's not an absolute requirement for all IRs."
        },
        {
          "text": "It must be achievable using only readily available commercial threat feeds.",
          "misconception": "Targets [collection constraint]: Limits potential collection methods unnecessarily."
        },
        {
          "text": "It is written in highly technical jargon to ensure precision.",
          "misconception": "Targets [audience confusion]: IRs should be understandable to stakeholders, avoiding unnecessary jargon."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Specificity and measurability are key because they ensure an IR is focused and that its fulfillment can be objectively assessed, leading to actionable intelligence. This functions by providing clear parameters for the intelligence team's efforts and for evaluating success.",
        "distractor_analysis": "While time-bound is a common characteristic, it's not universally mandatory. Collection methods should not be artificially constrained. Technical jargon can hinder understanding for non-technical stakeholders.",
        "analogy": "A well-formulated IR is like a clear recipe instruction: 'Add 2 cups of flour' (specific and measurable) rather than 'Add some flour' (vague) or 'Add flour using a whisk' (unnecessary tool detail)."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "THREAT_INTEL_IR_BASICS",
        "THREAT_INTEL_BEST_PRACTICES"
      ]
    },
    {
      "question_text": "Consider a scenario where a company is expanding into a new geographic region. What type of Intelligence Requirement would be most crucial for understanding potential threats in this new area?",
      "correct_answer": "Geographic Intelligence Requirement",
      "distractors": [
        {
          "text": "Technology Intelligence Requirement",
          "misconception": "Targets [focus confusion]: Geographic IRs are specifically for location-based threats."
        },
        {
          "text": "Industry Intelligence Requirement",
          "misconception": "Targets [focus confusion]: While industry is important, the primary concern is the new region's specific threats."
        },
        {
          "text": "Ad-hoc Intelligence Requirement",
          "misconception": "Targets [subtype confusion]: While it might start as ad-hoc, a structured Geographic IR is more appropriate for ongoing needs."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A Geographic Intelligence Requirement is crucial because it specifically focuses on threats, actors, and vulnerabilities relevant to a particular location, which is essential for a new market entry. It functions by directing intelligence collection and analysis towards the unique threat landscape of that region.",
        "distractor_analysis": "Technology and Industry IRs focus on different aspects. Ad-hoc IRs are typically one-off requests, whereas understanding a new region's threat landscape requires a more structured, ongoing approach.",
        "analogy": "Expanding into a new region requires a 'Geographic IR' like needing a local guide (the intelligence) to navigate unfamiliar territory safely, rather than just asking about the general types of vehicles (technology) or businesses (industry) that exist."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": [
        "THREAT_INTEL_IR_TYPES",
        "GEOPOLITICAL_RISK"
      ]
    },
    {
      "question_text": "What is the primary risk of not having well-defined Intelligence Requirements (IRs) in a threat intelligence program?",
      "correct_answer": "The intelligence team may produce information that is irrelevant or does not support critical decision-making.",
      "distractors": [
        {
          "text": "The intelligence team will be unable to collect any data.",
          "misconception": "Targets [capability over guidance]: Lack of IRs affects focus, not the basic ability to collect data."
        },
        {
          "text": "All collected intelligence will be automatically classified as low priority.",
          "misconception": "Targets [misunderstanding of prioritization]: Prioritization is a function of IRs, not a consequence of their absence."
        },
        {
          "text": "The threat intelligence platform (TIP) will cease to function.",
          "misconception": "Targets [technical overreach]: IRs are a process requirement, not a technical dependency for platform operation."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The primary risk is producing irrelevant intelligence because IRs provide the necessary focus and direction; without them, efforts are unfocused and fail to meet stakeholder needs. This functions by ensuring that collection and analysis are aligned with organizational priorities and decision-making requirements.",
        "distractor_analysis": "Lack of IRs impacts the *relevance* and *utility* of collected data, not the fundamental ability to collect it. Prioritization is guided by IRs, not determined by their absence. IRs are a process, not a technical requirement for a TIP.",
        "analogy": "Without clear IRs, a threat intelligence team is like a ship without a rudder; it can move, but it won't reach a specific destination and might drift aimlessly, producing information that isn't useful."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "evaluate",
      "prerequisites": [
        "THREAT_INTEL_IR_BASICS",
        "THREAT_INTEL_PROGRAM_MANAGEMENT"
      ]
    },
    {
      "question_text": "Which of the following BEST describes the relationship between Priority Intelligence Requirements (PIRs) and Specific Intelligence Requirements (SIRs)?",
      "correct_answer": "SIRs are derived from and support PIRs by breaking down broader strategic questions into more focused inquiries.",
      "distractors": [
        {
          "text": "PIRs are derived from SIRs, with strategic needs emerging from tactical details.",
          "misconception": "Targets [unknown]: Not specified"
        },
        {
          "text": "PIRs and SIRs are independent and serve entirely different intelligence functions.",
          "misconception": "Targets [separation error]: They are interconnected parts of a hierarchical intelligence framework."
        },
        {
          "text": "SIRs are used for immediate tactical responses, while PIRs are for long-term planning.",
          "misconception": "Targets [level mischaracterization]: While SIRs can support tactical needs, PIRs are the strategic drivers for all intelligence."
        }
      ],
      "detailed_explanation": {
        "core_logic": "SIRs are derived from PIRs because they provide the detailed, focused questions needed to answer the broader strategic objectives set by PIRs. This hierarchical structure functions by ensuring that all intelligence activities, from tactical collection to strategic analysis, are aligned with the organization's highest priorities.",
        "distractor_analysis": "The hierarchy flows from PIR to SIR. They are interconnected, not independent. While SIRs can inform tactical responses, their primary role is to support the broader strategic goals of PIRs.",
        "analogy": "A PIR is the goal of 'winning the war,' while SIRs are the specific objectives like 'securing a key city' or 'disrupting enemy supply lines.' The objectives serve the overall goal."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "THREAT_INTEL_IR_HIERARCHY"
      ]
    },
    {
      "question_text": "When creating an Intelligence Requirement (IR) in ThreatConnect, what is the purpose of the 'Subtype' field?",
      "correct_answer": "To categorize the IR based on its specific role within the intelligence hierarchy, such as PIR, SIR, or RFI.",
      "distractors": [
        {
          "text": "To assign a unique identifier (ID) to the IR.",
          "misconception": "Targets [field confusion]: The ID is a separate field; subtype defines its function."
        },
        {
          "text": "To specify the geographic region the IR pertains to.",
          "misconception": "Targets [field confusion]: Geographic focus is part of the requirement's content, not its subtype classification."
        },
        {
          "text": "To determine the priority level of the IR (e.g., High, Medium, Low).",
          "misconception": "Targets [field confusion]: Priority is often assigned separately or implied by the subtype, not directly set by the subtype field itself."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The Subtype field categorizes the IR's function (e.g., PIR, SIR, RFI) because this classification dictates its scope, purpose, and relationship within the intelligence hierarchy. This functions by providing a structured way to manage and understand different types of information needs.",
        "distractor_analysis": "The ID is a distinct field. Geographic focus is content, not classification. Priority is related but not directly set by the subtype itself; the subtype implies a certain level of strategic importance.",
        "analogy": "The 'Subtype' field in ThreatConnect is like choosing the 'type' of document you're creating – 'Report,' 'Memo,' or 'Proposal.' Each type has a different purpose and expected content."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "THREATCONNECT_PLATFORM",
        "THREAT_INTEL_IR_HIERARCHY"
      ]
    },
    {
      "question_text": "A threat intelligence team is asked to provide information on threat actors targeting the financial sector in Southeast Asia. This request is broad and requires detailed analysis of actor motives, TTPs, and potential impacts. Which type of intelligence requirement would BEST capture this need?",
      "correct_answer": "Priority Intelligence Requirement (PIR)",
      "distractors": [
        {
          "text": "Specific Intelligence Requirement (SIR)",
          "misconception": "Targets [level confusion]: SIRs are more focused, supporting PIRs, not defining broad actor motives."
        },
        {
          "text": "Request for Information (RFI)",
          "misconception": "Targets [subtype confusion]: RFIs are typically one-off, less structured requests, not ongoing strategic needs."
        },
        {
          "text": "Research Requirement (RR)",
          "misconception": "Targets [subtype confusion]: RRs are for areas of general interest, not specific, high-priority actor analysis."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A Priority Intelligence Requirement (PIR) is the most suitable because it addresses high-level, strategic questions about threat actor motives and objectives, which directly inform major organizational decisions. It functions by setting the overarching direction for intelligence efforts concerning critical threats.",
        "distractor_analysis": "SIRs are too specific for this broad request. RFIs and RRs are typically for less critical or one-off information needs, not the strategic focus required for understanding major threat actors.",
        "analogy": "Asking 'Who are the main adversaries targeting our industry and what do they want?' is a PIR, like asking the CEO about the company's biggest strategic challenges."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": [
        "THREAT_INTEL_IR_HIERARCHY",
        "THREAT_ACTOR_ANALYSIS"
      ]
    },
    {
      "question_text": "What is the role of 'Intelligence Requirement Categories' in platforms like ThreatConnect?",
      "correct_answer": "To help organize and group related Intelligence Requirements (IRs) for better management and analysis.",
      "distractors": [
        {
          "text": "To automatically generate intelligence reports based on the IR's findings.",
          "misconception": "Targets [function confusion]: Categories are for organization, not automated reporting."
        },
        {
          "text": "To define the specific keywords used in the IR's query logic.",
          "misconception": "Targets [field confusion]: Keywords are configured in the 'Keyword Tracking' step, not the category."
        },
        {
          "text": "To assign a priority level (e.g., High, Medium, Low) to the IR.",
          "misconception": "Targets [field confusion]: Priority is often a separate attribute or implied by the subtype, not directly set by the category."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Categories help organize IRs because they allow for logical grouping based on themes (e.g., by industry, threat type, or region), improving manageability and analysis. This functions by providing a structured taxonomy that aids in filtering, reporting, and understanding the landscape of intelligence needs.",
        "distractor_analysis": "Categories are for organization and filtering, not automated reporting. Keywords are part of the query definition. Priority is a separate attribute or implied by subtype.",
        "analogy": "IR Categories are like folders on your computer; they help you sort and find related documents (IRs) more easily, rather than being the content of the document itself."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "THREATCONNECT_PLATFORM",
        "THREAT_INTEL_IR_BASICS"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 15,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Intelligence Requirements (IRs) Definition Threat Intelligence And Hunting best practices",
    "latency_ms": 86205.584
  },
  "timestamp": "2026-01-04T02:27:27.207973"
}