{
  "topic_title": "Occupant Emergency Plan (OEP)",
  "category": "Security And Risk Management - Business Continuity Planning",
  "flashcards": [
    {
      "question_text": "According to FEMA's Comprehensive Preparedness Guide (CPG) 101, what is the primary purpose of an Occupant Emergency Plan (OEP)?",
      "correct_answer": "To provide guidance for developing and reviewing Occupant Emergency Programs for the safety and security of employees and visitors at federal locations.",
      "distractors": [
        {
          "text": "To detail cybersecurity incident response protocols for federal agencies.",
          "misconception": "Targets [domain confusion]: Confuses OEPs with cybersecurity incident response plans, which have different objectives and scope."
        },
        {
          "text": "To outline business continuity strategies for maintaining essential services during disruptions.",
          "misconception": "Targets [scope confusion]: OEPs focus on immediate occupant safety during emergencies, while BCP addresses broader business continuity."
        },
        {
          "text": "To establish physical security measures for federal facilities against external threats.",
          "misconception": "Targets [functional overlap]: While OEPs include security aspects, their primary focus is occupant safety during immediate emergencies, not comprehensive physical security."
        }
      ],
      "detailed_explanation": {
        "core_logic": "OEPs are designed to ensure the safety and security of occupants during emergencies, providing a framework for prevention, protection, response, and recovery activities, as detailed in FEMA's CPG 101.",
        "distractor_analysis": "Distractors incorrectly associate OEPs with cybersecurity, broad business continuity, or solely physical security, missing the core focus on occupant safety during immediate emergencies.",
        "analogy": "An OEP is like a building's fire drill plan – it tells everyone what to do to stay safe if there's an immediate danger, not how to keep the company running if the power goes out for a week."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EMERGENCY_PLANNING_FUNDAMENTALS"
      ]
    },
    {
      "question_text": "Which of the following is a key component of an effective Occupant Emergency Plan (OEP) as outlined by FEMA's CPG 101?",
      "correct_answer": "Clear instruction on roles and responsibilities for all aspects of the preparedness spectrum (prevention, protection, response, recovery).",
      "distractors": [
        {
          "text": "Detailed technical specifications for IT infrastructure resilience.",
          "misconception": "Targets [scope mismatch]: OEPs focus on occupant safety and immediate response, not the technical details of IT resilience, which falls under BCP or IT DR."
        },
        {
          "text": "A comprehensive risk assessment of all potential cyber threats.",
          "misconception": "Targets [focus error]: While risk assessment is part of planning, OEPs prioritize occupant safety and immediate emergency response over a deep dive into cyber threats."
        },
        {
          "text": "A complete inventory of all building assets and their replacement costs.",
          "misconception": "Targets [priority error]: Asset inventory is important for insurance and recovery but not a primary component for immediate occupant safety during an emergency."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Effective OEPs, as per FEMA CPG 101, must clearly define roles and responsibilities across all phases of emergency management to ensure coordinated and safe occupant actions during any incident.",
        "distractor_analysis": "The distractors misrepresent the core focus of an OEP by emphasizing technical IT details, cyber-specific risk, or asset inventory, rather than the critical human safety and response roles.",
        "analogy": "An OEP's roles and responsibilities are like a play's script – each actor (department/individual) knows exactly what to do and when to ensure the performance (emergency response) goes smoothly."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "OEP_FUNDAMENTALS",
        "EMERGENCY_RESPONSE_ROLES"
      ]
    },
    {
      "question_text": "According to the Federal Protective Service (FPS) guidance, what is a critical element for an Occupant Emergency Plan (OEP) to be effective?",
      "correct_answer": "Coordination with local emergency responders.",
      "distractors": [
        {
          "text": "Sole reliance on internal security personnel for all emergency actions.",
          "misconception": "Targets [collaboration deficit]: OEPs require integration with external emergency services for comprehensive response, not isolation."
        },
        {
          "text": "A plan that is generic and applicable to any type of facility.",
          "misconception": "Targets [specificity requirement]: Effective OEPs must be facility-specific, addressing unique threats, hazards, and needs."
        },
        {
          "text": "Exclusion of private sector tenants from the planning process.",
          "misconception": "Targets [stakeholder exclusion]: OEPs should involve all occupants and tenants to ensure comprehensive safety and coordinated action."
        }
      ],
      "detailed_explanation": {
        "core_logic": "FPS guidance emphasizes that effective OEPs require coordination with local emergency responders because they are critical for managing incidents and ensuring the safety of facility occupants.",
        "distractor_analysis": "The distractors suggest isolation from external help, a lack of specificity, and exclusion of stakeholders, all of which contradict best practices for OEP development and effectiveness.",
        "analogy": "An OEP without coordination with local responders is like a fire alarm that doesn't connect to the fire department – it signals a problem but doesn't bring the necessary help."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "OEP_DEVELOPMENT",
        "EMERGENCY_RESPONSE_COORDINATION"
      ]
    },
    {
      "question_text": "When developing an Occupant Emergency Plan (OEP), which principle from FEMA's CPG 101 is crucial for ensuring equitable services and resources?",
      "correct_answer": "Community-based planning that represents the whole population and its needs.",
      "distractors": [
        {
          "text": "Planning exclusively for the needs of the most technologically savvy employees.",
          "misconception": "Targets [equity failure]: This approach ignores diverse needs, particularly those of vulnerable populations, leading to inequitable outcomes."
        },
        {
          "text": "Focusing solely on the needs of individuals with high-security clearances.",
          "misconception": "Targets [exclusionary planning]: This limits the plan's scope and fails to address the needs of all occupants, including those with access and functional needs."
        },
        {
          "text": "Prioritizing only the needs of senior management and executives.",
          "misconception": "Targets [inequitable resource allocation]: This overlooks the diverse needs of the entire occupant population, leading to potential disparities in safety and support."
        }
      ],
      "detailed_explanation": {
        "core_logic": "FEMA's CPG 101 stresses community-based planning because understanding and representing the entire population's needs ensures that resources and services are equitably distributed during emergencies.",
        "distractor_analysis": "The distractors propose exclusionary planning approaches that fail to consider the diverse needs of all occupants, directly contradicting the principle of equitable service delivery in OEPs.",
        "analogy": "A community-based OEP is like a town hall meeting where everyone's voice is heard; it ensures the emergency plan serves everyone, not just a select few."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "OEP_PLANNING_PRINCIPLES",
        "EQUITY_IN_EMERGENCY_MANAGEMENT"
      ]
    },
    {
      "question_text": "What is the primary goal of the 'Occupant Emergency Programs: An Interagency Security Committee Guide – 2024 Edition'?",
      "correct_answer": "To provide updates and critical information for developing and reviewing Occupant Emergency Programs for federal locations.",
      "distractors": [
        {
          "text": "To standardize cybersecurity frameworks across all federal agencies.",
          "misconception": "Targets [misdirected focus]: The guide is for OEPs, not cybersecurity frameworks, which are addressed by other standards like NIST SP 800-53."
        },
        {
          "text": "To mandate specific building construction codes for federal facilities.",
          "misconception": "Targets [scope deviation]: While safety is a concern, the guide focuses on emergency program development, not building codes themselves."
        },
        {
          "text": "To create a unified national disaster recovery strategy.",
          "misconception": "Targets [functional misclassification]: OEPs are about immediate occupant safety and response, distinct from long-term disaster recovery strategies."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The Interagency Security Committee Guide (2024 Edition) aims to update and guide federal agencies in creating robust Occupant Emergency Programs, focusing on occupant safety and preparedness for various emergencies.",
        "distractor_analysis": "The distractors misrepresent the guide's purpose by linking it to cybersecurity, building codes, or national recovery strategies, rather than its specific focus on OEP development for federal facilities.",
        "analogy": "This guide is like an updated manual for a building's emergency procedures, ensuring it covers new threats and best practices for keeping people safe inside."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "OEP_GUIDANCE",
        "FEDERAL_FACILITY_SECURITY"
      ]
    },
    {
      "question_text": "According to OSHA's guidance on Emergency Action Plans (EAPs), what is a critical step in developing an effective plan?",
      "correct_answer": "Involving employees in the planning process to identify potential hazards and suggest responses.",
      "distractors": [
        {
          "text": "Creating a plan that is solely the responsibility of the safety manager.",
          "misconception": "Targets [lack of buy-in]: Effective EAPs require broad input and buy-in; sole responsibility can lead to overlooked issues and poor adoption."
        },
        {
          "text": "Developing a plan that is highly technical and uses complex jargon.",
          "misconception": "Targets [usability issue]: Plans must be clear and understandable to all employees to be effective during an emergency."
        },
        {
          "text": "Assuming that employees will understand their roles without explicit training.",
          "misconception": "Targets [inadequate training]: OSHA mandates training; assuming understanding without it is a critical failure."
        }
      ],
      "detailed_explanation": {
        "core_logic": "OSHA emphasizes employee involvement because their direct experience with the workplace is invaluable for identifying hazards and ensuring the EAP is practical and understood, thereby increasing its effectiveness.",
        "distractor_analysis": "The distractors suggest a top-down, exclusive, or overly technical approach, neglecting the crucial elements of employee participation, clarity, and mandatory training highlighted by OSHA.",
        "analogy": "An EAP developed with employee input is like a team sport playbook written by the players – it's more likely to be practical, understood, and effectively executed."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "EAP_DEVELOPMENT",
        "EMPLOYEE_TRAINING"
      ]
    },
    {
      "question_text": "When an emergency occurs at a workplace, and local emergency officials respond, who assumes overall authority for directing response activities?",
      "correct_answer": "The highest-ranking responding official.",
      "distractors": [
        {
          "text": "The designated workplace emergency coordinator, regardless of external response.",
          "misconception": "Targets [authority conflict]: While the coordinator manages internal EAP activation, external responders take command during an active incident."
        },
        {
          "text": "The facility's security manager, who has ultimate responsibility for site safety.",
          "misconception": "Targets [misplaced authority]: Security managers are crucial, but command during an emergency rests with the incident commander from the responding agency."
        },
        {
          "text": "The senior executive of the organization present at the scene.",
          "misconception": "Targets [chain of command error]: Executive presence is important, but operational command during an emergency is determined by incident command structure, not corporate hierarchy."
        }
      ],
      "detailed_explanation": {
        "core_logic": "During an emergency response, the highest-ranking official from the responding external agency (e.g., fire department) assumes incident command, integrating with internal resources but maintaining ultimate authority for safety and property protection.",
        "distractor_analysis": "The distractors incorrectly assign command authority to internal roles (coordinator, security manager, executive) rather than the established incident command structure led by external emergency responders.",
        "analogy": "When the fire department arrives, they take charge of fighting the fire; similarly, the highest-ranking emergency responder takes command of the overall incident response, overriding internal management for that specific event."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": [
        "INCIDENT_COMMAND_SYSTEM",
        "EMERGENCY_RESPONSE_AUTHORITY"
      ]
    },
    {
      "question_text": "What is the primary purpose of the 'Occupant Emergency Programs Guide' published by CISA?",
      "correct_answer": "To assist department and agency security planners in developing and reviewing Occupant Emergency Programs for federal locations.",
      "distractors": [
        {
          "text": "To provide a standardized cybersecurity risk assessment framework for federal IT systems.",
          "misconception": "Targets [unknown]: Not specified"
        },
        {
          "text": "To establish requirements for business continuity and disaster recovery planning.",
          "misconception": "Targets [scope mismatch]: While related, OEPs are distinct from broader business continuity and disaster recovery planning."
        },
        {
          "text": "To mandate specific building security technologies for federal facilities.",
          "misconception": "Targets [implementation detail vs. program guidance]: The guide provides program development guidance, not specific technology mandates."
        }
      ],
      "detailed_explanation": {
        "core_logic": "CISA's guide is specifically designed to support federal security planners in creating and refining Occupant Emergency Programs, ensuring occupant safety and preparedness for various emergencies.",
        "distractor_analysis": "The distractors incorrectly attribute the guide's purpose to cybersecurity, business continuity, or technology mandates, failing to recognize its specific focus on OEP development for federal facilities.",
        "analogy": "This guide is like a detailed instruction manual for setting up a building's emergency response system, ensuring all occupants are safe during an incident."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "OEP_GUIDANCE",
        "FEDERAL_FACILITY_SECURITY"
      ]
    },
    {
      "question_text": "FEMA's CPG 101 emphasizes 'planning should be community-based, representing the whole population and its needs.' How does this principle apply to OEP development?",
      "correct_answer": "It ensures that plans consider and address the diverse needs of all occupants, including those with disabilities, limited English proficiency, and other access and functional needs.",
      "distractors": [
        {
          "text": "It means plans should be standardized across all federal buildings for consistency.",
          "misconception": "Targets [misinterpretation of standardization]: Community-based planning emphasizes tailoring to local needs, not a one-size-fits-all approach."
        },
        {
          "text": "It requires focusing only on the needs of the majority population to simplify planning.",
          "misconception": "Targets [equity violation]: This approach neglects vulnerable populations, leading to inequitable outcomes and failing the 'whole population' principle."
        },
        {
          "text": "It suggests that only government employees need to be considered in the plan.",
          "misconception": "Targets [stakeholder exclusion]: OEPs must consider all occupants, including contractors, visitors, and tenants, not just government employees."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A community-based approach ensures OEPs are inclusive, because by representing the whole population, including vulnerable groups, plans can better address diverse needs and ensure equitable safety and resource allocation.",
        "distractor_analysis": "The distractors misinterpret 'community-based' as standardization, majority focus, or exclusion of non-government personnel, failing to grasp its core meaning of inclusivity and tailored planning for all.",
        "analogy": "A community-based OEP is like designing a public park that considers accessibility for everyone – ramps for wheelchairs, clear signage, and diverse seating – ensuring it serves all potential users."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "OEP_PLANNING_PRINCIPLES",
        "INCLUSIVE_PLANNING"
      ]
    },
    {
      "question_text": "Which of the following best describes the relationship between an Occupant Emergency Plan (OEP) and a Continuity of Operations (COOP) plan?",
      "correct_answer": "An OEP focuses on immediate occupant safety and evacuation during an emergency, while a COOP plan ensures essential functions continue during and after disruptions.",
      "distractors": [
        {
          "text": "An OEP is a subset of a COOP plan, detailing only the evacuation procedures.",
          "misconception": "Targets [hierarchical confusion]: OEPs and COOPs are complementary but distinct plans with different primary objectives."
        },
        {
          "text": "A COOP plan is only necessary if an OEP is deemed insufficient.",
          "misconception": "Targets [redundancy misunderstanding]: Both plans address different, critical aspects of organizational resilience and are often developed concurrently."
        },
        {
          "text": "An OEP and a COOP plan are interchangeable and serve the same purpose.",
          "misconception": "Targets [functional overlap error]: While both are emergency preparedness plans, their scopes and objectives differ significantly."
        }
      ],
      "detailed_explanation": {
        "core_logic": "OEPs prioritize immediate life safety and evacuation, whereas COOP plans focus on maintaining essential government functions during disruptions, making them complementary but distinct preparedness strategies.",
        "distractor_analysis": "The distractors incorrectly position OEPs as a subset of COOP, suggest one replaces the other, or claim they are interchangeable, failing to recognize their distinct but complementary roles in organizational resilience.",
        "analogy": "An OEP is like the emergency exit plan for a building during a fire drill, ensuring everyone gets out safely. A COOP plan is like having a backup generator and remote work setup to keep the business running during a prolonged power outage."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "OEP_FUNDAMENTALS",
        "COOP_FUNDAMENTALS"
      ]
    },
    {
      "question_text": "According to OSHA, when is an oral communication sufficient for an Emergency Action Plan (EAP)?",
      "correct_answer": "For employers with 10 or fewer employees.",
      "distractors": [
        {
          "text": "When the workplace has no hazardous materials.",
          "misconception": "Targets [incomplete condition]: While fewer hazards might simplify an EAP, the number of employees is the primary factor for oral communication allowance."
        },
        {
          "text": "If the EAP is reviewed annually by all employees.",
          "misconception": "Targets [procedural misstep]: Annual review doesn't negate the requirement for a written plan for larger workforces; it's about communication method."
        },
        {
          "text": "When the EAP is posted in a publicly accessible location.",
          "misconception": "Targets [communication method vs. accessibility]: Posting is about accessibility, not the method of communication for plan dissemination to employees."
        }
      ],
      "detailed_explanation": {
        "core_logic": "OSHA permits oral communication of an EAP for employers with 10 or fewer employees because the smaller workforce size facilitates direct communication and understanding, simplifying the dissemination process.",
        "distractor_analysis": "The distractors incorrectly link oral communication allowance to workplace hazards, review frequency, or posting accessibility, rather than the specific OSHA criterion of workforce size (10 or fewer employees).",
        "analogy": "For a small family business, an oral explanation of the emergency plan is like telling your family what to do in case of a fire. For a large corporation, a written plan is essential to ensure everyone gets the same, clear instructions."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "EAP_COMMUNICATION",
        "OSHA_REGULATIONS"
      ]
    },
    {
      "question_text": "In the context of Occupant Emergency Plans (OEPs), what does the term 'community lifelines' primarily refer to?",
      "correct_answer": "Critical government and business functions essential to human health, safety, or economic security that must be stabilized after a disaster.",
      "distractors": [
        {
          "text": "The physical routes used by occupants to evacuate a building.",
          "misconception": "Targets [narrow interpretation]: Lifelines are broader than just evacuation routes; they encompass essential services that enable society to function."
        },
        {
          "text": "The communication networks used by emergency responders.",
          "misconception": "Targets [component vs. concept]: Communication networks are part of stabilizing lifelines, but lifelines themselves represent the essential services."
        },
        {
          "text": "The financial resources available for disaster recovery efforts.",
          "misconception": "Targets [misplaced focus]: Lifelines are about operational continuity and essential services, not solely financial recovery mechanisms."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Community lifelines, as defined by FEMA, represent the most critical services that enable society to function, and their stabilization is a priority in disaster response to ensure human health, safety, and economic security.",
        "distractor_analysis": "The distractors incorrectly narrow the definition of community lifelines to evacuation routes, communication networks, or financial resources, failing to capture their broader scope of essential societal functions.",
        "analogy": "Community lifelines are like the vital organs of a city – if they stop working (e.g., power, water, communication), the whole body (community) suffers; stabilizing them is crucial for survival and recovery."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "COMMUNITY_LIFELINES",
        "DISASTER_RESPONSE_PRIORITIES"
      ]
    },
    {
      "question_text": "Which of the following is a common pitfall in developing Emergency Operations Plans (EOPs), as identified in FEMA's CPG 101?",
      "correct_answer": "Developing overly detailed plans that are not useful in guiding actual operations.",
      "distractors": [
        {
          "text": "Failing to include enough detail about specific equipment maintenance schedules.",
          "misconception": "Targets [level of detail error]: EOPs should focus on operational guidance, not granular equipment maintenance, which belongs in SOPs."
        },
        {
          "text": "Over-reliance on historical data without considering future threats.",
          "misconception": "Targets [risk assessment imbalance]: While historical data is useful, plans must also account for evolving threats and future risks."
        },
        {
          "text": "Not involving enough technical experts in the planning process.",
          "misconception": "Targets [stakeholder balance]: While experts are needed, the pitfall is often excessive detail or lack of practicality, not necessarily a lack of technical experts."
        }
      ],
      "detailed_explanation": {
        "core_logic": "FEMA's CPG 101 warns against overly detailed EOPs because they become cumbersome, difficult to use during dynamic incidents, and less effective than concise, actionable guidance.",
        "distractor_analysis": "The distractors suggest other potential planning issues but miss the specific pitfall of excessive detail that hinders practical application, which is a key warning in FEMA's guidance.",
        "analogy": "An overly detailed EOP is like a 1000-page instruction manual for changing a tire – it has all the information but is too complex to be useful in a roadside emergency."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "EOP_PLANNING_PITFALLS",
        "PLAN_EFFECTIVENESS"
      ]
    },
    {
      "question_text": "When creating an Occupant Emergency Plan (OEP), what is the significance of 'planning assumptions'?",
      "correct_answer": "They are elements accepted as true for planning purposes, allowing the EOP to be developed, and are replaced by facts as the incident unfolds.",
      "distractors": [
        {
          "text": "They are confirmed facts about the environment that are used to build the plan.",
          "misconception": "Targets [fact vs. assumption confusion]: Assumptions are used when facts are unavailable; they are not verified truths."
        },
        {
          "text": "They represent the final, unchangeable decisions made during the planning process.",
          "misconception": "Targets [inflexibility error]: Assumptions are placeholders that must be validated and adjusted based on real-time incident data."
        },
        {
          "text": "They are only relevant during the initial phases of an emergency response.",
          "misconception": "Targets [limited applicability]: Assumptions guide the entire plan's development and are revisited throughout the response as facts emerge."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Planning assumptions are crucial because they enable plan development in the absence of complete information; they provide a framework that is later validated or corrected by actual incident facts, ensuring adaptability.",
        "distractor_analysis": "The distractors incorrectly define assumptions as verified facts, unchangeable decisions, or only relevant to initial response, missing their role as provisional elements guiding plan creation and adaptation.",
        "analogy": "Planning assumptions are like educated guesses made before a trip – you assume the weather will be good, but you pack an umbrella just in case, ready to adjust your plans based on the actual weather."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PLANNING_ASSUMPTIONS",
        "EOP_DEVELOPMENT_PROCESS"
      ]
    },
    {
      "question_text": "According to FEMA's CPG 101, what is the relationship between an Emergency Operations Plan (EOP) and Incident Action Plans (IAPs)?",
      "correct_answer": "EOPs provide the overarching framework and strategy, while IAPs are iterative operational plans developed for specific operational periods during an incident.",
      "distractors": [
        {
          "text": "IAPs are detailed annexes to the EOP that specify every possible action.",
          "misconception": "Targets [granularity error]: EOPs are broad; IAPs are tactical and time-bound, not exhaustive specifications for all scenarios."
        },
        {
          "text": "EOPs are developed only after an incident occurs, while IAPs are pre-incident plans.",
          "misconception": "Targets [timing error]: EOPs are deliberate, pre-incident plans; IAPs are dynamic, incident-driven operational plans."
        },
        {
          "text": "IAPs are a higher-level strategic document than EOPs.",
          "misconception": "Targets [hierarchical confusion]: EOPs provide the strategic and operational framework; IAPs are tactical, focusing on short-term objectives."
        }
      ],
      "detailed_explanation": {
        "core_logic": "EOPs establish the foundational strategy and structure for emergency response, while IAPs translate this into actionable, time-specific objectives and tactics for each operational period during an actual incident.",
        "distractor_analysis": "The distractors misrepresent the relationship by confusing the scope, timing, or hierarchy of EOPs and IAPs, failing to distinguish between strategic/operational planning and tactical/iterative incident planning.",
        "analogy": "An EOP is the overall game plan for a season, outlining team strategy and goals. An IAP is the play-by-play for a specific quarter of a game, detailing the immediate actions to achieve short-term objectives."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "EOP_VS_IAP",
        "INCIDENT_ACTION_PLANNING"
      ]
    },
    {
      "question_text": "When reviewing an Occupant Emergency Plan (OEP), which criterion from FEMA's CPG 101 assesses whether the organization can accomplish the assigned mission with available resources?",
      "correct_answer": "Feasibility",
      "distractors": [
        {
          "text": "Completeness",
          "misconception": "Targets [definition mismatch]: Completeness checks if all tasks and capabilities are included, not resource availability for execution."
        },
        {
          "text": "Acceptability",
          "misconception": "Targets [definition mismatch]: Acceptability relates to meeting intent, constraints, and law, not resource sufficiency for execution."
        },
        {
          "text": "Adequacy",
          "misconception": "Targets [definition mismatch]: Adequacy checks if the plan identifies essential tasks and measures to accomplish the mission, not if resources exist to do so."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Feasibility, as defined by FEMA CPG 101, directly assesses whether the organization possesses or can acquire the necessary resources (personnel, equipment, time) to execute the plan's mission and tasks effectively.",
        "distractor_analysis": "The distractors represent other EOP review criteria (completeness, acceptability, adequacy) but fail to capture the specific meaning of feasibility, which is tied to resource availability and execution capability.",
        "analogy": "Checking for feasibility in an OEP is like asking if you have enough gas, a working car, and a map before starting a road trip – it ensures you have the necessary resources to actually make the journey."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EOP_REVIEW_CRITERIA",
        "RESOURCE_MANAGEMENT"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 16,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Occupant Emergency Plan (OEP) Security And Risk Management best practices",
    "latency_ms": 24581.63
  },
  "timestamp": "2026-01-01T10:30:02.606676"
}