{
  "topic_title": "Archive Metadata Preservation",
  "category": "Asset Security - Asset Retention",
  "flashcards": [
    {
      "question_text": "According to the National Archives (NARA), what is the primary purpose of maintaining metadata for permanent electronic records?",
      "correct_answer": "To assist agencies in ensuring metadata accompanying transfers of permanent electronic records complies with NARA requirements.",
      "distractors": [
        {
          "text": "To enable immediate public access to all archived digital content.",
          "misconception": "Targets [access scope]: Confuses metadata's role in access with unrestricted immediate access."
        },
        {
          "text": "To automatically migrate all records to the latest file formats.",
          "misconception": "Targets [preservation action confusion]: Metadata supports preservation decisions, it doesn't automate migration."
        },
        {
          "text": "To reduce the storage footprint of digital archives through compression.",
          "misconception": "Targets [metadata function confusion]: Metadata describes records; it does not inherently compress them."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Metadata is crucial for ensuring that digital records meet archival standards for transfer and long-term management, because it provides essential descriptive, technical, and administrative information. This ensures authenticity, integrity, and usability over time.",
        "distractor_analysis": "The first distractor overstates the access function of metadata. The second incorrectly assumes metadata automates migration. The third misattributes storage reduction capabilities to metadata.",
        "analogy": "Metadata for archival preservation is like the catalog card and Dewey Decimal System for a library; it helps you find, understand, and manage the books (records) correctly, not to magically shrink them or make them instantly available to everyone."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "ARCHIVAL_BASICS",
        "METADATA_FUNDAMENTALS"
      ]
    },
    {
      "question_text": "Library and Archives Canada (LAC) mandates specific metadata for digital archival records. Which of the following is a mandatory metadata concept for items at the point of transfer to LAC?",
      "correct_answer": "Integrity",
      "distractors": [
        {
          "text": "Rights management information",
          "misconception": "Targets [obligation level]: Rights management is mandatory for aggregations, but only where present for items."
        },
        {
          "text": "Technical environment information",
          "misconception": "Targets [scope of obligation]: Technical environment info is mandatory for aggregations, not typically for individual items at transfer."
        },
        {
          "text": "Creator",
          "misconception": "Targets [obligation level]: Creator is mandatory for transfers of aggregations, but only where present for items."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Integrity metadata is mandatory for individual items at the point of transfer to LAC because it allows the archive to verify that the digital content has remained complete and unaltered since its creation or last modification. This ensures authenticity and reliability.",
        "distractor_analysis": "Rights management and Creator are mandatory under specific conditions (aggregations, or where present for items), but Integrity is a core requirement for individual items at transfer. Technical environment info is for aggregations.",
        "analogy": "Ensuring 'Integrity' for a transferred digital record is like getting a tamper-evident seal on a package; it proves the contents haven't been messed with during transit."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "LAC_METADATA_STANDARD",
        "DIGITAL_PRESERVATION_CONCEPTS"
      ]
    },
    {
      "question_text": "What is the primary function of 'fixity' metadata in digital preservation?",
      "correct_answer": "To ensure a digital object has remained whole and unaltered over time.",
      "distractors": [
        {
          "text": "To describe the intellectual content of the digital object.",
          "misconception": "Targets [metadata category confusion]: This describes descriptive metadata, not fixity."
        },
        {
          "text": "To track the origin and creator of the digital object.",
          "misconception": "Targets [metadata category confusion]: This describes provenance/administrative metadata, not fixity."
        },
        {
          "text": "To define the file format and rendering requirements.",
          "misconception": "Targets [metadata category confusion]: This describes technical metadata, not fixity."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Fixity metadata, often in the form of checksums or cryptographic hashes, ensures the integrity of digital objects by verifying that their bit-level content has not changed. This is crucial because digital media are brittle and susceptible to corruption, thus guaranteeing authenticity.",
        "distractor_analysis": "Each distractor describes a different type of metadata (descriptive, administrative, technical) and incorrectly attributes it to the function of fixity.",
        "analogy": "Fixity metadata is like a digital fingerprint for a file; if the fingerprint matches what was recorded previously, you know the file hasn't been altered."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "DIGITAL_PRESERVATION_CONCEPTS",
        "METADATA_TYPES"
      ]
    },
    {
      "question_text": "In the context of digital archival records, what does the PREMIS (Preservation Metadata: Implementation Strategies) standard primarily aim to achieve?",
      "correct_answer": "Provide a common data model and semantic units to support core digital preservation functions.",
      "distractors": [
        {
          "text": "Define specific file format migration strategies for all digital objects.",
          "misconception": "Targets [scope of PREMIS]: PREMIS is a framework, not a prescriptive migration guide; it supports decisions about migration."
        },
        {
          "text": "Establish universal requirements for digital repository software.",
          "misconception": "Targets [scope of PREMIS]: PREMIS is metadata-focused, not a software engineering standard."
        },
        {
          "text": "Automate the process of digital object appraisal and selection.",
          "misconception": "Targets [scope of PREMIS]: PREMIS supports preservation actions, not the initial appraisal process."
        }
      ],
      "detailed_explanation": {
        "core_logic": "PREMIS provides a standardized way to describe the preservation metadata needed for digital objects, enabling interoperability and consistent management across different systems. It focuses on core preservation functions like ensuring authenticity, integrity, and renderability, because these are essential for long-term access.",
        "distractor_analysis": "The distractors misrepresent PREMIS's scope by attributing prescriptive migration strategies, software engineering requirements, or appraisal automation to it.",
        "analogy": "PREMIS is like a universal language for describing the 'health records' of digital assets, ensuring that anyone looking at them understands what's been done to keep them alive and well, without dictating the exact medical procedures."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PREMIS_STANDARD",
        "DIGITAL_PRESERVATION_FRAMEWORKS"
      ]
    },
    {
      "question_text": "A government institution is preparing to transfer digital archival records to Library and Archives Canada (LAC). Which metadata element is MANDATORY for the transfer of an aggregation of records, even if it was not explicitly configured for individual items within that aggregation?",
      "correct_answer": "Disposition authorization",
      "distractors": [
        {
          "text": "Integrity",
          "misconception": "Targets [obligation level]: Integrity is mandatory for individual items at transfer, not necessarily for the aggregation itself."
        },
        {
          "text": "Format",
          "misconception": "Targets [obligation level]: Format is mandatory for individual items, but not a universal requirement for the aggregation at transfer."
        },
        {
          "text": "Language",
          "misconception": "Targets [obligation level]: Language is mandatory where present for items, but not a mandatory element for all aggregations at transfer."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The disposition authorization is mandatory for aggregations at transfer because it confirms the legal instrument under which the records are being transferred to LAC, providing essential context and authority for the archival acquisition. This ensures compliance with archival legislation.",
        "distractor_analysis": "Integrity and Format are primarily item-level requirements at transfer. Language is mandatory where present for items. Disposition authorization is a key administrative requirement for the transfer of aggregations.",
        "analogy": "Transferring a collection of archived documents (an aggregation) to LAC without its 'Disposition Authorization' is like trying to move house without the deed; it lacks the official permission and context for the transfer."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "LAC_METADATA_STANDARD",
        "ARCHIVAL_TRANSFER_PROCEDURES"
      ]
    },
    {
      "question_text": "Consider a digital object that has undergone multiple format migrations over its lifecycle. Which type of metadata is MOST critical for ensuring that the object remains understandable and usable in its original context, even after these transformations?",
      "correct_answer": "Administrative metadata (including provenance and preservation actions)",
      "distractors": [
        {
          "text": "Descriptive metadata",
          "misconception": "Targets [metadata purpose]: Descriptive metadata aids discovery but doesn't detail the preservation journey."
        },
        {
          "text": "Technical metadata for file rendering",
          "misconception": "Targets [metadata purpose]: This metadata helps render the current format, not explain the history of transformations."
        },
        {
          "text": "Structural metadata",
          "misconception": "Targets [metadata purpose]: Structural metadata defines relationships within an object, not its preservation history."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Administrative metadata, particularly provenance and preservation action information, is critical because it documents the history of the digital object, including format migrations, tools used, and reasons for changes. This context is essential for understanding the object's authenticity and ensuring its long-term usability, as it explains how the object evolved.",
        "distractor_analysis": "Descriptive metadata aids discovery, technical metadata aids rendering, and structural metadata defines internal relationships. None of these directly explain the object's preservation journey as well as administrative metadata.",
        "analogy": "Administrative metadata for digital preservation is like a detailed logbook for a ship; it records every journey, repair, and change of course, allowing future navigators to understand the ship's history and current state."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "DIGITAL_PRESERVATION_CONCEPTS",
        "METADATA_TYPES"
      ]
    },
    {
      "question_text": "What is the main challenge when combining different metadata specifications or embedding extension metadata, as highlighted by initiatives like PREMIS and METS?",
      "correct_answer": "Potential for mismatched data models and overlapping semantic units, leading to interoperability issues.",
      "distractors": [
        {
          "text": "Lack of available XML schemas for embedding metadata.",
          "misconception": "Targets [technical feasibility]: XML schemas are generally available; the challenge is semantic alignment."
        },
        {
          "text": "Overly simplistic metadata elements that cannot capture complex digital objects.",
          "misconception": "Targets [metadata complexity]: Standards like PREMIS and METS are designed for complexity, but their combination can create conflicts."
        },
        {
          "text": "Insufficient processing power to handle large volumes of combined metadata.",
          "misconception": "Targets [performance vs. semantic issues]: The primary challenge is semantic and structural, not purely computational."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Combining metadata specifications can lead to interoperability problems because different schemas may have conflicting data models or semantic units that are defined differently or overlap. This requires careful mapping and documentation, such as metadata profiles, to ensure consistent interpretation and exchange of information.",
        "distractor_analysis": "The distractors focus on technical limitations (lack of schemas, processing power) or oversimplification, rather than the core semantic and structural conflicts that arise when integrating different metadata standards.",
        "analogy": "Trying to combine instructions from two different IKEA manuals for the same piece of furniture can lead to confusion if the part names or assembly steps don't perfectly align – that's the interoperability challenge with metadata."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "METADATA_INTEROPERABILITY",
        "PREMIS_STANDARD",
        "METS_STANDARD"
      ]
    },
    {
      "question_text": "Which of the following BEST describes the role of metadata in ensuring the authenticity of digital archival records?",
      "correct_answer": "It provides evidence of the record's origin, integrity, and history of management and preservation actions.",
      "distractors": [
        {
          "text": "It guarantees that the record has never been modified since its creation.",
          "misconception": "Targets [absolute integrity misconception]: Metadata documents changes and provenance, not necessarily a lack of any modification."
        },
        {
          "text": "It confirms the record is stored on secure, immutable storage media.",
          "misconception": "Targets [storage vs. metadata function]: Metadata describes the record; it doesn't dictate or guarantee the storage medium's properties."
        },
        {
          "text": "It automatically validates the record's content against legal requirements.",
          "misconception": "Targets [metadata scope]: Metadata supports validation by providing context, but doesn't perform automated legal content validation."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Metadata establishes authenticity by providing a verifiable trail of the digital object's lifecycle, including its creator, modification history, and preservation actions. This chain of custody and integrity checks, documented through metadata, allows for the presumption of genuineness over time.",
        "distractor_analysis": "The first distractor assumes absolute immutability, which metadata doesn't guarantee. The second conflates metadata with storage technology. The third overstates metadata's role in automated legal validation.",
        "analogy": "Metadata for authenticity is like a passport for a person; it shows their origin, travel history, and any official endorsements, proving their identity and journey, rather than guaranteeing they've never changed their appearance."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "AUTHENTICITY_CYBERSECURITY",
        "METADATA_FUNDAMENTALS"
      ]
    },
    {
      "question_text": "The National Archives (NARA) developed a Digital Preservation Framework. What is a key benefit of this framework for managing electronic records?",
      "correct_answer": "It provides a matrix for file format risk analysis and preservation plans for various record categories.",
      "distractors": [
        {
          "text": "It mandates specific hardware and software for all federal digital archives.",
          "misconception": "Targets [scope of framework]: Frameworks provide guidance, not rigid mandates on specific technologies."
        },
        {
          "text": "It automates the process of digitizing analog records.",
          "misconception": "Targets [process confusion]: The framework focuses on preserving existing digital records, not digitizing analog ones."
        },
        {
          "text": "It guarantees the long-term preservation of all digital records indefinitely.",
          "misconception": "Targets [preservation certainty]: Preservation is an ongoing process with risks; frameworks guide management, not guarantee indefinite survival."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NARA's Digital Preservation Framework offers a structured approach to managing digital assets by providing tools like a file format risk analysis matrix and preservation plans for different record types. This helps institutions prioritize preservation efforts and make informed decisions, because understanding format risks is crucial for long-term accessibility.",
        "distractor_analysis": "The distractors incorrectly suggest the framework mandates specific hardware, automates digitization, or guarantees indefinite preservation, which are outside its scope as a guidance and planning tool.",
        "analogy": "NARA's Digital Preservation Framework is like a comprehensive guide for maintaining a historic building; it helps identify which parts are most at risk (e.g., roof, foundation), suggests repair strategies, and outlines ongoing maintenance, rather than dictating the exact construction materials or guaranteeing it will stand forever."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NARA_GUIDANCE",
        "DIGITAL_PRESERVATION_STRATEGIES"
      ]
    },
    {
      "question_text": "When transferring digital archival records, Library and Archives Canada (LAC) requires specific metadata. Which of the following metadata concepts is MANDATORY for ALL transfers of digital archival records to LAC?",
      "correct_answer": "Creator",
      "distractors": [
        {
          "text": "Extent",
          "misconception": "Targets [obligation level]: Extent is mandatory for transfers, but only where present for items and aggregations."
        },
        {
          "text": "Format",
          "misconception": "Targets [obligation level]: Format is mandatory for items, but not a universal requirement for all transfers of aggregations."
        },
        {
          "text": "Title",
          "misconception": "Targets [obligation level]: Title is mandatory for items, and where present for aggregations, but not universally for all transfers."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The 'Creator' metadata is mandatory for all transfers to LAC because it establishes the origin of the records, which is fundamental for understanding their context, custodial history, and authenticity. This information is essential for LAC's archival description and management processes.",
        "distractor_analysis": "While Extent, Format, and Title are important metadata concepts, they have specific conditions for being mandatory (e.g., for items, or where present). Creator is a foundational requirement for any transfer of digital archival records to LAC.",
        "analogy": "When donating items to a museum (like transferring records to LAC), knowing who originally owned or created the items ('Creator' metadata) is always essential for cataloging and understanding their provenance, regardless of the item's size, format, or title."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "LAC_METADATA_STANDARD",
        "ARCHIVAL_TRANSFER_PROCEDURES"
      ]
    },
    {
      "question_text": "What is the primary purpose of 'Rights management information' metadata in the context of digital archival records?",
      "correct_answer": "To indicate any restrictions on access, use, or reproduction of the record, including release conditions.",
      "distractors": [
        {
          "text": "To automatically enforce copyright protection through encryption.",
          "misconception": "Targets [metadata function vs. technical control]: Metadata describes rights; it doesn't enforce them via encryption."
        },
        {
          "text": "To detail the technical specifications required for rendering the record.",
          "misconception": "Targets [metadata category confusion]: This describes technical metadata, not rights management information."
        },
        {
          "text": "To provide a unique identifier for each digital archival record.",
          "misconception": "Targets [metadata category confusion]: This describes record identifiers, not rights management information."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Rights management information metadata is crucial because it communicates the legal and policy conditions governing the access, use, and reproduction of digital archival records. This ensures compliance with privacy laws, copyright, and other restrictions, thereby managing risk and facilitating appropriate access.",
        "distractor_analysis": "The distractors incorrectly associate rights management metadata with encryption enforcement, technical rendering specifications, or record identification, which are separate metadata functions.",
        "analogy": "Rights management metadata is like the 'terms and conditions' label on a software package; it tells you what you can and cannot do with it, rather than being the software's installation code or its serial number."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "DIGITAL_PRESERVATION_CONCEPTS",
        "METADATA_TYPES",
        "LEGAL_AND_REGULATORY_COMPLIANCE"
      ]
    },
    {
      "question_text": "According to Library and Archives Canada (LAC), what is the purpose of 'Classification code' metadata for digital archival records?",
      "correct_answer": "To provide understanding of the business context, hierarchical structure, and relationship to other records.",
      "distractors": [
        {
          "text": "To ensure the file format is compatible with LAC's preservation systems.",
          "misconception": "Targets [metadata purpose confusion]: This relates to format metadata, not classification code."
        },
        {
          "text": "To track the physical location and storage media of the digital object.",
          "misconception": "Targets [metadata purpose confusion]: This relates to administrative or technical metadata, not classification code."
        },
        {
          "text": "To automatically assign retention periods based on content analysis.",
          "misconception": "Targets [metadata purpose confusion]: Classification codes are derived from file plans; retention is determined by disposition authorities."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Classification code metadata, derived from a file plan, is essential because it contextualizes records within the creator's business activities and organizational structure. This hierarchical understanding supports appraisal, arrangement, and description, ensuring records are managed and accessed appropriately over their lifecycle.",
        "distractor_analysis": "The distractors misattribute functions related to file format compatibility, physical storage, and automated retention scheduling to the classification code metadata.",
        "analogy": "A 'Classification code' in archival metadata is like a library's subject heading and call number; it tells you what the book is about and where to find it within the larger collection, providing context and structure."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "LAC_METADATA_STANDARD",
        "RECORDS_MANAGEMENT_PRINCIPLES"
      ]
    },
    {
      "question_text": "When discussing digital preservation metadata, what is the significance of 'semantic units' as defined in the PREMIS data dictionary?",
      "correct_answer": "They represent the properties that describe digital objects, their contexts, or relationships, forming the basis for metadata elements.",
      "distractors": [
        {
          "text": "They are specific XML tags used for implementing metadata in a repository.",
          "misconception": "Targets [semantic unit vs. implementation]: Semantic units are conceptual; XML tags are implementation details."
        },
        {
          "text": "They are predefined preservation actions that must be applied to all digital objects.",
          "misconception": "Targets [semantic unit vs. action]: Semantic units describe properties, not prescriptive actions."
        },
        {
          "text": "They are algorithms used to calculate checksums for file integrity.",
          "misconception": "Targets [semantic unit vs. technical process]: Checksum algorithms are a technical implementation, not a conceptual semantic unit."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Semantic units in PREMIS are abstract concepts or properties that describe digital objects, agents, events, and rights. They provide a common vocabulary for preservation metadata, enabling consistent understanding and implementation through specific metadata elements, because this conceptual clarity is vital for interoperability.",
        "distractor_analysis": "The distractors confuse semantic units with concrete implementation details (XML tags), specific preservation actions, or technical processes (checksum algorithms).",
        "analogy": "In PREMIS, 'semantic units' are like the fundamental building blocks of a description (e.g., 'who,' 'what,' 'when,' 'why'), while 'metadata elements' are the specific words or phrases used to represent those blocks in a particular language or system."
      },
      "code_snippets": [],
      "difficulty": "expert",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PREMIS_STANDARD",
        "METADATA_CONCEPTS"
      ]
    },
    {
      "question_text": "A digital repository needs to ensure that its preserved digital objects remain accessible and understandable over the long term. Which type of metadata is MOST directly responsible for capturing the history of actions performed on a digital object, such as format migrations or integrity checks?",
      "correct_answer": "Administrative metadata (specifically, provenance and preservation event information)",
      "distractors": [
        {
          "text": "Descriptive metadata",
          "misconception": "Targets [metadata purpose]: Descriptive metadata focuses on content for discovery, not preservation history."
        },
        {
          "text": "Technical metadata",
          "misconception": "Targets [metadata purpose]: Technical metadata describes the object's format and rendering, not its management history."
        },
        {
          "text": "Structural metadata",
          "misconception": "Targets [metadata purpose]: Structural metadata defines relationships within an object, not its lifecycle actions."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Administrative metadata, particularly provenance and preservation event information, is essential because it documents the lifecycle of a digital object, including all actions taken to preserve it. This history is vital for verifying authenticity, understanding transformations, and ensuring long-term usability, as it provides the context for the object's current state.",
        "distractor_analysis": "Descriptive, technical, and structural metadata serve different primary purposes (discovery, rendering, internal relationships) and do not capture the detailed history of preservation actions as effectively as administrative metadata.",
        "analogy": "Administrative metadata for preservation actions is like a medical chart for a patient; it records every treatment, test, and procedure performed over time, providing a comprehensive history of care and changes."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "DIGITAL_PRESERVATION_CONCEPTS",
        "METADATA_TYPES"
      ]
    },
    {
      "question_text": "When implementing metadata for digital archival records, what is the significance of a 'metadata schema'?",
      "correct_answer": "It defines the rules for using and managing metadata elements, including their semantics, syntax, and obligation levels.",
      "distractors": [
        {
          "text": "It is a specific file format used to store metadata.",
          "misconception": "Targets [schema vs. format]: A schema is a framework/structure, not the storage format itself."
        },
        {
          "text": "It is a tool that automatically generates metadata from digital objects.",
          "misconception": "Targets [schema vs. tool]: Schemas define structure; tools perform generation based on schemas."
        },
        {
          "text": "It is a database where all archival metadata is stored.",
          "misconception": "Targets [schema vs. database]: A schema defines the structure of data within a database or file, not the database itself."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A metadata schema provides the structure and rules for metadata, defining how elements relate, their meaning (semantics), format (syntax), and whether they are required (obligation). This standardization is crucial for ensuring consistency, interoperability, and effective management of archival metadata.",
        "distractor_analysis": "The distractors confuse a schema with file formats, metadata generation tools, or databases, misrepresenting its role as a structural and rule-defining framework.",
        "analogy": "A metadata schema is like the architectural blueprint for a house; it defines the rooms (elements), their purpose (semantics), how they connect (syntax), and which ones are essential (obligation), but it's not the actual building materials or the construction crew."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "METADATA_FUNDAMENTALS",
        "METADATA_STANDARDS"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 15,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Archive Metadata Preservation Asset Security best practices",
    "latency_ms": 21677.519
  },
  "timestamp": "2026-01-01T16:02:49.762024"
}