{
  "topic_title": "Third-Party Data Sharing Documentation",
  "category": "Asset Security - 007_Data Security Controls",
  "flashcards": [
    {
      "question_text": "According to NIST SP 800-171 Rev. 3, what is a critical component of documenting information flow for Controlled Unclassified Information (CUI) when sharing with external systems?",
      "correct_answer": "Documenting interface characteristics, security requirements, and responsibilities for each system involved in the exchange.",
      "distractors": [
        {
          "text": "Assuming all external systems have equivalent security controls",
          "misconception": "Targets [assumption error]: Believes external systems automatically meet internal security standards without verification."
        },
        {
          "text": "Focusing solely on the volume of data being transferred",
          "misconception": "Targets [scope error]: Prioritizes data quantity over the security implications of the transfer itself."
        },
        {
          "text": "Relying on verbal agreements for data handling protocols",
          "misconception": "Targets [documentation deficiency]: Undervaluing formal, written agreements for critical data sharing."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NIST SP 800-171 Rev. 3 emphasizes documenting interface characteristics, security requirements, and responsibilities in exchange agreements because this ensures clarity and accountability for CUI protection during data sharing, preventing unauthorized disclosure.",
        "distractor_analysis": "The first distractor assumes security equivalence, the second focuses on quantity over security, and the third relies on informal agreements, all of which are insufficient for proper documentation.",
        "analogy": "It's like creating a detailed map and itinerary before a road trip with sensitive cargo, ensuring everyone knows the route, rules, and responsibilities."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "CUI_PROTECTION"
      ]
    },
    {
      "question_text": "What is the primary purpose of a System Security Plan (SSP) as described in NIST SP 800-171 Rev. 3, particularly concerning third-party data sharing?",
      "correct_answer": "To define the system boundary, identify information types, describe threats, outline security requirements, and detail safeguards for protecting CUI.",
      "distractors": [
        {
          "text": "To serve as a marketing document for the system's capabilities",
          "misconception": "Targets [purpose confusion]: Mistaking a security document for a sales brochure."
        },
        {
          "text": "To list all potential vendors for future procurement",
          "misconception": "Targets [scope error]: Confusing a system security document with a vendor management list."
        },
        {
          "text": "To provide a generic template for all organizational systems",
          "misconception": "Targets [tailoring deficiency]: Overlooking the need for specific, system-level details in an SSP."
        }
      ],
      "detailed_explanation": {
        "core_logic": "An SSP is crucial because it provides a comprehensive overview of how a system protects CUI, including its boundary, threats, and safeguards, which is essential for understanding risks associated with third-party data sharing.",
        "distractor_analysis": "The distractors misrepresent the SSP's function as marketing, vendor management, or a generic template, failing to recognize its role in detailing specific system security posture.",
        "analogy": "An SSP is like the detailed architectural blueprint for a secure building, showing all the security features, entry points, and protective measures."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "SYSTEM_SECURITY_PLAN"
      ]
    },
    {
      "question_text": "When documenting third-party data sharing agreements, why is it important to specify 'Organization-Defined Parameters' (ODPs) as per NIST SP 800-171 Rev. 3?",
      "correct_answer": "ODPs provide flexibility by allowing organizations to define specific values for security requirements based on their unique context, risk tolerance, and operational needs.",
      "distractors": [
        {
          "text": "To ensure all third parties use the exact same security configurations",
          "misconception": "Targets [flexibility misunderstanding]: Believing ODPs enforce standardization rather than customization."
        },
        {
          "text": "To delegate all security responsibility to the third party",
          "misconception": "Targets [responsibility error]: Misinterpreting ODPs as a way to abdicate organizational security duties."
        },
        {
          "text": "To create a standardized checklist for compliance audits",
          "misconception": "Targets [documentation purpose confusion]: Viewing ODPs as a compliance tool rather than a risk management mechanism."
        }
      ],
      "detailed_explanation": {
        "core_logic": "ODPs are vital because they allow organizations to tailor security requirements to their specific environment and risk appetite, ensuring that third-party data sharing documentation is relevant and effective, rather than a one-size-fits-all approach.",
        "distractor_analysis": "The distractors incorrectly suggest ODPs enforce standardization, delegate responsibility, or serve solely as a checklist, missing their role in risk-based customization.",
        "analogy": "ODPs are like customizable fields in a form – they allow you to fill in the specifics that are relevant to your situation, rather than using a generic template."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "ODP_CONCEPT"
      ]
    },
    {
      "question_text": "According to the FDIC's 'Interagency Guidance on Third-Party Relationships', why is it crucial for banking organizations to manage risks associated with third-party relationships, even when activities are outsourced?",
      "correct_answer": "A banking organization's use of third parties does not diminish its responsibility to operate in a safe and sound manner and comply with applicable laws and regulations.",
      "distractors": [
        {
          "text": "Outsourcing inherently reduces operational complexity and risk",
          "misconception": "Targets [outsourcing misconception]: Believing that outsourcing automatically simplifies operations and reduces risk."
        },
        {
          "text": "Third parties are solely responsible for any security breaches",
          "misconception": "Targets [liability confusion]: Misunderstanding that the primary organization retains ultimate responsibility."
        },
        {
          "text": "Regulatory bodies only monitor in-house operations",
          "misconception": "Targets [regulatory scope misunderstanding]: Believing regulators ignore third-party activities."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The FDIC guidance stresses that organizations remain accountable for their activities, regardless of outsourcing, because failure to manage third-party risks can lead to operational disruptions, compliance failures, and reputational damage.",
        "distractor_analysis": "The distractors present false assumptions about outsourcing reducing risk, shifting liability, and regulatory oversight, all of which contradict sound risk management principles.",
        "analogy": "It's like hiring a contractor to build a house; the contractor does the work, but the homeowner is ultimately responsible for ensuring it's built to code and safely."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "FDIC_THIRD_PARTY_GUIDANCE",
        "RISK_MANAGEMENT_PRINCIPLES"
      ]
    },
    {
      "question_text": "When documenting third-party data sharing, what does NIST SP 800-161 Rev. 1 (Cybersecurity 013_Supply Chain 002_Risk Management) suggest organizations should consider regarding the visibility into how acquired technology is developed?",
      "correct_answer": "Organizations should consider the processes, procedures, standards, and practices used to ensure the security, resilience, reliability, safety, integrity, and quality of the products and services.",
      "distractors": [
        {
          "text": "Focusing only on the final product's performance metrics",
          "misconception": "Targets [process oversight gap]: Overlooking the importance of the development lifecycle and its security implications."
        },
        {
          "text": "Assuming all suppliers adhere to industry-standard security practices",
          "misconception": "Targets [supplier trust assumption]: Relying on implicit trust rather than explicit verification of supplier security."
        },
        {
          "text": "Prioritizing cost-effectiveness over supply chain security",
          "misconception": "Targets [risk prioritization error]: Placing financial considerations above the security risks inherent in the supply chain."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NIST SP 800-161 Rev. 1 emphasizes understanding the development processes because this visibility is key to identifying and mitigating risks like malicious functionality or vulnerabilities introduced throughout the supply chain.",
        "distractor_analysis": "The distractors suggest focusing only on performance, assuming supplier security, or prioritizing cost, all of which neglect the critical need for understanding and managing supply chain security practices.",
        "analogy": "It's like inspecting the ingredients and cooking methods of a meal, not just tasting the final dish, to ensure it's safe and healthy."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_161_REV1",
        "CYBER_SUPPLY_CHAIN_RISK"
      ]
    },
    {
      "question_text": "In the context of third-party data sharing documentation, what is the significance of defining 'critical activities' as per the FDIC's Interagency Guidance?",
      "correct_answer": "Identifying critical activities helps banking organizations focus more comprehensive and rigorous oversight on third-party relationships that support these high-risk functions.",
      "distractors": [
        {
          "text": "Critical activities are those that generate the most revenue",
          "misconception": "Targets [business metric confusion]: Equating criticality with financial contribution rather than operational risk."
        },
        {
          "text": "All third-party activities are considered critical by default",
          "misconception": "Targets [scope overreach]: Applying a high level of scrutiny to all relationships, regardless of actual risk."
        },
        {
          "text": "Critical activities are solely determined by the third party",
          "misconception": "Targets [responsibility error]: Shifting the determination of criticality away from the banking organization."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Defining critical activities is essential because it allows organizations to prioritize their risk management efforts, focusing resources on third-party relationships that could cause significant harm if they fail, thereby ensuring operational resilience.",
        "distractor_analysis": "The distractors incorrectly link criticality to revenue, assume all activities are critical, or wrongly assign the determination to the third party, missing the risk-based prioritization aspect.",
        "analogy": "It's like a firefighter prioritizing which building to protect first based on its occupancy and fire risk, not just its size or value."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "FDIC_THIRD_PARTY_GUIDANCE",
        "CRITICAL_ACTIVITIES_IDENTIFICATION"
      ]
    },
    {
      "question_text": "When documenting third-party data sharing, what does NIST SP 800-171 Rev. 3 require regarding the protection of Controlled Unclassified Information (CUI) during transmission and storage?",
      "correct_answer": "Implement cryptographic mechanisms to prevent unauthorized disclosure of CUI during transmission and while in storage.",
      "distractors": [
        {
          "text": "Use only physical security measures for data at rest",
          "misconception": "Targets [security control gap]: Overlooking the need for encryption for data at rest."
        },
        {
          "text": "Rely on network firewalls to protect data in transit",
          "misconception": "Targets [transmission security gap]: Assuming firewalls alone are sufficient for protecting data in transit."
        },
        {
          "text": "Assume CUI is inherently protected by its classification level",
          "misconception": "Targets [misunderstanding of CUI protection]: Believing CUI status automatically implies robust encryption."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NIST SP 800-171 Rev. 3 mandates cryptographic protection because it provides a robust technical control to prevent unauthorized disclosure of CUI, addressing risks from both interception during transmission and unauthorized access to stored data.",
        "distractor_analysis": "The distractors suggest insufficient security measures like physical security only, reliance solely on firewalls, or an incorrect assumption about CUI classification providing inherent encryption.",
        "analogy": "It's like using a locked safe for valuables (storage) and a secure, armored car for transport, rather than just a regular car or leaving them on a doorstep."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "defense",
      "bloom_level": "apply",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "CRYPTOGRAPHY_BASICS",
        "CUI_PROTECTION"
      ]
    },
    {
      "question_text": "What is the primary goal of 'Information Flow Enforcement' as outlined in NIST SP 800-171 Rev. 3 when dealing with third-party data sharing?",
      "correct_answer": "To regulate where CUI can transit within a system and between connected systems, ensuring transfers adhere to the security policy.",
      "distractors": [
        {
          "text": "To control who has access to CUI",
          "misconception": "Targets [access control confusion]: Confusing information flow control with user access management."
        },
        {
          "text": "To limit the amount of data transferred",
          "misconception": "Targets [scope error]: Mistaking flow control for data volume management."
        },
        {
          "text": "To ensure data is encrypted during transfer",
          "misconception": "Targets [mechanism confusion]: Equating flow enforcement solely with encryption, rather than policy adherence."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Information Flow Enforcement is critical because it ensures that CUI moves only through approved paths and adheres to security policies, preventing unauthorized exfiltration or intermingling of sensitive data, thereby maintaining system integrity.",
        "distractor_analysis": "The distractors incorrectly equate flow enforcement with access control, data volume limits, or solely encryption, missing its core function of policy-based data transit regulation.",
        "analogy": "It's like directing traffic on specific, approved roads within a city, ensuring vehicles (data) only go where they are supposed to, not just anywhere."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "INFORMATION_FLOW_CONTROL"
      ]
    },
    {
      "question_text": "According to NIST SP 800-171 Rev. 3, what is the purpose of 'Least Privilege' in the context of third-party access to systems processing CUI?",
      "correct_answer": "To ensure users and processes are granted only the minimum necessary system authorizations and resources required to perform their assigned tasks.",
      "distractors": [
        {
          "text": "To grant all users the highest level of access for efficiency",
          "misconception": "Targets [principle reversal]: Confusing least privilege with maximum privilege for perceived efficiency."
        },
        {
          "text": "To restrict access only to administrative accounts",
          "misconception": "Targets [scope error]: Narrowing the application of least privilege only to administrators, not all users/processes."
        },
        {
          "text": "To allow access based on job title alone",
          "misconception": "Targets [oversimplification]: Relying on job titles without assessing actual task requirements for access."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Least Privilege is fundamental because it minimizes the potential damage from compromised accounts or insider threats by limiting the scope of actions an entity can perform, thereby reducing the attack surface and protecting CUI.",
        "distractor_analysis": "The distractors propose granting excessive access, limiting the principle incorrectly, or oversimplifying its application, all of which undermine the security benefits of least privilege.",
        "analogy": "It's like giving a temporary visitor only the key to the room they need to access, not the master key to the entire building."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "LEAST_PRIVILEGE_PRINCIPLE"
      ]
    },
    {
      "question_text": "When establishing third-party data sharing agreements, what is the role of 'Rules of Behavior' as defined in NIST SP 800-171 Rev. 3?",
      "correct_answer": "To outline the responsibilities and expected conduct of individuals regarding system usage and the protection of CUI.",
      "distractors": [
        {
          "text": "To detail the technical specifications of the data transfer protocols",
          "misconception": "Targets [documentation scope confusion]: Confusing user conduct rules with technical protocol specifications."
        },
        {
          "text": "To list all legal liabilities of the third-party vendor",
          "misconception": "Targets [legal vs. behavioral confusion]: Mistaking behavioral guidelines for a comprehensive legal liability document."
        },
        {
          "text": "To define the system's network architecture",
          "misconception": "Targets [documentation purpose confusion]: Confusing user conduct rules with system architecture documentation."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Rules of Behavior are essential because they establish clear expectations for user conduct and CUI protection, ensuring that all parties understand their responsibilities and promoting a security-conscious culture, which is vital for third-party data sharing.",
        "distractor_analysis": "The distractors mischaracterize Rules of Behavior as technical specifications, legal liability documents, or network architecture descriptions, failing to recognize their focus on user conduct.",
        "analogy": "It's like a code of conduct for employees in an office, outlining expected behavior regarding confidentiality and system use."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "RULES_OF_BEHAVIOR"
      ]
    },
    {
      "question_text": "In the context of third-party data sharing, what is the primary concern addressed by NIST SP 800-161 Rev. 1 regarding 'Cybersecurity 013_Supply Chain 002_Risk Management'?",
      "correct_answer": "The risks associated with products and services that may contain malicious functionality, are counterfeit, or are vulnerable due to poor manufacturing and development practices.",
      "distractors": [
        {
          "text": "The cost of acquiring new technology",
          "misconception": "Targets [risk prioritization error]: Focusing on cost rather than the security implications of the supply chain."
        },
        {
          "text": "The speed at which new technologies are released",
          "misconception": "Targets [scope error]: Confusing the pace of innovation with inherent supply chain security risks."
        },
        {
          "text": "The marketing claims made by technology vendors",
          "misconception": "Targets [misplaced focus]: Prioritizing vendor marketing over the actual security posture of their products and processes."
        }
      ],
      "detailed_explanation": {
        "core_logic": "C-SCRM is critical because it addresses the inherent risks in the supply chain, such as compromised components or vulnerabilities, which can undermine the security of acquired systems and services, impacting the organization's overall security posture.",
        "distractor_analysis": "The distractors focus on cost, release speed, or marketing, which are secondary concerns compared to the fundamental risks of compromised or vulnerable components within the supply chain.",
        "analogy": "It's like vetting the reputation and practices of a food supplier, not just the price of their ingredients, to ensure the final product is safe."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_161_REV1",
        "CYBER_SUPPLY_CHAIN_RISK"
      ]
    },
    {
      "question_text": "According to NIST SP 800-171 Rev. 3, what is the purpose of 'Access Enforcement' in relation to third-party data sharing?",
      "correct_answer": "To ensure that approved authorizations for logical access to CUI and system resources are strictly followed.",
      "distractors": [
        {
          "text": "To automatically grant access to all users",
          "misconception": "Targets [access control reversal]: Confusing enforcement with automatic granting of access."
        },
        {
          "text": "To log all access attempts, successful or not",
          "misconception": "Targets [function confusion]: Mistaking enforcement for logging, which is a related but distinct control."
        },
        {
          "text": "To define who is allowed to access the system",
          "misconception": "Targets [definition vs. enforcement confusion]: Confusing the definition of access rights with the enforcement of those rights."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Access Enforcement is vital because it ensures that the defined access control policies are actively applied, preventing unauthorized access to CUI and system resources, thereby maintaining confidentiality and integrity.",
        "distractor_analysis": "The distractors suggest automatic access, focusing solely on logging, or confusing definition with enforcement, all of which fail to capture the active application of access policies.",
        "analogy": "It's like a security guard at a venue checking tickets (authorizations) at the entrance to ensure only ticket holders (authorized users) get in."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "ACCESS_CONTROL_PRINCIPLES"
      ]
    },
    {
      "question_text": "When documenting third-party data sharing, what is the significance of 'Information Exchange Security Agreements' as mentioned in NIST SP 800-171 Rev. 3?",
      "correct_answer": "They formally define interface characteristics, security requirements, and responsibilities for exchanging CUI between the system and other systems.",
      "distractors": [
        {
          "text": "They are optional documents used only for low-risk data transfers",
          "misconception": "Targets [risk assessment error]: Underestimating the importance of formal agreements for all CUI exchanges."
        },
        {
          "text": "They primarily focus on the legal jurisdiction of data processing",
          "misconception": "Targets [scope error]: Overemphasizing legal jurisdiction while neglecting technical and operational security aspects."
        },
        {
          "text": "They are automatically generated by network monitoring tools",
          "misconception": "Targets [automation misconception]: Believing these agreements are created automatically rather than through deliberate documentation."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Information Exchange Security Agreements are crucial because they formalize the security parameters of data transfers, ensuring that both parties understand and agree upon the necessary controls and responsibilities for protecting CUI during exchange.",
        "distractor_analysis": "The distractors incorrectly suggest these agreements are optional, narrowly focused on legal aspects, or automatically generated, missing their role in defining comprehensive security protocols for data exchange.",
        "analogy": "It's like a detailed contract for shipping valuable goods, specifying packaging, route, security checks, and liability for each party involved."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "INFORMATION_EXCHANGE_SECURITY"
      ]
    },
    {
      "question_text": "According to NIST SP 800-171 Rev. 3, what is the purpose of 'System Monitoring' in the context of third-party data sharing?",
      "correct_answer": "To detect attacks, unauthorized connections, and unusual or unauthorized activities related to inbound and outbound communications traffic.",
      "distractors": [
        {
          "text": "To track the total amount of data transferred by third parties",
          "misconception": "Targets [monitoring scope error]: Confusing system monitoring with data transfer volume tracking."
        },
        {
          "text": "To automatically optimize network performance",
          "misconception": "Targets [function confusion]: Mistaking security monitoring for network performance optimization."
        },
        {
          "text": "To verify the third party's compliance with contractual terms",
          "misconception": "Targets [oversight scope error]: Confusing system security monitoring with contract compliance verification."
        }
      ],
      "detailed_explanation": {
        "core_logic": "System Monitoring is essential because it provides visibility into network traffic and system activities, enabling the detection of security threats and unauthorized actions that could compromise CUI during third-party data sharing.",
        "distractor_analysis": "The distractors incorrectly focus on data volume, network optimization, or contract compliance, failing to recognize system monitoring's primary role in detecting security threats and unauthorized activities.",
        "analogy": "It's like having security cameras and alarms around a facility to detect unauthorized entry or suspicious activity, not just counting how many people enter."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "defense",
      "bloom_level": "apply",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "SYSTEM_MONITORING_PRINCIPLES"
      ]
    },
    {
      "question_text": "When documenting third-party data sharing, what is the best practice for 'Media Sanitization' as per NIST SP 800-171 Rev. 3?",
      "correct_answer": "Sanitize system media containing CUI before disposal, release out of organizational control, or release for reuse.",
      "distractors": [
        {
          "text": "Simply delete files containing CUI",
          "misconception": "Targets [sanitization deficiency]: Believing simple deletion is sufficient to remove CUI from media."
        },
        {
          "text": "Physically destroy all media after use",
          "misconception": "Targets [overly broad approach]: Suggesting destruction for all media, ignoring options for secure reuse or cryptographic erasure."
        },
        {
          "text": "Store all used media in a locked cabinet indefinitely",
          "misconception": "Targets [storage vs. sanitization confusion]: Confusing secure storage with the process of rendering data unrecoverable."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Media sanitization is critical because it ensures that CUI is rendered unrecoverable from media before it leaves organizational control, preventing potential data breaches and unauthorized disclosure of sensitive information.",
        "distractor_analysis": "The distractors suggest insufficient methods like simple deletion, overly destructive methods like physical destruction for all media, or confusing storage with sanitization, all failing to meet the requirement for secure data removal.",
        "analogy": "It's like shredding sensitive documents before throwing them away, or securely wiping a hard drive before donating or selling it, rather than just throwing them in the trash."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "NIST_SP_800_171_REV3",
        "MEDIA_SANITIZATION_PRACTICES"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 15,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Third-Party Data Sharing Documentation Asset Security best practices",
    "latency_ms": 24422.578999999998
  },
  "timestamp": "2026-01-01T16:33:46.977966"
}