{
  "topic_title": "Export Control Regulations (EAR, ITAR)",
  "category": "Security Architecture And Engineering - Cryptographic Solutions",
  "flashcards": [
    {
      "question_text": "What is the primary purpose of the Export Administration Regulations (EAR)?",
      "correct_answer": "To regulate the export and reexport of most commercial items, including dual-use items, from the United States.",
      "distractors": [
        {
          "text": "To control the export of defense-related articles and services.",
          "misconception": "Targets [scope confusion]: Confuses EAR with ITAR's primary focus on defense articles."
        },
        {
          "text": "To manage international trade agreements and tariffs.",
          "misconception": "Targets [domain confusion]: Misunderstands EAR's role as export control, not trade policy."
        },
        {
          "text": "To ensure the security of U.S. government classified information.",
          "misconception": "Targets [jurisdictional error]: EAR applies to commercial items, not solely classified government data."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The EAR governs the export of dual-use items (civilian and military applications) because they can be used for both peaceful and military purposes, impacting national security and foreign policy.",
        "distractor_analysis": "The distractors misrepresent the EAR's scope by confusing it with ITAR, trade policy, or internal government security protocols.",
        "analogy": "Think of the EAR as a gatekeeper for commercial goods leaving the U.S., ensuring they don't fall into the wrong hands or support undesirable activities."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EXPORT_CONTROL_BASICS"
      ]
    },
    {
      "question_text": "Which U.S. government agency is primarily responsible for administering the Export Administration Regulations (EAR)?",
      "correct_answer": "The Bureau of Industry and Security (BIS) within the Department of Commerce.",
      "distractors": [
        {
          "text": "The Department of State, Directorate of Defense Trade Controls (DDTC).",
          "misconception": "Targets [agency confusion]: DDTC administers ITAR, not EAR."
        },
        {
          "text": "The Department of Homeland Security (DHS).",
          "misconception": "Targets [jurisdictional overlap confusion]: DHS focuses on border security and enforcement, not primary EAR administration."
        },
        {
          "text": "The Department of the Treasury, Office of Foreign Assets Control (OFAC).",
          "misconception": "Targets [functional confusion]: OFAC manages economic sanctions, not general export controls under EAR."
        }
      ],
      "detailed_explanation": {
        "core_logic": "BIS is tasked with administering the EAR to protect U.S. national security and foreign policy interests by controlling exports of dual-use items, because these items can have both civilian and military applications.",
        "distractor_analysis": "Each distractor names a relevant government agency but assigns it the wrong regulatory responsibility concerning export controls.",
        "analogy": "BIS is like the customs agent for commercial goods, deciding what can and cannot leave the country under specific rules."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EXPORT_CONTROL_BASICS"
      ]
    },
    {
      "question_text": "What is the primary focus of the International Traffic in Arms Regulations (ITAR)?",
      "correct_answer": "To control the export and import of defense articles and defense services.",
      "distractors": [
        {
          "text": "To regulate the export of commercial encryption software.",
          "misconception": "Targets [scope confusion]: Encryption software export is primarily governed by EAR, not ITAR."
        },
        {
          "text": "To manage the import of dual-use technology into the United States.",
          "misconception": "Targets [directionality error]: ITAR focuses on exports/imports of defense items, not general dual-use imports."
        },
        {
          "text": "To oversee international agreements for scientific research collaboration.",
          "misconception": "Targets [functional misattribution]: ITAR is about defense trade, not general scientific collaboration agreements."
        }
      ],
      "detailed_explanation": {
        "core_logic": "ITAR controls defense articles and services because their proliferation could undermine U.S. national security and foreign policy objectives, therefore requiring strict oversight.",
        "distractor_analysis": "Distractors incorrectly associate ITAR with commercial encryption, dual-use imports, or general scientific collaboration, missing its defense-specific mandate.",
        "analogy": "ITAR is like a strict security clearance for military-grade equipment and services, ensuring they are only shared with trusted allies and partners."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EXPORT_CONTROL_BASICS"
      ]
    },
    {
      "question_text": "Under the EAR, what is the significance of the Commerce Control List (CCL)?",
      "correct_answer": "It categorizes items subject to the EAR and specifies the licensing requirements for their export.",
      "distractors": [
        {
          "text": "It lists all items that are exempt from export controls.",
          "misconception": "Targets [scope inversion]: The CCL lists controlled items, not exemptions."
        },
        {
          "text": "It defines 'defense articles' and 'defense services' for ITAR.",
          "misconception": "Targets [regulatory confusion]: The CCL is part of EAR; ITAR has its own USML."
        },
        {
          "text": "It outlines the procedures for applying for export licenses.",
          "misconception": "Targets [procedural misattribution]: While related, the CCL itself doesn't detail application procedures; other EAR parts do."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The CCL is crucial because it provides the specific Export Control Classification Numbers (ECCNs) that determine whether an item requires a license for export, since licensing requirements are based on the item's classification and destination.",
        "distractor_analysis": "Distractors incorrectly describe the CCL as a list of exemptions, an ITAR component, or a procedural guide, rather than its actual function of classifying controlled items.",
        "analogy": "The CCL is like a catalog that assigns a code to each item, and that code tells you whether you need special permission to send it abroad."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EAR_BASICS",
        "CCL_OVERVIEW"
      ]
    },
    {
      "question_text": "Which of the following scenarios would MOST likely require an export license under the EAR?",
      "correct_answer": "Exporting advanced cryptographic software to a country subject to specific U.S. sanctions.",
      "distractors": [
        {
          "text": "Exporting a standard laptop computer to Canada.",
          "misconception": "Targets [licensing exemption confusion]: Exports to Canada for many commercial items are generally license-free under EAR."
        },
        {
          "text": "Exporting publicly available technical data about basic scientific research to the UK.",
          "misconception": "Targets [fundamental research exemption]: Publicly available information on fundamental research is often exempt from EAR controls."
        },
        {
          "text": "Exporting a commercial off-the-shelf (COTS) software to a U.S. subsidiary in Germany.",
          "misconception": "Targets [intra-company transfer clarification]: Exports to U.S. subsidiaries in many countries may not require a license, depending on the item and destination."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Exporting advanced cryptographic software to a sanctioned country is highly likely to require a license because such exports are restricted due to national security and foreign policy concerns, necessitating explicit government authorization.",
        "distractor_analysis": "The distractors describe common export scenarios that are typically license-free or have simplified procedures, contrasting with the high-risk scenario requiring a license.",
        "analogy": "Sending a sensitive package to a country with strict import rules and a history of issues requires special documentation and permission, unlike sending a postcard to a friendly neighbor."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": [
        "EAR_LICENSING_REQUIREMENTS",
        "SANCTIONS_POLICY"
      ]
    },
    {
      "question_text": "What is the purpose of License Exception ENC (Encryption) under the EAR?",
      "correct_answer": "To authorize exports of certain encryption items to most destinations without a license, subject to reporting requirements.",
      "distractors": [
        {
          "text": "To require a license for all exports of encryption items, regardless of destination.",
          "misconception": "Targets [unknown]: Not specified"
        },
        {
          "text": "To control only the export of hardware-based encryption modules.",
          "misconception": "Targets [scope limitation]: ENC covers both hardware and software encryption items."
        },
        {
          "text": "To prohibit exports of encryption items to countries with strong privacy laws.",
          "misconception": "Targets [policy misinterpretation]: ENC generally facilitates, rather than prohibits, exports to most countries, including those with strong privacy laws."
        }
      ],
      "detailed_explanation": {
        "core_logic": "License Exception ENC facilitates the global availability of encryption products by allowing exports to most destinations without a license, because strong encryption is seen as vital for global commerce and security, provided reporting obligations are met.",
        "distractor_analysis": "Distractors incorrectly state that ENC requires a license for all items, limits its scope to hardware, or prohibits exports based on destination privacy laws.",
        "analogy": "License Exception ENC is like a fast-track pass for certain types of encryption technology, allowing it to move more freely across borders, provided you follow the rules."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EAR_LICENSE_EXCEPTIONS",
        "ENCRYPTION_CONTROLS"
      ]
    },
    {
      "question_text": "What is a 'deemed export' under the EAR?",
      "correct_answer": "The release of technology or source code to a foreign national within the United States that is subject to the EAR.",
      "distractors": [
        {
          "text": "The export of items to a foreign country that is later reexported.",
          "misconception": "Targets [definition confusion]: This describes a reexport, not a deemed export."
        },
        {
          "text": "The transfer of technology between different U.S. government agencies.",
          "misconception": "Targets [jurisdictional scope]: Deemed exports specifically concern foreign nationals, not inter-agency transfers."
        },
        {
          "text": "The sale of U.S.-origin goods to a foreign buyer outside the U.S.",
          "misconception": "Targets [location error]: Deemed exports occur within the U.S., not abroad."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A 'deemed export' occurs when technology or source code is released to a foreign national within the U.S. because this release is treated as an export to the person's home country, since the U.S. government seeks to control the proliferation of sensitive technologies.",
        "distractor_analysis": "The distractors confuse 'deemed export' with reexports, internal government transfers, or standard exports, failing to grasp the core concept of releasing controlled information to foreign nationals domestically.",
        "analogy": "Imagine sharing a secret recipe with someone who isn't a citizen, even within your own kitchen; the government treats that sharing as if you sent the recipe overseas."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "DEEMED_EXPORT_CONCEPT"
      ]
    },
    {
      "question_text": "Which of the following is a key consideration when determining if an item is subject to ITAR?",
      "correct_answer": "Whether the item is specifically designed, developed, adapted, or modified for a military application.",
      "distractors": [
        {
          "text": "Whether the item is commercially available off-the-shelf (COTS).",
          "misconception": "Targets [commercial availability misapplication]: COTS items can still be ITAR-controlled if designed for military use."
        },
        {
          "text": "Whether the item is manufactured in the United States.",
          "misconception": "Targets [origin vs. design confusion]: While U.S. origin is key, the design/purpose is the primary ITAR determinant."
        },
        {
          "text": "Whether the item is exported to a NATO member country.",
          "misconception": "Targets [destination vs. item confusion]: Destination matters for licensing, but the item's classification as a defense article is primary for ITAR jurisdiction."
        }
      ],
      "detailed_explanation": {
        "core_logic": "An item is subject to ITAR if it is listed on the U.S. Munitions List (USML) or is specifically designed, developed, adapted, or modified for military systems, because ITAR's purpose is to control the export of defense technology that could impact national security.",
        "distractor_analysis": "Distractors focus on factors like commercial availability, manufacturing origin, or destination, which are secondary or irrelevant to the primary ITAR jurisdictional trigger: military design or purpose.",
        "analogy": "ITAR is like a special permit for weapons or military equipment; the key question is 'Was this built for war?', not just 'Is it for sale?' or 'Where is it going?'."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "ITAR_BASICS",
        "USML_OVERVIEW"
      ]
    },
    {
      "question_text": "What is the role of the U.S. Munitions List (USML) in relation to ITAR?",
      "correct_answer": "The USML enumerates defense articles and defense services that are controlled under ITAR.",
      "distractors": [
        {
          "text": "The USML lists items controlled under the EAR.",
          "misconception": "Targets [regulatory confusion]: The USML is for ITAR; the CCL is for EAR."
        },
        {
          "text": "The USML provides exemptions for exporting defense items to allies.",
          "misconception": "Targets [exemption misrepresentation]: The USML lists controlled items; exemptions are found elsewhere in ITAR."
        },
        {
          "text": "The USML dictates the licensing procedures for all defense exports.",
          "misconception": "Targets [procedural misattribution]: The USML identifies items; ITAR parts 123-126 detail licensing procedures."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The USML serves as the definitive list of defense articles and services controlled by ITAR because it precisely defines what falls under U.S. jurisdiction for defense trade, thereby establishing the scope of the regulations.",
        "distractor_analysis": "Distractors incorrectly link the USML to EAR, misrepresent its function as providing exemptions, or confuse it with procedural guidance for licensing.",
        "analogy": "The USML is the official 'menu' of military items that are strictly regulated for export; you can't export what's not on this list, and what is on it requires special permission."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "ITAR_BASICS",
        "USML_OVERVIEW"
      ]
    },
    {
      "question_text": "What is the 'fundamental research' exclusion under the EAR?",
      "correct_answer": "It exempts from EAR licensing requirements certain 'technology' or 'software' resulting from basic or applied research in science or engineering conducted at accredited U.S. institutions.",
      "distractors": [
        {
          "text": "It exempts all research and development activities conducted by U.S. companies.",
          "misconception": "Targets [overly broad interpretation]: The exemption is specific to fundamental research at accredited institutions, not all R&D."
        },
        {
          "text": "It allows the export of any technology that is publicly available.",
          "misconception": "Targets [scope confusion]: While public availability is a factor, the exemption is tied to the nature of the research and the institution."
        },
        {
          "text": "It applies only to research funded by the U.S. government.",
          "misconception": "Targets [funding source misattribution]: The exemption is based on the nature of the research and institution, not solely government funding."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The fundamental research exclusion is crucial because it allows for the free dissemination of basic scientific knowledge, fostering innovation and collaboration, since such research is generally considered not to pose a direct national security risk.",
        "distractor_analysis": "Distractors incorrectly broaden the scope of the exemption to all R&D, equate it solely with public availability, or wrongly tie it to government funding.",
        "analogy": "It's like saying that general scientific discoveries shared at a public conference are freely available, unlike specific blueprints for a new weapon system."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EAR_BASICS",
        "FUNDAMENTAL_RESEARCH_EXCLUSION"
      ]
    },
    {
      "question_text": "What is the 'Know Your Customer' (KYC) guidance under the EAR designed to prevent?",
      "correct_answer": "The diversion of controlled items to unauthorized end-users or end-uses, particularly those involved in WMD proliferation or terrorism.",
      "distractors": [
        {
          "text": "The circumvention of customs duties and import taxes.",
          "misconception": "Targets [customs vs. export control confusion]: KYC is about export control compliance, not customs duties."
        },
        {
          "text": "The unauthorized disclosure of proprietary business information.",
          "misconception": "Targets [confidentiality vs. proliferation confusion]: KYC focuses on preventing illicit end-uses, not protecting business secrets."
        },
        {
          "text": "The violation of intellectual property rights during international transactions.",
          "misconception": "Targets [IP vs. export control confusion]: KYC addresses export control risks, not IP infringement."
        }
      ],
      "detailed_explanation": {
        "core_logic": "KYC guidance is essential because it empowers exporters to identify and avoid transactions that could inadvertently support WMD proliferation or other national security threats, thereby fulfilling their due diligence obligations under the EAR.",
        "distractor_analysis": "Distractors misrepresent KYC's purpose by associating it with customs, business confidentiality, or intellectual property, rather than its core function of preventing illicit end-use or diversion.",
        "analogy": "KYC is like a background check for international business partners, ensuring you're not unknowingly supplying materials to someone who will misuse them."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "defense",
      "bloom_level": "apply",
      "prerequisites": [
        "EAR_COMPLIANCE",
        "KYC_PRINCIPLES"
      ]
    },
    {
      "question_text": "What is the primary difference in jurisdiction between EAR and ITAR?",
      "correct_answer": "EAR controls commercial items and dual-use items, while ITAR controls defense articles and services.",
      "distractors": [
        {
          "text": "EAR controls items exported from the U.S., while ITAR controls items exported from other countries.",
          "misconception": "Targets [geographic scope confusion]: Both EAR and ITAR primarily control U.S. exports, though ITAR also covers imports."
        },
        {
          "text": "EAR controls software and technology, while ITAR controls hardware.",
          "misconception": "Targets [item type confusion]: Both regulations can control software, hardware, and technology, depending on their nature and purpose."
        },
        {
          "text": "EAR is administered by the Department of Commerce, while ITAR is administered by the Department of Defense.",
          "misconception": "Targets [agency administration confusion]: EAR is BIS (Commerce); ITAR is DDTC (State)."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The distinction is critical because EAR and ITAR have different scopes and objectives: EAR manages items with potential military applications but primarily commercial use, while ITAR strictly controls items designed for military purposes to protect national security.",
        "distractor_analysis": "Distractors incorrectly differentiate based on geography, item type, or administering agency, missing the fundamental distinction between commercial/dual-use (EAR) and defense-specific (ITAR) items.",
        "analogy": "EAR is like the general export license for most goods, while ITAR is like a special, highly restricted permit specifically for weapons and military technology."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "EAR_BASICS",
        "ITAR_BASICS"
      ]
    },
    {
      "question_text": "What is the purpose of the 'de minimis' rule in the EAR?",
      "correct_answer": "To determine if foreign-made goods containing U.S.-origin content are subject to the EAR.",
      "distractors": [
        {
          "text": "To exempt U.S.-made goods from export controls if they contain foreign components.",
          "misconception": "Targets [rule inversion]: The rule applies to foreign goods with U.S. content, not vice-versa."
        },
        {
          "text": "To calculate the customs duties on imported goods.",
          "misconception": "Targets [customs vs. export control confusion]: The de minimis rule is for export control jurisdiction, not customs duties."
        },
        {
          "text": "To define 'fundamental research' for academic institutions.",
          "misconception": "Targets [concept misattribution]: The de minimis rule relates to U.S. content in foreign goods, not research definitions."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The de minimis rule is important because it clarifies when foreign-made items incorporating U.S.-origin content are still subject to the EAR, based on the percentage of U.S. content, thereby preventing circumvention of U.S. export controls.",
        "distractor_analysis": "Distractors misapply the rule to U.S. goods, confuse it with customs, or associate it with unrelated concepts like fundamental research.",
        "analogy": "It's like a 'taint' rule: if a foreign product has too much of a U.S. ingredient, it's still considered partly 'American' for export control purposes."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EAR_BASICS",
        "DE_MINIMIS_RULE"
      ]
    },
    {
      "question_text": "Under ITAR, what is the significance of an item being listed on the U.S. Munitions List (USML)?",
      "correct_answer": "It means the item is considered a defense article or service, and its export is strictly controlled by ITAR.",
      "distractors": [
        {
          "text": "It means the item is exempt from export controls.",
          "misconception": "Targets [exemption misrepresentation]: USML listing signifies control, not exemption."
        },
        {
          "text": "It means the item is subject to the EAR, not ITAR.",
          "misconception": "Targets [regulatory confusion]: USML items are ITAR-controlled, not EAR-controlled."
        },
        {
          "text": "It means the item can be exported freely to any country.",
          "misconception": "Targets [unrestricted export misconception]: USML items require strict licensing and are often prohibited from export to certain destinations."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Listing on the USML is definitive because it establishes an item's classification as a defense article or service, thereby triggering ITAR's stringent export control requirements to safeguard national security.",
        "distractor_analysis": "Distractors incorrectly suggest USML items are exempt, fall under EAR, or can be exported freely, all contradicting the strict control nature of the USML.",
        "analogy": "Being on the USML is like having a 'military-grade' stamp that requires a special, high-security clearance to move internationally."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "ITAR_BASICS",
        "USML_OVERVIEW"
      ]
    },
    {
      "question_text": "What is the purpose of the 'End-User and End-Use' controls under the EAR (Part 744)?",
      "correct_answer": "To restrict exports, reexports, and transfers of items when they are destined for specific prohibited end-users or end-uses, regardless of the item's classification.",
      "distractors": [
        {
          "text": "To ensure that all exported items are used for their declared commercial purposes.",
          "misconception": "Targets [scope limitation]: Controls extend beyond commercial use to include WMD proliferation, nuclear, missile, and other national security concerns."
        },
        {
          "text": "To track the serial numbers of all exported items for inventory purposes.",
          "misconception": "Targets [tracking vs. control confusion]: The focus is on preventing illicit use, not general inventory tracking."
        },
        {
          "text": "To verify that the exporter has obtained all necessary import permits from the destination country.",
          "misconception": "Targets [exporter vs. importer responsibility]: While end-user verification is key, the focus is on the end-user's activities, not solely on the exporter obtaining import permits."
        }
      ],
      "detailed_explanation": {
        "core_logic": "End-user and end-use controls are vital because they prevent controlled items from being diverted to unauthorized or dangerous applications (like WMD programs) by imposing restrictions based on the recipient and intended use, thereby protecting national security.",
        "distractor_analysis": "Distractors misinterpret the controls as solely for declared commercial use, inventory tracking, or import permit verification, missing the critical focus on preventing proliferation and national security risks.",
        "analogy": "It's like a background check for who you're selling to and what they'll do with the product; even if the product itself is legal to sell, the buyer or their intended use might be prohibited."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "EAR_END_USER_CONTROLS",
        "END_USE_CONTROLS"
      ]
    },
    {
      "question_text": "What is the role of the 'Entity List' in the EAR?",
      "correct_answer": "It identifies specific foreign entities that have been determined to be acting contrary to the national security or foreign policy interests of the United States, requiring licenses for exports to them.",
      "distractors": [
        {
          "text": "It lists companies that have voluntarily disclosed export control violations.",
          "misconception": "Targets [disclosure vs. restriction confusion]: The Entity List identifies entities subject to restrictions, not those who self-disclosed."
        },
        {
          "text": "It provides a list of approved 'Validated End Users' (VEUs) for simplified exports.",
          "misconception": "Targets [list inversion]: The Entity List imposes restrictions; VEUs facilitate exports."
        },
        {
          "text": "It categorizes items based on their potential for dual-use applications.",
          "misconception": "Targets [item vs. entity confusion]: The Entity List targets specific organizations, not general item classifications."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The Entity List is a critical tool because it allows BIS to impose specific licensing requirements on listed entities, thereby preventing the diversion of controlled items to sensitive end-uses or end-users that threaten U.S. national security or foreign policy.",
        "distractor_analysis": "Distractors misrepresent the Entity List as a list of voluntary disclosers, approved users, or item categories, failing to recognize its function as a restriction list for specific entities.",
        "analogy": "The Entity List is like a 'do not deal with' list for export controls; if an organization is on it, you need special permission to export anything to them."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "EAR_ENTITY_LIST",
        "EXPORT_CONTROL_COMPLIANCE"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 16,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Export Control Regulations (EAR, ITAR) Security Architecture And Engineering best practices",
    "latency_ms": 22226.947
  },
  "timestamp": "2026-01-01T14:18:50.435744"
}