{
  "topic_title": "Certificate Replacement Procedures",
  "category": "001_Cryptography - 009_Public Key Infrastructure (PKI)",
  "flashcards": [
    {
      "question_text": "According to the CA/Browser Forum's Baseline Requirements, what is the maximum validity period for a publicly trusted TLS Server Certificate?",
      "correct_answer": "398 days (13 months)",
      "distractors": [
        {
          "text": "2 years",
          "misconception": "Targets [outdated standards]: Students who recall older, longer validity periods before recent security tightening."
        },
        {
          "text": "1 year",
          "misconception": "Targets [common but incorrect period]: Students who assume a standard year is sufficient without knowing the specific BR limit."
        },
        {
          "text": "Until revoked",
          "misconception": "Targets [misunderstanding of validity vs revocation]: Students who confuse the certificate's lifespan with its active status."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The CA/Browser Forum mandates a maximum validity period of 398 days for TLS Server Certificates to enhance security. This shorter lifespan reduces the window of opportunity for compromised keys or certificates to be exploited, aligning with best practices for key pair usage periods.",
        "distractor_analysis": "Older standards allowed longer periods, making '2 years' a plausible but incorrect distractor. '1 year' is a common assumption but not the specific limit. 'Until revoked' confuses lifespan with active status.",
        "analogy": "Think of it like a driver's license. While it might be valid for several years, shorter-term permits (like a temporary event pass) are issued for specific, limited durations to ensure ongoing verification and control."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_TLS_CERTIFICATES"
      ]
    },
    {
      "question_text": "What is the primary purpose of a Certificate Revocation List (CRL) in Public Key Infrastructure (PKI)?",
      "correct_answer": "To inform relying parties about certificates that are no longer valid before their scheduled expiration date.",
      "distractors": [
        {
          "text": "To list all certificates that have been issued by a Certificate Authority (CA).",
          "misconception": "Targets [scope confusion]: Students who confuse revocation lists with certificate transparency logs or CA directories."
        },
        {
          "text": "To provide a secure method for encrypting sensitive data.",
          "misconception": "Targets [function confusion]: Students who mix up the purpose of CRLs with encryption algorithms or protocols."
        },
        {
          "text": "To authenticate the identity of the Certificate Authority itself.",
          "misconception": "Targets [entity confusion]: Students who think CRLs are used for CA authentication rather than subscriber certificate status."
        }
      ],
      "detailed_explanation": {
        "core_logic": "CRLs serve as a mechanism for Certificate Authorities (CAs) to publish lists of certificates that have been invalidated prior to their expiry date. This allows relying parties to check the status of a certificate and avoid trusting compromised or revoked credentials.",
        "distractor_analysis": "The first distractor describes a directory, not revocation. The second confuses CRLs with encryption. The third misattributes the purpose of CRLs, which are for subscriber certificates, not CA authentication.",
        "analogy": "A CRL is like a 'do not admit' list at an event. It contains names of people whose passes have been cancelled, preventing them from entering even if their original invitation (certificate) is still technically valid."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_REVOCATION"
      ]
    },
    {
      "question_text": "When replacing a server's TLS certificate due to a compromised private key, what is the most critical immediate action after generating a new key pair?",
      "correct_answer": "Request a new certificate from the Certificate Authority (CA) using the new public key.",
      "distractors": [
        {
          "text": "Immediately deploy the new certificate to all servers.",
          "misconception": "Targets [procedural error]: Students who skip the crucial step of obtaining a new, validated certificate."
        },
        {
          "text": "Update the Certificate Revocation List (CRL) with the old certificate's details.",
          "misconception": "Targets [misplaced action]: Students who focus on revoking the old certificate before installing the new one."
        },
        {
          "text": "Continue using the old certificate until the new one is fully propagated.",
          "misconception": "Targets [risk acceptance]: Students who underestimate the immediate risk posed by a compromised key."
        }
      ],
      "detailed_explanation": {
        "core_logic": "When a private key is compromised, the associated certificate is also considered compromised. The immediate priority is to generate a new, secure key pair and then obtain a new certificate from the CA, binding the new public key to the server's identity.",
        "distractor_analysis": "Deploying without a new certificate is insecure. Updating the CRL is a necessary step but not the *immediate* action after key generation. Continuing to use the compromised certificate is a critical security failure.",
        "analogy": "If your house key is lost (compromised private key), you don't just make a copy of the old lock (deploy old cert). You get a new lock and a new key (new key pair and certificate) and then inform the landlord (CA) about the change."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_KEY_COMPROMISE",
        "PKI_CERTIFICATE_AUTHORITY"
      ]
    },
    {
      "question_text": "What is the role of a Certificate Signing Request (CSR) in the certificate replacement process?",
      "correct_answer": "It's a digitally encoded message sent to a Certificate Authority (CA) containing the public key and identifying information for a new certificate.",
      "distractors": [
        {
          "text": "It's a request to revoke an existing certificate.",
          "misconception": "Targets [function confusion]: Students who confuse CSRs with Certificate Revocation Requests (CRRs)."
        },
        {
          "text": "It's a confirmation that a certificate has been successfully renewed.",
          "misconception": "Targets [timing confusion]: Students who believe CSRs are used after renewal, not before issuance."
        },
        {
          "text": "It's a mechanism for securely transferring a private key to a new server.",
          "misconception": "Targets [security protocol confusion]: Students who misunderstand that private keys should never be transmitted."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A Certificate Signing Request (CSR) is a standardized block of data that includes the public key and identifying information (like the Common Name, organization, etc.) of the entity requesting a certificate. The CA uses this CSR to issue a new, signed certificate, effectively replacing an old one.",
        "distractor_analysis": "CSRs are for *issuance*, not revocation. They are generated *before* renewal/replacement, not after. Crucially, CSRs contain the public key, not the private key, which must remain secret.",
        "analogy": "A CSR is like filling out an application form for a new passport. You provide your details and a recent photo (public key), and the government (CA) uses this to issue your new passport (certificate)."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_CSR"
      ]
    },
    {
      "question_text": "Which of the following best describes the difference between certificate renewal and re-keying?",
      "correct_answer": "Renewal typically involves extending the validity of an existing certificate with the same key pair, while re-keying involves generating a new key pair and obtaining a new certificate.",
      "distractors": [
        {
          "text": "Renewal is for symmetric keys, while re-keying is for asymmetric keys.",
          "misconception": "Targets [key type confusion]: Students who incorrectly associate renewal/re-keying with specific key types."
        },
        {
          "text": "Renewal is performed by the user, while re-keying is performed by the CA.",
          "misconception": "Targets [role confusion]: Students who misunderstand who performs these actions."
        },
        {
          "text": "Renewal replaces the certificate entirely, while re-keying only updates the expiration date.",
          "misconception": "Targets [process reversal]: Students who reverse the actions involved in renewal and re-keying."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Certificate renewal often means extending the validity period of an existing certificate without changing the associated key pair. Re-keying, however, is a more significant process that involves generating a new cryptographic key pair and obtaining a completely new certificate signed by the CA.",
        "distractor_analysis": "Both renewal and re-keying apply to asymmetric keys used in PKI. Both processes involve user actions and CA involvement. The core difference lies in whether the key pair changes.",
        "analogy": "Renewal is like extending the lease on an apartment you're happy with, keeping the same address. Re-keying is like moving to a new apartment and getting a new address and new keys."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_KEY_PAIRS"
      ]
    },
    {
      "question_text": "What is the significance of the 'Common Name' (CN) field in a TLS certificate during the replacement process?",
      "correct_answer": "It must match the Fully Qualified Domain Name (FQDN) of the server the certificate is intended for, and must be correctly specified in the new certificate request.",
      "distractors": [
        {
          "text": "It is automatically updated by the Certificate Authority (CA) during replacement.",
          "misconception": "Targets [automation misconception]: Students who believe CAs automatically correct identifying fields."
        },
        {
          "text": "It can be any descriptive name, as the Subject Alternative Name (SAN) is the primary identifier.",
          "misconception": "Targets [field priority confusion]: Students who underestimate the CN's importance, especially in older systems, or misjudge SAN's role."
        },
        {
          "text": "It is only relevant for internal PKI and not for public TLS certificates.",
          "misconception": "Targets [scope confusion]: Students who believe CN is irrelevant for publicly trusted certificates."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The Common Name (CN) field in a certificate historically served as the primary identifier for the domain name. While Subject Alternative Names (SANs) are now preferred and often required by modern browsers, the CN must still accurately match the FQDN for compatibility and security, especially during replacement.",
        "distractor_analysis": "CAs do not automatically update CNs; the request must be accurate. While SAN is crucial, CN remains important for many systems. CN is vital for public TLS certificates, not just internal PKI.",
        "analogy": "The CN is like the primary street address on a package label. Even if there's a secondary delivery instruction (SAN), the main address must be correct for the package to reach the right destination."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_TLS_CERTIFICATES",
        "PKI_IDENTIFIERS"
      ]
    },
    {
      "question_text": "Why is it important to manage certificate expiration dates proactively and plan for replacement?",
      "correct_answer": "To prevent service disruptions caused by expired certificates, which can lead to connection failures and security warnings for users.",
      "distractors": [
        {
          "text": "To ensure compliance with CA/Browser Forum Baseline Requirements.",
          "misconception": "Targets [compliance vs. consequence]: Students who focus only on rules rather than the direct impact of non-compliance."
        },
        {
          "text": "To avoid the costs associated with emergency certificate issuance.",
          "misconception": "Targets [financial focus over security]: Students who prioritize cost savings over immediate security and availability."
        },
        {
          "text": "To maintain a consistent cryptographic algorithm across all issued certificates.",
          "misconception": "Targets [unrelated goal]: Students who confuse expiration management with algorithm standardization."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Proactive certificate replacement is crucial because expired certificates cause services to become inaccessible or trigger severe security warnings, eroding user trust and potentially halting business operations. Planning ensures a smooth transition, maintaining availability and security.",
        "distractor_analysis": "While compliance is a factor, the primary driver is preventing service disruption. Avoiding emergency costs is a benefit, but not the core security reason. Algorithm consistency is a separate management concern.",
        "analogy": "It's like regularly changing the oil in your car. Doing it proactively prevents engine failure (service disruption) and avoids costly emergency repairs (emergency issuance)."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_CERTIFICATE_LIFECYCLE"
      ]
    },
    {
      "question_text": "What is the purpose of the Subject Alternative Name (SAN) extension in modern TLS certificates, especially during replacement?",
      "correct_answer": "It allows a single certificate to secure multiple domain names, hostnames, or IP addresses, providing flexibility beyond the Common Name (CN).",
      "distractors": [
        {
          "text": "It is used exclusively for internal network names and is ignored by public browsers.",
          "misconception": "Targets [scope confusion]: Students who misunderstand SAN's applicability to public certificates."
        },
        {
          "text": "It replaces the need for a Certificate Signing Request (CSR) entirely.",
          "misconception": "Targets [process confusion]: Students who believe SAN negates the need for a CSR."
        },
        {
          "text": "It is a deprecated field that should not be used in new certificates.",
          "misconception": "Targets [outdated information]: Students who are unaware of SAN's current importance and prevalence."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The SAN extension is critical because it enables a single certificate to cover multiple identities (like www.example.com, mail.example.com, and an IP address). During replacement, ensuring all required SANs are correctly listed is vital for securing all associated services.",
        "distractor_analysis": "SANs are essential for public TLS certificates and are actively used by browsers. They do not replace the CSR process but are part of the information within it. SAN is a modern, required extension, not deprecated.",
        "analogy": "SANs are like having multiple mailboxes associated with one house address. A single certificate (house address) can cover various services (mailboxes) like 'www.domain.com', 'mail.domain.com', and 'ftp.domain.com'."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_TLS_CERTIFICATES",
        "PKI_IDENTIFIERS"
      ]
    },
    {
      "question_text": "When a Certificate Authority (CA) revokes a certificate, what mechanism is typically used to inform relying parties about the revocation status?",
      "correct_answer": "Certificate Revocation Lists (CRLs) or Online Certificate Status Protocol (OCSP) responses.",
      "distractors": [
        {
          "text": "Email notifications sent directly to the certificate subscriber.",
          "misconception": "Targets [communication channel confusion]: Students who think revocation status is communicated directly to the end-user via email."
        },
        {
          "text": "A public ledger updated on a blockchain.",
          "misconception": "Targets [technology confusion]: Students who incorrectly associate certificate revocation with blockchain technology."
        },
        {
          "text": "HTTP redirects to a 'certificate invalid' page.",
          "misconception": "Targets [protocol confusion]: Students who confuse revocation checking with web redirection mechanisms."
        }
      ],
      "detailed_explanation": {
        "core_logic": "CAs use standardized protocols like CRLs (lists of revoked certificates) or OCSP (real-time status checks) to communicate revocation information. These mechanisms allow relying parties' software to query the CA or a designated responder to verify a certificate's validity before trusting it.",
        "distractor_analysis": "Email is not a scalable or secure method for revocation status. While blockchain has security applications, it's not the standard for CRL/OCSP. HTTP redirects are for web navigation, not cryptographic status checks.",
        "analogy": "Checking if a credit card is valid involves either looking it up on a list (CRL) or calling the bank for immediate confirmation (OCSP), not receiving an email or being redirected."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_REVOCATION",
        "PKI_OCSP"
      ]
    },
    {
      "question_text": "What is the primary security risk associated with failing to replace an expired TLS certificate promptly?",
      "correct_answer": "Users' browsers will display security warnings, potentially deterring them from accessing the site, and the connection will be unencrypted.",
      "distractors": [
        {
          "text": "The server's private key will be automatically exposed to attackers.",
          "misconception": "Targets [mechanism confusion]: Students who believe expiration directly leads to private key compromise."
        },
        {
          "text": "The Certificate Authority (CA) will be fined by regulatory bodies.",
          "misconception": "Targets [consequence focus]: Students who focus on CA penalties rather than user/service impact."
        },
        {
          "text": "The website's search engine ranking will be permanently lowered.",
          "misconception": "Targets [secondary effect confusion]: Students who confuse security impact with SEO consequences."
        }
      ],
      "detailed_explanation": {
        "core_logic": "When a TLS certificate expires, the cryptographic trust chain is broken. Browsers will warn users of an insecure connection, preventing access and potentially leading to data interception. The private key itself doesn't expire or become exposed due to certificate expiration, but the secure channel it enables ceases to function.",
        "distractor_analysis": "Private key compromise is a separate issue from certificate expiration. While CAs may have policies regarding expiration, direct fines are not the primary user-facing risk. SEO impact is a secondary consequence, not the core security risk.",
        "analogy": "An expired driver's license doesn't mean your driving skills vanish, but you'll be stopped by police (browser warning) and unable to legally drive (access the site)."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_TLS_CERTIFICATES",
        "PKI_CERTIFICATE_LIFECYCLE"
      ]
    },
    {
      "question_text": "In the context of certificate replacement, what does 'key archival' refer to?",
      "correct_answer": "The secure storage of private keys, often encrypted, for backup or recovery purposes, typically managed by a trusted third party or secure system.",
      "distractors": [
        {
          "text": "The process of encrypting the certificate itself for secure transmission.",
          "misconception": "Targets [scope confusion]: Students who confuse key archival with certificate encryption."
        },
        {
          "text": "The automatic deletion of old private keys after a new certificate is issued.",
          "misconception": "Targets [process reversal]: Students who believe old keys are deleted rather than archived."
        },
        {
          "text": "The public logging of all private keys used by an organization.",
          "misconception": "Targets [security principle violation]: Students who misunderstand that private keys must remain confidential."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Key archival is a security practice where private keys are securely stored, often encrypted with a master key, to allow for recovery if the original key is lost or if historical data needs to be decrypted. This is distinct from transmitting or publicly logging keys.",
        "distractor_analysis": "Archival is about secure storage, not transmission encryption. It involves saving keys, not deleting them. Public logging of private keys would be a catastrophic security failure.",
        "analogy": "Key archival is like securely storing copies of important documents in a fireproof safe, so you can retrieve them if the originals are lost or damaged."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PKI_KEY_PAIRS",
        "PKI_SECURITY_PRACTICES"
      ]
    },
    {
      "question_text": "What is the primary difference between a certificate renewal and a certificate re-issuance?",
      "correct_answer": "Renewal typically extends the validity of an existing certificate with the same key pair, while re-issuance involves generating a new certificate, potentially with a new key pair, often due to changes in information or a need for a fresh start.",
      "distractors": [
        {
          "text": "Renewal is for internal certificates, while re-issuance is for public certificates.",
          "misconception": "Targets [scope confusion]: Students who incorrectly differentiate based on certificate type."
        },
        {
          "text": "Renewal involves updating the CA's root certificate, while re-issuance involves updating the server's certificate.",
          "misconception": "Targets [entity confusion]: Students who confuse the roles of CA and subscriber certificates."
        },
        {
          "text": "Renewal is a fully automated process, while re-issuance requires manual intervention.",
          "misconception": "Targets [process automation misconception]: Students who assume one is always automated and the other manual."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Renewal generally implies extending the life of a certificate using the same key pair and information. Re-issuance is broader; it means obtaining a new certificate, which might be necessary if details change (like domain name), the key pair is compromised (requiring re-keying), or simply to start fresh with updated parameters.",
        "distractor_analysis": "Both renewal and re-issuance apply to both internal and public certificates. The distinction isn't about CA vs. server certificates but about the continuity of the key pair and information. Automation levels can vary for both processes.",
        "analogy": "Renewal is like renewing your driver's license with the same photo and information. Re-issuance is like getting a new license because your name changed or you lost the old one, potentially requiring new photos and updated details."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_CERTIFICATE_LIFECYCLE"
      ]
    },
    {
      "question_text": "According to RFC 5280, what is a critical requirement for a Certificate Revocation List (CRL) distribution point?",
      "correct_answer": "The CRL Distribution Point (CRLDP) extension must specify a URL or other location where the CRL can be accessed by relying parties.",
      "distractors": [
        {
          "text": "The CRLDP must be hosted on the same server as the certificate.",
          "misconception": "Targets [deployment confusion]: Students who assume the CRL must co-locate with the certificate."
        },
        {
          "text": "The CRLDP must use the FTP protocol for maximum security.",
          "misconception": "Targets [protocol misconception]: Students who incorrectly assume FTP is the most secure protocol for distribution."
        },
        {
          "text": "The CRLDP information is optional and not required by RFC 5280.",
          "misconception": "Targets [standard ignorance]: Students who are unaware of the mandatory nature of CRLDP in RFC 5280."
        }
      ],
      "detailed_explanation": {
        "core_logic": "RFC 5280 mandates the CRL Distribution Point (CRLDP) extension within a certificate to provide a clear location (typically a URL) where relying parties can retrieve the relevant CRL. This ensures that revocation status can be checked effectively, maintaining the integrity of the PKI trust model.",
        "distractor_analysis": "CRLDPs can be hosted independently for scalability and availability. FTP is generally not considered secure for this purpose compared to HTTP/HTTPS. The CRLDP extension is a defined and required part of certificate profiles under RFC 5280.",
        "analogy": "The CRLDP is like the return address on a package, telling you where to check if the recipient's 'access pass' (certificate) has been cancelled."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_REVOCATION",
        "RFC_5280"
      ]
    },
    {
      "question_text": "What is the primary function of the Online Certificate Status Protocol (OCSP) in relation to certificate replacement and validity?",
      "correct_answer": "To provide real-time, granular status information about a specific certificate's validity, rather than relying on periodic CRL updates.",
      "distractors": [
        {
          "text": "To securely transfer the private key from the old certificate to the new one.",
          "misconception": "Targets [security protocol confusion]: Students who confuse OCSP with key exchange mechanisms."
        },
        {
          "text": "To automatically renew certificates without user intervention.",
          "misconception": "Targets [automation misconception]: Students who believe OCSP handles automated renewal."
        },
        {
          "text": "To encrypt the communication channel between the client and the server.",
          "misconception": "Targets [function confusion]: Students who mix up OCSP with TLS/SSL encryption itself."
        }
      ],
      "detailed_explanation": {
        "core_logic": "OCSP allows a client to query an OCSP responder (operated by the CA) for the current status of a specific certificate. This provides more immediate feedback than CRLs, which can be delayed, and is crucial for verifying certificate validity during and after replacement processes.",
        "distractor_analysis": "OCSP is for status checking, not key transfer. It doesn't automate renewal; that's a separate process. OCSP verifies the certificate used for encryption, but it does not perform the encryption itself.",
        "analogy": "OCSP is like asking a security guard at a specific door if a particular person's ID is currently valid, whereas a CRL is like checking a list of all invalid IDs posted at the entrance."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_REVOCATION",
        "PKI_OCSP"
      ]
    },
    {
      "question_text": "When replacing a certificate due to a change in organizational name or structure, what is the most appropriate action regarding the certificate lifecycle?",
      "correct_answer": "Initiate a re-issuance process, which involves generating a new Certificate Signing Request (CSR) with updated organizational details and obtaining a new certificate.",
      "distractors": [
        {
          "text": "Simply renew the existing certificate and update the information manually.",
          "misconception": "Targets [procedural error]: Students who believe manual updates suffice for significant organizational changes."
        },
        {
          "text": "Request a 'name change' endorsement on the current certificate.",
          "misconception": "Targets [misunderstanding of certificate modification]: Students who think certificates can be easily modified post-issuance."
        },
        {
          "text": "Wait for the current certificate to expire and then apply for a new one.",
          "misconception": "Targets [timing error]: Students who delay necessary actions until expiration, potentially causing disruption."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Significant changes to identifying information like the organization's name require a new certificate to maintain accuracy and trust. This necessitates a re-issuance, starting with a new CSR reflecting the updated details, followed by CA validation and issuance of a fresh certificate.",
        "distractor_analysis": "Certificates are generally immutable after issuance; manual updates are not standard. Endorsements are not a typical mechanism for changing core organizational identity in PKI. Waiting for expiration would mean operating with outdated information.",
        "analogy": "If your legal name changes, you don't just 'update' your old driver's license; you apply for a new one with the correct, current information."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "PKI_CERTIFICATES",
        "PKI_CSR",
        "PKI_CERTIFICATE_LIFECYCLE"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 15,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Certificate Replacement Procedures 001_Cryptography best practices",
    "latency_ms": 22322.596
  },
  "timestamp": "2026-01-18T16:06:52.782113"
}