{
  "topic_title": "Security maturity assessment",
  "category": "008_Application Security - Secure Software Development Lifecycle",
  "flashcards": [
    {
      "question_text": "Which framework provides a structured approach to assessing and improving an organization's software security posture through measurable capabilities?",
      "correct_answer": "OWASP Software Assurance Maturity Model (SAMM)",
      "distractors": [
        {
          "text": "NIST Special Publication 800-53",
          "misconception": "Targets [scope confusion]: Confuses a control catalog with a maturity model framework."
        },
        {
          "text": "ISO 27001",
          "misconception": "Targets [domain confusion]: Mistaking an information security management system standard for an application security maturity model."
        },
        {
          "text": "Secure Software Development Framework (SSDF)",
          "misconception": "Targets [purpose confusion]: Views SSDF as a maturity model rather than a set of secure development practices."
        }
      ],
      "detailed_explanation": {
        "core_logic": "OWASP SAMM is specifically designed as a maturity model to assess and improve software security practices, providing a measurable framework. It functions by defining business functions and security practices that can be assessed for maturity levels.",
        "distractor_analysis": "NIST SP 800-53 is a control catalog, ISO 27001 is an ISMS standard, and SSDF is a set of practices, none of which are primarily maturity models like SAMM.",
        "analogy": "Think of OWASP SAMM as a fitness tracker for your software security program, measuring progress and identifying areas for improvement, unlike a simple list of exercises (NIST SP 800-53) or a gym membership (ISO 27001)."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "OWASP_SAMM_FUNDAMENTALS"
      ]
    },
    {
      "question_text": "According to NIST SP 800-37 Rev. 2, what is a primary benefit of integrating security and privacy into the System Development Life Cycle (SDLC)?",
      "correct_answer": "Ensures security and privacy are addressed throughout the system's life cycle, reducing late-stage remediation costs.",
      "distractors": [
        {
          "text": "Allows for complete security testing only after development is finished.",
          "misconception": "Targets [timing error]: Believes security is a post-development activity, contrary to integrated SDLC."
        },
        {
          "text": "Reduces the need for continuous monitoring post-deployment.",
          "misconception": "Targets [scope confusion]: Security integration in SDLC supports, not replaces, continuous monitoring."
        },
        {
          "text": "Focuses solely on compliance with regulatory requirements.",
          "misconception": "Targets [purpose limitation]: Overlooks risk management and vulnerability reduction as core benefits."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NIST SP 800-37 Rev. 2 emphasizes incorporating security and privacy into the SDLC to manage risk effectively. This approach works by identifying and mitigating vulnerabilities early, therefore reducing the cost and complexity of fixing issues later in the life cycle.",
        "distractor_analysis": "The distractors incorrectly suggest security is a late-stage activity, that it negates continuous monitoring, or is solely about compliance, missing the core benefit of proactive risk management.",
        "analogy": "Integrating security into the SDLC is like building a house with strong foundations and fire-resistant materials from the start, rather than trying to add security features after it's built, which is much more expensive and less effective."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_37_RMF",
        "SECURE_SDLC_BASICS"
      ]
    },
    {
      "question_text": "What is the primary goal of the Secure Software Development Framework (SSDF) as outlined in NIST SP 800-218?",
      "correct_answer": "To provide a core set of practices that can be integrated into any SDLC to reduce software vulnerabilities.",
      "distractors": [
        {
          "text": "To mandate specific security controls for all software development.",
          "misconception": "Targets [scope confusion]: Confuses a framework of practices with a prescriptive control catalog."
        },
        {
          "text": "To define a maturity model for assessing software development security.",
          "misconception": "Targets [model confusion]: Mistaking SSDF for a maturity assessment tool like OWASP SAMM."
        },
        {
          "text": "To establish a certification process for secure software.",
          "misconception": "Targets [purpose confusion]: SSDF focuses on development practices, not formal certification."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NIST SP 800-218's SSDF provides a set of high-level practices to be integrated into SDLCs, aiming to reduce vulnerabilities. It works by establishing a common vocabulary and set of recommended practices for secure software development.",
        "distractor_analysis": "The distractors misrepresent SSDF as a control catalog, a maturity model, or a certification scheme, rather than a framework for integrating secure development practices.",
        "analogy": "NIST SSDF is like a recipe book for baking secure software, offering fundamental techniques and ingredients that can be adapted to various baking styles (SDLCs), rather than a specific oven certification or a grading rubric."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_218_SSDF",
        "SECURE_SDLC_PRACTICES"
      ]
    },
    {
      "question_text": "In the context of security maturity assessments, what does a 'foundational' maturity level typically indicate?",
      "correct_answer": "Basic, ad-hoc security practices are in place, often reactive and inconsistently applied.",
      "distractors": [
        {
          "text": "Security practices are fully automated and integrated into all processes.",
          "misconception": "Targets [level confusion]: Describes an optimized or managed level, not foundational."
        },
        {
          "text": "Security is a strategic priority with defined metrics and continuous improvement.",
          "misconception": "Targets [level confusion]: Represents a higher maturity level (e.g., managed or optimized)."
        },
        {
          "text": "Security practices are documented, standardized, and consistently followed.",
          "misconception": "Targets [level confusion]: Describes a defined or managed level, not foundational."
        }
      ],
      "detailed_explanation": {
        "core_logic": "A foundational maturity level signifies the initial stage where security activities are often performed on an as-needed basis, lacking formal processes. It works by establishing the most basic security functions, which are typically reactive and inconsistent.",
        "distractor_analysis": "The distractors describe characteristics of higher maturity levels (optimized, managed, defined), not the basic, ad-hoc nature of foundational security.",
        "analogy": "A foundational security maturity level is like a beginner cook who follows simple recipes occasionally, sometimes forgetting ingredients, rather than a professional chef with a meticulously organized kitchen and standardized procedures."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "MATURITY_MODEL_CONCEPTS"
      ]
    },
    {
      "question_text": "Which aspect of security maturity assessment focuses on the ability to consistently and effectively execute security practices across the organization?",
      "correct_answer": "Repeatability",
      "distractors": [
        {
          "text": "Ad-hoc execution",
          "misconception": "Targets [opposite concept]: Describes a lack of consistency, characteristic of lower maturity."
        },
        {
          "text": "Initial implementation",
          "misconception": "Targets [stage confusion]: Refers to the beginning phase, not consistent execution."
        },
        {
          "text": "Strategic alignment",
          "misconception": "Targets [different dimension]: Relates to how security supports business goals, not consistency of practice."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Repeatability in maturity models signifies that security practices can be performed consistently and reliably over time and across different teams or projects. This is crucial because it ensures that security is not dependent on individual heroic efforts but is a standard part of operations.",
        "distractor_analysis": "Ad-hoc execution is the opposite of repeatability. Initial implementation is a starting point, not sustained execution. Strategic alignment is about purpose, not consistency of execution.",
        "analogy": "Repeatability in security maturity is like a factory assembly line where every product is made the same way every time, ensuring quality, unlike a craftsperson making unique items each time."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "MATURITY_MODEL_DIMENSIONS"
      ]
    },
    {
      "question_text": "When assessing application security maturity, what does the 'Define' stage in many models (like SAMM) typically involve?",
      "correct_answer": "Establishing policies, standards, and guidelines for secure software development.",
      "distractors": [
        {
          "text": "Implementing automated security testing tools.",
          "misconception": "Targets [stage confusion]: This falls under 'Implement' or 'Measure' stages."
        },
        {
          "text": "Conducting penetration testing on deployed applications.",
          "misconception": "Targets [stage confusion]: This is typically part of 'Assess' or 'Respond' phases."
        },
        {
          "text": "Responding to security incidents after they occur.",
          "misconception": "Targets [stage confusion]: This is a reactive measure, not part of the proactive 'Define' stage."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The 'Define' stage in maturity models like OWASP SAMM focuses on establishing the foundational rules and blueprints for secure development. It works by creating policies and standards that guide subsequent implementation and assessment activities.",
        "distractor_analysis": "The distractors describe activities belonging to later stages (Implement, Assess, Respond) rather than the proactive definition phase.",
        "analogy": "The 'Define' stage is like writing the architectural blueprints and building codes before constructing a house, ensuring everyone knows the rules and standards to follow."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "OWASP_SAMM_MODEL",
        "SECURE_SDLC_POLICY"
      ]
    },
    {
      "question_text": "Which of the following best describes the 'Measure' capability in the OWASP SAMM framework?",
      "correct_answer": "Collecting data and metrics to understand the current state of software security practices.",
      "distractors": [
        {
          "text": "Implementing new security controls based on findings.",
          "misconception": "Targets [stage confusion]: This is part of the 'Improve' or 'Respond' phases."
        },
        {
          "text": "Defining the security policies and standards for the organization.",
          "misconception": "Targets [stage confusion]: This belongs to the 'Define' phase."
        },
        {
          "text": "Conducting security awareness training for developers.",
          "misconception": "Targets [stage confusion]: This is an implementation activity, not primarily measurement."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The 'Measure' capability in OWASP SAMM focuses on gathering data to assess the maturity of security practices. It works by establishing metrics and collection methods, providing insights needed for improvement.",
        "distractor_analysis": "The distractors describe activities related to implementing, defining, or responding to security issues, rather than the core function of measurement and data collection.",
        "analogy": "The 'Measure' capability is like taking a diagnostic test to understand your current health status before starting a fitness program, rather than starting the workout or planning the diet."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "OWASP_SAMM_MEASURE",
        "SECURITY_METRICS"
      ]
    },
    {
      "question_text": "What is a key challenge when performing a security maturity assessment for application security?",
      "correct_answer": "Subjectivity in scoring and interpretation of maturity levels.",
      "distractors": [
        {
          "text": "Lack of available security tools.",
          "misconception": "Targets [resource availability]: While tools help, the core challenge is often interpretation, not just availability."
        },
        {
          "text": "Over-reliance on automated compliance checks.",
          "misconception": "Targets [methodology error]: Maturity assessment requires more than just automated compliance."
        },
        {
          "text": "Difficulty in defining 'secure' software.",
          "misconception": "Targets [scope definition]: While challenging, maturity models focus on *practices* for security, not defining 'secure' itself."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Maturity assessments often involve qualitative judgments, leading to subjectivity in scoring. This works by requiring interpretation of practices against defined criteria, which can vary between assessors.",
        "distractor_analysis": "While tools and compliance are relevant, the primary challenge in maturity assessment is the inherent subjectivity in evaluating practices and assigning scores.",
        "analogy": "Assessing security maturity can be like grading an essay: while there are rubrics, the final grade often depends on the grader's interpretation, making it subjective."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "MATURITY_ASSESSMENT_CHALLENGES"
      ]
    },
    {
      "question_text": "How does NIST SP 800-53A Rev. 5 support security maturity assessments?",
      "correct_answer": "It provides procedures for assessing the effectiveness of security and privacy controls, which can inform maturity levels.",
      "distractors": [
        {
          "text": "It defines the maturity levels for secure software development.",
          "misconception": "Targets [scope confusion]: SP 800-53A focuses on control assessment, not defining maturity levels themselves."
        },
        {
          "text": "It offers a framework for measuring the business impact of security vulnerabilities.",
          "misconception": "Targets [purpose confusion]: While related, its primary focus is control assessment, not business impact quantification."
        },
        {
          "text": "It mandates specific secure coding practices for all applications.",
          "misconception": "Targets [control vs. practice confusion]: SP 800-53A assesses controls, not mandating specific coding practices like SSDF."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NIST SP 800-53A Rev. 5 provides methodologies and procedures for assessing security and privacy controls. This assessment data can be used as input to understand the effectiveness of implemented security measures, thereby informing an organization's security maturity.",
        "distractor_analysis": "SP 800-53A does not define maturity levels, quantify business impact directly, or mandate specific coding practices; its role is in assessing control effectiveness.",
        "analogy": "NIST SP 800-53A is like a detailed inspection checklist for a building's safety systems (e.g., fire alarms, sprinklers), helping to verify they work, which contributes to the overall assessment of the building's safety maturity."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_53A",
        "SECURITY_CONTROL_ASSESSMENT"
      ]
    },
    {
      "question_text": "Which of the following is a key benefit of using a maturity model like OWASP SAMM for application security?",
      "correct_answer": "Provides a roadmap for incremental improvement and prioritization of security efforts.",
      "distractors": [
        {
          "text": "Guarantees complete elimination of all software vulnerabilities.",
          "misconception": "Targets [overstated benefit]: Maturity models aim for improvement, not absolute elimination."
        },
        {
          "text": "Replaces the need for traditional security testing methods.",
          "misconception": "Targets [scope confusion]: Maturity models complement, not replace, other security practices."
        },
        {
          "text": "Ensures immediate compliance with all global regulations.",
          "misconception": "Targets [compliance confusion]: Maturity is about capability, not direct compliance with specific regulations."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Maturity models like OWASP SAMM provide a structured way to assess current capabilities and identify gaps, thereby enabling organizations to prioritize and plan incremental improvements. They work by offering a defined path from lower to higher maturity levels.",
        "distractor_analysis": "The distractors promise unrealistic outcomes like guaranteed vulnerability elimination, replacement of essential testing, or automatic compliance, which are beyond the scope of a maturity model.",
        "analogy": "Using OWASP SAMM is like using a GPS navigation system for a long road trip: it shows you where you are, suggests the best route, and helps you prioritize stops, rather than magically teleporting you to your destination or replacing your car."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "OWASP_SAMM_BENEFITS",
        "CONTINUOUS_IMPROVEMENT"
      ]
    },
    {
      "question_text": "What is the relationship between NIST SP 800-37 (RMF) and security maturity assessment in application security?",
      "correct_answer": "The Risk Management Framework (RMF) provides a process for managing security risk, and maturity assessments can help evaluate the effectiveness of RMF implementation.",
      "distractors": [
        {
          "text": "NIST SP 800-37 is a maturity model specifically for application security.",
          "misconception": "Targets [model confusion]: RMF is a risk management process, not an application security maturity model."
        },
        {
          "text": "Security maturity assessments are a required step within the NIST RMF.",
          "misconception": "Targets [process integration error]: While complementary, maturity assessment is not a mandatory RMF step."
        },
        {
          "text": "NIST SP 800-37 directly measures the maturity of secure development practices.",
          "misconception": "Targets [measurement confusion]: RMF focuses on risk management outcomes, not direct measurement of development maturity."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The NIST Risk Management Framework (RMF) provides a structured process for managing security and privacy risks throughout a system's life cycle. Security maturity assessments can be used to evaluate how effectively the controls and processes mandated by the RMF are being implemented and operated.",
        "distractor_analysis": "The distractors incorrectly define RMF as a maturity model, claim maturity assessment is a mandatory RMF step, or state RMF directly measures development maturity, misrepresenting their relationship.",
        "analogy": "NIST RMF is like the overall safety regulations for a construction site, ensuring risks are managed. A maturity assessment is like an independent audit checking how well the construction company is actually following those safety regulations and improving their practices."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_37_RMF",
        "SECURITY_MATURITY_CONCEPTS"
      ]
    },
    {
      "question_text": "Consider an organization where security testing is performed only after development is complete, and findings are addressed reactively. What maturity level does this likely represent for secure SDLC practices?",
      "correct_answer": "Foundational",
      "distractors": [
        {
          "text": "Defined",
          "misconception": "Targets [level confusion]: Defined implies documented, standardized processes, not reactive testing."
        },
        {
          "text": "Managed",
          "misconception": "Targets [level confusion]: Managed involves quantitative measurement and control, beyond reactive fixes."
        },
        {
          "text": "Optimized",
          "misconception": "Targets [level confusion]: Optimized involves continuous improvement and proactive measures."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Performing security testing only post-development and reacting to findings is characteristic of an ad-hoc, reactive approach. This aligns with a foundational maturity level, where processes are inconsistent and not integrated early into the SDLC.",
        "distractor_analysis": "The distractors represent higher maturity levels where security is integrated earlier, processes are standardized, measured, and continuously improved, contrasting with the described reactive approach.",
        "analogy": "This scenario is like only checking if a car passed its safety inspection after it's already been driven off the lot and had an accident, rather than having safety checks during manufacturing."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": [
        "SECURE_SDLC_MATURITY_LEVELS",
        "REACTIVE_VS_PROACTIVE_SECURITY"
      ]
    },
    {
      "question_text": "What is the primary purpose of the 'Improve' capability within the OWASP SAMM framework?",
      "correct_answer": "To use assessment results to plan and implement enhancements to security practices.",
      "distractors": [
        {
          "text": "To document existing security policies and standards.",
          "misconception": "Targets [stage confusion]: Documentation is typically part of the 'Define' phase."
        },
        {
          "text": "To conduct initial security assessments of new projects.",
          "misconception": "Targets [stage confusion]: Initial assessment is part of 'Assess' or 'Measure'."
        },
        {
          "text": "To respond immediately to critical security vulnerabilities.",
          "misconception": "Targets [stage confusion]: Incident response is a separate function, though informed by maturity."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The 'Improve' capability in OWASP SAMM leverages the insights gained from measurement and assessment to drive positive change. It works by identifying specific actions and projects to enhance security practices, moving the organization towards higher maturity.",
        "distractor_analysis": "The distractors describe activities belonging to other SAMM capabilities ('Define', 'Measure', 'Respond') rather than the core purpose of using assessment data for planned enhancement.",
        "analogy": "The 'Improve' capability is like using feedback from a performance review to create a development plan, identifying specific training or actions needed to get better."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "OWASP_SAMM_IMPROVE",
        "CONTINUOUS_IMPROVEMENT"
      ]
    },
    {
      "question_text": "How do security maturity assessments contribute to the goals outlined in NIST SP 800-218 (SSDF)?",
      "correct_answer": "By identifying gaps in the implementation of SSDF practices, allowing for targeted improvements to reduce vulnerabilities.",
      "distractors": [
        {
          "text": "By providing a checklist of all required SSDF practices.",
          "misconception": "Targets [scope confusion]: SSDF provides practices, maturity assessment evaluates their implementation depth."
        },
        {
          "text": "By automatically certifying software developed according to SSDF.",
          "misconception": "Targets [purpose confusion]: Maturity assessments evaluate implementation, not provide certification."
        },
        {
          "text": "By replacing the need for secure coding training.",
          "misconception": "Targets [replacement fallacy]: Maturity assessments highlight training needs, not replace them."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NIST SP 800-218's SSDF recommends practices for secure development. Maturity assessments help organizations understand how well these practices are being adopted and executed, thereby enabling them to focus improvement efforts. This works by providing a baseline and roadmap for enhancing secure development capabilities.",
        "distractor_analysis": "The distractors incorrectly suggest maturity assessments provide checklists, certification, or replace training, rather than identifying implementation gaps for targeted improvement of SSDF practices.",
        "analogy": "Maturity assessments for SSDF are like a coach reviewing game footage to identify specific areas where players need to practice more, rather than just handing them the rulebook or declaring them champions."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_218_SSDF",
        "MATURITY_ASSESSMENT_PURPOSE"
      ]
    },
    {
      "question_text": "Which of the following best describes the 'Managed' maturity level in a typical application security context?",
      "correct_answer": "Security practices are documented, standardized, and quantitatively measured to ensure consistency and control.",
      "distractors": [
        {
          "text": "Security is performed in an ad-hoc, reactive manner.",
          "misconception": "Targets [level confusion]: This describes the 'Foundational' level."
        },
        {
          "text": "Security is a strategic business objective with continuous improvement.",
          "misconception": "Targets [level confusion]: This describes the 'Optimized' level."
        },
        {
          "text": "Security practices are defined but not consistently followed.",
          "misconception": "Targets [level confusion]: This describes the 'Defined' level."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The 'Managed' maturity level signifies that security practices are not only defined but also quantitatively measured and controlled. This allows for predictable outcomes and effective management of security risks, working by establishing metrics and process controls.",
        "distractor_analysis": "The distractors describe characteristics of the Foundational, Optimized, and Defined maturity levels, respectively, failing to capture the essence of documented, measured, and controlled practices.",
        "analogy": "A 'Managed' security level is like a well-run factory where processes are standardized, output is measured, and deviations are controlled, unlike a small workshop (Defined) or a home kitchen (Foundational)."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "MATURITY_MODEL_LEVELS",
        "PROCESS_MANAGEMENT"
      ]
    },
    {
      "question_text": "What is the primary role of security maturity assessments in relation to frameworks like NIST SP 800-53?",
      "correct_answer": "To evaluate the effectiveness and implementation depth of controls specified in NIST SP 800-53.",
      "distractors": [
        {
          "text": "To replace the need for implementing NIST SP 800-53 controls.",
          "misconception": "Targets [replacement fallacy]: Maturity assessments complement, not replace, control implementation."
        },
        {
          "text": "To define the specific security controls for an organization.",
          "misconception": "Targets [scope confusion]: NIST SP 800-53 defines controls; maturity assesses their application."
        },
        {
          "text": "To certify an organization's compliance with NIST SP 800-53.",
          "misconception": "Targets [certification confusion]: Maturity assessments provide insights, not formal certifications."
        }
      ],
      "detailed_explanation": {
        "core_logic": "NIST SP 800-53 provides a catalog of security and privacy controls. Maturity assessments help organizations understand how effectively these controls are implemented and managed, providing insights into their security posture beyond mere compliance. This works by evaluating the depth and consistency of control application.",
        "distractor_analysis": "The distractors incorrectly suggest maturity assessments replace controls, define controls, or provide certification, misrepresenting their supportive role in evaluating control effectiveness.",
        "analogy": "NIST SP 800-53 is like a building code specifying safety features. A maturity assessment is like an inspector checking how well those features are installed and maintained, not just if they are present."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_53",
        "SECURITY_CONTROL_ASSESSMENT"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 16,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "Security maturity assessment 008_Application Security best practices",
    "latency_ms": 26049.970999999998
  },
  "timestamp": "2026-01-18T11:54:08.862130"
}