{
  "topic_title": "PE-12 Emergency Lighting",
  "category": "Security Architecture And Engineering - Physical and Facility Security Design",
  "flashcards": [
    {
      "question_text": "According to NIST SP 800-53 Rev. 5, what is the primary requirement for PE-12 Emergency Lighting?",
      "correct_answer": "Employ and maintain automatic emergency lighting that activates during power outages and covers exits and evacuation routes.",
      "distractors": [
        {
          "text": "Install battery-powered emergency lights that require manual activation.",
          "misconception": "Targets [automation failure]: Assumes manual activation is acceptable, contrary to 'automatic' requirement."
        },
        {
          "text": "Ensure emergency lighting is only required in server rooms, not general facility areas.",
          "misconception": "Targets [scope limitation]: Incorrectly restricts coverage to specific high-risk areas, ignoring exits and routes."
        },
        {
          "text": "Provide emergency lighting that is tested annually without regard to power disruption events.",
          "misconception": "Targets [testing inadequacy]: Focuses on testing frequency rather than the critical 'activation during power outage' function."
        }
      ],
      "detailed_explanation": {
        "core_logic": "PE-12 mandates automatic emergency lighting because it ensures safe egress during power disruptions, functioning by activating independently of primary power to illuminate exits and routes.",
        "distractor_analysis": "The distractors misrepresent the core requirements by suggesting manual activation, limiting scope, or focusing solely on testing without the automatic activation during power loss.",
        "analogy": "Emergency lighting is like a building's 'backup eyes' that automatically turn on when the main lights go out, guiding everyone safely to the exits."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_53",
        "PHYSICAL_SECURITY_BASICS"
      ]
    },
    {
      "question_text": "What is the purpose of emergency lighting as defined by NIST SP 800-53, control PE-12?",
      "correct_answer": "To provide illumination for safe egress during power outages or disruptions, covering emergency exits and evacuation routes.",
      "distractors": [
        {
          "text": "To maintain continuous operation of critical IT systems during a power failure.",
          "misconception": "Targets [functional confusion]: Confuses lighting with emergency power systems (PE-11)."
        },
        {
          "text": "To deter unauthorized physical access by illuminating the facility perimeter.",
          "misconception": "Targets [security objective confusion]: Misattributes the primary purpose to deterrence rather than safety."
        },
        {
          "text": "To provide ambient lighting for security personnel during normal operations.",
          "misconception": "Targets [operational scope]: Incorrectly defines the purpose as routine lighting for staff, not emergency situations."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Emergency lighting (PE-12) is crucial for safety because it ensures that individuals can navigate and evacuate a facility during a power outage, functioning by providing independent illumination for exits and routes.",
        "distractor_analysis": "Distractors incorrectly associate emergency lighting with IT system continuity, perimeter security, or routine operational lighting, missing its core safety and egress function.",
        "analogy": "It's the emergency 'pathfinder' system for a building, ensuring you can see the way out when the main lights fail."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_53",
        "EMERGENCY_EGRESS"
      ]
    },
    {
      "question_text": "Which NIST SP 800-53 control family does PE-12 Emergency Lighting belong to?",
      "correct_answer": "Physical and Environmental Protection (PE)",
      "distractors": [
        {
          "text": "Contingency Planning (CP)",
          "misconception": "Targets [family misclassification]: Associates emergency lighting with disaster recovery planning rather than physical infrastructure."
        },
        {
          "text": "009_System and Communications Protection (SC)",
          "misconception": "Targets [family misclassification]: Incorrectly places it under network and data transmission security."
        },
        {
          "text": "Audit and Accountability (AU)",
          "misconception": "Targets [family misclassification]: Confuses physical safety measures with logging and auditing functions."
        }
      ],
      "detailed_explanation": {
        "core_logic": "PE-12 is in the Physical and Environmental Protection (PE) family because it directly addresses the physical infrastructure and environmental conditions necessary for secure operations, functioning by safeguarding the physical space.",
        "distractor_analysis": "The distractors incorrectly assign PE-12 to unrelated control families, demonstrating a misunderstanding of how NIST SP 800-53 categorizes security controls.",
        "analogy": "Think of control families like departments in a company; PE is the 'Facilities Management' department for security."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "remember",
      "prerequisites": [
        "NIST_SP_800_53_FAMILIES",
        "PHYSICAL_SECURITY_BASICS"
      ]
    },
    {
      "question_text": "What is the baseline impact level for PE-12 Emergency Lighting according to NIST SP 800-53?",
      "correct_answer": "Low, Moderate, and High",
      "distractors": [
        {
          "text": "Only Low",
          "misconception": "Targets [baseline scope]: Assumes emergency lighting is only a concern for low-impact systems."
        },
        {
          "text": "Only Moderate and High",
          "misconception": "Targets [baseline scope]: Incorrectly excludes low-impact systems from needing emergency lighting."
        },
        {
          "text": "Not specified, depends on the system's function",
          "misconception": "Targets [baseline specificity]: Overlooks that NIST SP 800-53 explicitly assigns baselines for this control."
        }
      ],
      "detailed_explanation": {
        "core_logic": "PE-12 applies to Low, Moderate, and High impact systems because safe egress is a fundamental requirement across all security impact levels, functioning by ensuring visibility regardless of system criticality.",
        "distractor_analysis": "The distractors incorrectly limit the applicability of emergency lighting to specific impact levels, failing to recognize its universal importance for safety.",
        "analogy": "Regardless of whether a building is a small office (Low), a medium-sized business (Moderate), or a critical infrastructure hub (High), everyone needs a clear path to exit in the dark."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_53_BASELINES",
        "IMPACT_LEVELS"
      ]
    },
    {
      "question_text": "A data center manager is reviewing the physical security controls for their facility. They need to ensure that in the event of a power outage, personnel can safely exit. Which NIST SP 800-53 control directly addresses this requirement?",
      "correct_answer": "PE-12 Emergency Lighting",
      "distractors": [
        {
          "text": "PE-11 Emergency Power",
          "misconception": "Targets [functional overlap]: Confuses lighting with power supply for IT equipment."
        },
        {
          "text": "PE-13 Fire Protection",
          "misconception": "Targets [related but distinct control]: Fire suppression is different from illumination for egress."
        },
        {
          "text": "PE-03 Physical Access Control",
          "misconception": "Targets [scope confusion]: Focuses on entry/exit points, not illumination during an outage."
        }
      ],
      "detailed_explanation": {
        "core_logic": "PE-12 Emergency Lighting is the correct control because it specifically mandates illumination for safe egress during power disruptions, functioning by providing light when the primary power fails.",
        "distractor_analysis": "The distractors represent other physical security controls that, while important, do not directly address the need for illumination during power outages for safe evacuation.",
        "analogy": "If the main power goes out in the data center, PE-12 is the system that turns on the 'exit signs' and pathway lights, not the system that keeps the servers running (PE-11)."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "apply",
      "prerequisites": [
        "NIST_SP_800_53_PE_FAMILY",
        "DATA_CENTER_SECURITY"
      ]
    },
    {
      "question_text": "What is a key characteristic of the emergency lighting required by PE-12, as per NIST SP 800-53?",
      "correct_answer": "It must activate automatically in the event of a power outage or disruption.",
      "distractors": [
        {
          "text": "It must be tested monthly by facility staff.",
          "misconception": "Targets [testing detail vs. core function]: Focuses on a potential testing procedure, not the primary activation requirement."
        },
        {
          "text": "It must provide sufficient light for reading detailed documents.",
          "misconception": "Targets [illumination level]: Overstates the required illumination level, which is for safe egress, not detailed work."
        },
        {
          "text": "It must integrate with the building's fire alarm system.",
          "misconception": "Targets [integration confusion]: While related, integration with fire alarms is not the primary mandate of PE-12 itself."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The automatic activation is critical because it ensures immediate illumination during unexpected power failures, functioning by relying on a separate power source or battery backup.",
        "distractor_analysis": "Distractors focus on secondary aspects like testing frequency, illumination intensity, or system integration, rather than the core requirement of automatic activation during power loss.",
        "analogy": "The lights must 'know' when the power is out and turn on by themselves, like a smoke detector sensing smoke without needing someone to flip a switch."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_53",
        "AUTOMATION_IN_SECURITY"
      ]
    },
    {
      "question_text": "Consider a facility with multiple floors and complex layouts. According to PE-12, what specific areas must emergency lighting cover?",
      "correct_answer": "Emergency exits and all evacuation routes within the facility.",
      "distractors": [
        {
          "text": "Only the main entrance and exit doors.",
          "misconception": "Targets [limited scope]: Restricts coverage to only the primary entry/exit points."
        },
        {
          "text": "All areas where IT equipment is located.",
          "misconception": "Targets [misplaced focus]: Prioritizes IT equipment areas over general egress paths."
        },
        {
          "text": "Only the corridors directly leading to emergency exits.",
          "misconception": "Targets [incomplete coverage]: Fails to account for the entire evacuation path from any point in the facility."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Coverage of emergency exits and evacuation routes is essential because it provides a clear and visible path for all occupants to safely leave the building, functioning by illuminating the entire egress path.",
        "distractor_analysis": "The distractors incorrectly narrow the scope of coverage to only main exits, IT areas, or partial corridors, failing to encompass the full requirement for comprehensive evacuation route illumination.",
        "analogy": "It's like ensuring every road sign on the way out of a maze is lit up, not just the final exit gate."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_53",
        "FACILITY_EGRESS_PLANNING"
      ]
    },
    {
      "question_text": "What is the relationship between PE-12 Emergency Lighting and PE-11 Emergency Power in NIST SP 800-53?",
      "correct_answer": "PE-11 ensures critical systems can continue operating or shut down safely, while PE-12 ensures occupants can safely evacuate.",
      "distractors": [
        {
          "text": "PE-11 provides power for PE-12, making them interdependent for basic function.",
          "misconception": "Targets [dependency confusion]: While both rely on power, PE-11 is for systems, PE-12 is for egress illumination, often with separate power sources."
        },
        {
          "text": "PE-12 is a subset of PE-11, focusing only on the lighting aspect of emergency power.",
          "misconception": "Targets [hierarchical confusion]: Incorrectly positions lighting as a component of emergency power systems rather than a distinct safety control."
        },
        {
          "text": "PE-11 and PE-12 are redundant controls addressing the same need for power continuity.",
          "misconception": "Targets [redundancy misinterpretation]: Fails to distinguish between powering critical systems and providing illumination for evacuation."
        }
      ],
      "detailed_explanation": {
        "core_logic": "They address different aspects of emergency preparedness: PE-11 supports system continuity or safe shutdown because it provides backup power, while PE-12 ensures occupant safety during outages by providing egress lighting.",
        "distractor_analysis": "Distractors incorrectly link PE-11 and PE-12 as directly dependent, misrepresent their hierarchical relationship, or claim they are redundant, missing their distinct but complementary roles.",
        "analogy": "PE-11 is like the backup generator for the hospital's life support machines, while PE-12 is like the emergency exit signs and pathway lights for patients and staff."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "comparison",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_53",
        "CONTINGENCY_PLANNING_CONTROLS"
      ]
    },
    {
      "question_text": "A security architect is designing the physical security for a new high-security facility. They are considering the requirements for PE-12 Emergency Lighting. What is a critical consideration for ensuring the effectiveness of this control?",
      "correct_answer": "The emergency lighting system must have a reliable, independent power source (e.g., battery backup or generator) that activates automatically.",
      "distractors": [
        {
          "text": "The lighting fixtures should be aesthetically pleasing to match the facility's design.",
          "misconception": "Targets [priority confusion]: Prioritizes aesthetics over the critical functional requirement of reliable power and activation."
        },
        {
          "text": "The system should be integrated with the building's HVAC controls for optimal energy use.",
          "misconception": "Targets [misplaced integration]: Focuses on energy efficiency integration, which is secondary to core safety function."
        },
        {
          "text": "The lighting intensity should be adjustable based on the time of day.",
          "misconception": "Targets [unnecessary complexity]: Introduces a feature not required by the standard and potentially detrimental to consistent egress illumination."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Reliable, independent power and automatic activation are paramount because the lighting must function precisely when the primary power fails, ensuring continuous safety during emergencies, working by using backup power sources.",
        "distractor_analysis": "The distractors introduce irrelevant considerations like aesthetics, energy efficiency integration, or adjustable intensity, diverting from the essential requirement of a dependable, automatic power source for emergency lighting.",
        "analogy": "For emergency lights, the most important thing is that they *always* turn on when needed, like a fire extinguisher that must be ready to use instantly, not just look good or save energy."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_53",
        "POWER_RELIABILITY_IN_SECURITY"
      ]
    },
    {
      "question_text": "Which of the following scenarios would LEAST likely be addressed by PE-12 Emergency Lighting?",
      "correct_answer": "A sudden, localized power surge that causes equipment malfunction but does not interrupt general facility lighting.",
      "distractors": [
        {
          "text": "A complete building power outage due to a grid failure.",
          "misconception": "Targets [primary use case]: This is the exact scenario PE-12 is designed for."
        },
        {
          "text": "A fire alarm triggers a partial shutdown of non-essential power systems.",
          "misconception": "Targets [secondary trigger]: While not a direct power outage, such events often lead to or coincide with lighting disruptions."
        },
        {
          "text": "A scheduled maintenance event temporarily cuts power to specific sections of the facility.",
          "misconception": "Targets [scheduled event]: PE-12 applies to any power disruption, scheduled or unscheduled, affecting egress."
        }
      ],
      "detailed_explanation": {
        "core_logic": "PE-12 is designed for situations where general lighting is lost due to power disruption, ensuring safe egress; a power surge that doesn't affect general lighting wouldn't trigger the need for emergency illumination.",
        "distractor_analysis": "The distractors describe scenarios where emergency lighting is directly applicable: complete outages, events causing power interruptions, and scheduled power cuts affecting egress paths.",
        "analogy": "Emergency lights are for when the 'main lights go out' (like a blackout). They aren't needed if only one appliance flickers briefly."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "scenario",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_53",
        "POWER_OUTAGE_RESPONSE"
      ]
    },
    {
      "question_text": "What is the role of emergency lighting (PE-12) in a facility's overall Business Continuity Plan (BCP)?",
      "correct_answer": "It supports the safety and evacuation aspects of the BCP by ensuring visibility during disruptions.",
      "distractors": [
        {
          "text": "It is the primary component for maintaining IT system operations during a disaster.",
          "misconception": "Targets [scope confusion]: Confuses safety/egress with IT system continuity, which is handled by other BCP elements like emergency power."
        },
        {
          "text": "It dictates the recovery time objectives (RTO) for critical business functions.",
          "misconception": "Targets [metric confusion]: Misassociates a physical safety control with BCP performance metrics."
        },
        {
          "text": "It is solely responsible for data backup and restoration procedures.",
          "misconception": "Targets [functional misattribution]: Incorrectly assigns data protection roles to a physical safety control."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Emergency lighting supports the BCP's safety objectives because it ensures personnel can evacuate during disruptive events, functioning by providing necessary visibility for safe movement.",
        "distractor_analysis": "The distractors incorrectly assign roles related to IT system continuity, RTOs, or data backup to emergency lighting, demonstrating a misunderstanding of its specific safety function within a BCP.",
        "analogy": "In a fire drill (BCP scenario), emergency lights are like the 'follow the green line' signs, ensuring everyone gets out safely, not the system that keeps the building's operations running."
      },
      "code_snippets": [],
      "difficulty": "advanced",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_53",
        "BUSINESS_CONTINUITY_PLANNING"
      ]
    },
    {
      "question_text": "According to the U.S. Department of Education's IT Physical and Environmental Protection Standard (Version 5.4), what is the baseline requirement for PE-12 Emergency Lighting?",
      "correct_answer": "Employ and maintain automatic emergency lighting that activates in the event of a power outage or disruption and covers emergency exits and evacuation routes.",
      "distractors": [
        {
          "text": "Install emergency lighting only in areas designated as High Value Assets (HVAs).",
          "misconception": "Targets [scope limitation]: Incorrectly restricts the requirement to HVAs, ignoring general facility safety."
        },
        {
          "text": "Ensure emergency lighting is tested quarterly and logged manually.",
          "misconception": "Targets [procedural detail vs. requirement]: Focuses on a specific testing method rather than the core requirement of automatic activation and coverage."
        },
        {
          "text": "Provide emergency lighting that is powered by the primary electrical grid with battery backup.",
          "misconception": "Targets [power source detail]: While battery backup is common, the emphasis is on independent activation during *any* power outage, not just grid failure."
        }
      ],
      "detailed_explanation": {
        "core_logic": "The standard mandates automatic activation and coverage of egress paths because this ensures immediate safety during power disruptions, functioning by providing reliable illumination when needed most.",
        "distractor_analysis": "Distractors incorrectly limit the scope, specify manual testing, or misrepresent the power source requirement, deviating from the explicit mandate for automatic, comprehensive emergency lighting.",
        "analogy": "The ED standard is like saying 'all emergency exits must have lights that turn on by themselves when the power goes out,' not just 'some exits need lights that someone remembers to turn on.'"
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "ED_IT_PE_STANDARD",
        "NIST_SP_800_53"
      ]
    },
    {
      "question_text": "What is the primary function of PE-12 Emergency Lighting in relation to physical security?",
      "correct_answer": "To ensure the safety of personnel by providing illumination for egress during power failures or other emergencies.",
      "distractors": [
        {
          "text": "To provide continuous surveillance of the facility perimeter.",
          "misconception": "Targets [functional misattribution]: Confuses lighting for egress with surveillance systems."
        },
        {
          "text": "To maintain the operational integrity of sensitive IT equipment.",
          "misconception": "Targets [scope confusion]: This relates to emergency power (PE-11), not lighting for evacuation."
        },
        {
          "text": "To facilitate the logging of all physical access attempts.",
          "misconception": "Targets [control misclassification]: This is related to access control and monitoring (PE-03, PE-06), not emergency illumination."
        }
      ],
      "detailed_explanation": {
        "core_logic": "PE-12's primary function is safety because it directly supports the physical security goal of protecting personnel during disruptions, functioning by illuminating escape routes when normal lighting fails.",
        "distractor_analysis": "The distractors incorrectly assign roles related to surveillance, IT operational integrity, or access logging to emergency lighting, demonstrating a lack of understanding of its specific safety purpose.",
        "analogy": "Emergency lighting is the building's 'safety net' for visibility during an emergency, ensuring people can find their way out, not a security camera or a backup generator."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "definition",
      "bloom_level": "understand",
      "prerequisites": [
        "NIST_SP_800_53",
        "PHYSICAL_SECURITY_OBJECTIVES"
      ]
    },
    {
      "question_text": "Which of the following is NOT a typical characteristic of emergency lighting systems mandated by PE-12?",
      "correct_answer": "They are powered solely by the main building electrical grid.",
      "distractors": [
        {
          "text": "They activate automatically upon loss of primary power.",
          "misconception": "Targets [core requirement]: This is a fundamental requirement of PE-12."
        },
        {
          "text": "They illuminate designated emergency exits and evacuation routes.",
          "misconception": "Targets [coverage requirement]: This defines the scope of illumination."
        },
        {
          "text": "They utilize a backup power source, such as batteries or a generator.",
          "misconception": "Targets [power source requirement]: This is essential for automatic activation during power loss."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Emergency lighting systems must have independent power sources because they need to function when the main grid fails, ensuring continuous illumination for safety, working by using batteries or generators.",
        "distractor_analysis": "The distractors describe essential features of PE-12 compliant systems: automatic activation, correct coverage, and backup power. The incorrect option suggests reliance solely on the main grid, which would defeat the purpose.",
        "analogy": "Emergency lights need their own 'emergency fuel' (like a backup battery), not just the regular fuel supply that might run out."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "analysis",
      "bloom_level": "analyze",
      "prerequisites": [
        "NIST_SP_800_53",
        "RELIABLE_POWER_SOURCES"
      ]
    },
    {
      "question_text": "In the context of NIST SP 800-53, what does the 'PE' in PE-12 Emergency Lighting stand for?",
      "correct_answer": "Physical and Environmental Protection",
      "distractors": [
        {
          "text": "Personnel Equipment",
          "misconception": "Targets [acronym misinterpretation]: Confuses physical facility aspects with personnel gear."
        },
        {
          "text": "Power Engineering",
          "misconception": "Targets [related but incorrect domain]: While power is involved, it's not the primary meaning of PE."
        },
        {
          "text": "Protection Enforcement",
          "misconception": "Targets [vague interpretation]: Too general and doesn't capture the environmental aspect."
        }
      ],
      "detailed_explanation": {
        "core_logic": "PE stands for Physical and Environmental Protection because this control family encompasses measures to safeguard the physical infrastructure and environment where information systems reside, functioning by securing the physical space.",
        "distractor_analysis": "The distractors offer plausible-sounding but incorrect expansions of the 'PE' acronym, demonstrating a lack of familiarity with NIST SP 800-53 control family nomenclature.",
        "analogy": "Think of 'PE' like a department name: 'Physical & Environmental Protection' is the department responsible for the building's safety and upkeep, including emergency lights."
      },
      "code_snippets": [],
      "difficulty": "foundational",
      "question_type": "definition",
      "bloom_level": "remember",
      "prerequisites": [
        "NIST_SP_800_53_FAMILIES",
        "ACRONYM_KNOWLEDGE"
      ]
    },
    {
      "question_text": "A facility has implemented PE-12 Emergency Lighting. What is a key operational consideration for maintaining its effectiveness over time?",
      "correct_answer": "Regular testing and maintenance of the lighting system and its power source.",
      "distractors": [
        {
          "text": "Ensuring the lighting fixtures are aesthetically modern.",
          "misconception": "Targets [priority confusion]: Aesthetics are secondary to functionality and reliability."
        },
        {
          "text": "Integrating the lighting system with smart building energy management.",
          "misconception": "Targets [misplaced integration]: Focuses on energy efficiency rather than core safety maintenance."
        },
        {
          "text": "Using the emergency lights as supplementary lighting during normal operations.",
          "misconception": "Targets [improper use]: Overuse can degrade battery life and lead to failure when actually needed."
        }
      ],
      "detailed_explanation": {
        "core_logic": "Regular testing and maintenance are crucial because they ensure the system will function correctly when needed, verifying the power source and illumination capabilities, working by proactively identifying and fixing potential issues.",
        "distractor_analysis": "The distractors suggest focusing on aesthetics, energy management, or improper operational use, which detract from the essential need for consistent testing and maintenance to ensure the emergency lighting remains functional.",
        "analogy": "Just like a car's emergency brake needs regular checks to ensure it works when you need it, emergency lights need regular testing to guarantee they'll turn on during a power failure."
      },
      "code_snippets": [],
      "difficulty": "intermediate",
      "question_type": "procedure",
      "bloom_level": "apply",
      "prerequisites": [
        "NIST_SP_800_53",
        "MAINTENANCE_OF_SECURITY_CONTROLS"
      ]
    }
  ],
  "generation_metadata": {
    "model": "google/gemini-2.5-flash-lite",
    "num_generated": 16,
    "temperature": 0.1,
    "web_citations": [],
    "research_method": "openrouter_web_plugin",
    "search_query": "PE-12 Emergency Lighting Security Architecture And Engineering best practices",
    "latency_ms": 26285.352
  },
  "timestamp": "2026-01-01T14:52:50.867570"
}